diff --git a/android/abi_gki_aarch64.xml b/android/abi_gki_aarch64.xml
index d0addd22180b..20ffa680ab3f 100644
--- a/android/abi_gki_aarch64.xml
+++ b/android/abi_gki_aarch64.xml
@@ -4438,6 +4438,11 @@
       <elf-symbol name='kmalloc_caches' size='224' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1c914fd5'/>
       <elf-symbol name='kobj_sysfs_ops' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa95ebdc0'/>
       <elf-symbol name='kstat' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x38869d88'/>
+      <elf-symbol name='kutrace_global_ops' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x18161b5e'/>
+      <elf-symbol name='kutrace_net_filter' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xb9876eeb'/>
+      <elf-symbol name='kutrace_pid_filter' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x8344ac91'/>
+      <elf-symbol name='kutrace_traceblock_per_cpu' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd8a17f84'/>
+      <elf-symbol name='kutrace_tracing' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xb456a31f'/>
       <elf-symbol name='loops_per_jiffy' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xba497f13'/>
       <elf-symbol name='memstart_addr' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x9688de8b'/>
       <elf-symbol name='names_cachep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x3096be16'/>
@@ -4508,6 +4513,13 @@
       <elf-symbol name='vb2_vmalloc_memops' size='120' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xcadb03e2'/>
     </elf-variable-symbols>
     <abi-instr address-size='64' language='LANG_C89' path='various'>
+      <function-type size-in-bits='64' id='00017875'>
+        <parameter type-id='0fbf3cfd'/>
+        <parameter type-id='f0981eeb'/>
+        <parameter type-id='8c493d8a'/>
+        <parameter type-id='405b934c'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='b5b8ebc4' size-in-bits='64' id='001b67aa'/>
       <enum-decl name='nl80211_connect_failed_reason' filepath='include/uapi/linux/nl80211.h' line='5999' column='1' id='001e6d82'>
         <underlying-type type-id='9cac1fee'/>
@@ -4519,7 +4531,7 @@
           <var-decl name='enabled' type-id='49178f86' visibility='default' filepath='include/linux/jump_label.h' line='88' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab609' visibility='default' filepath='include/linux/jump_label.h' line='102' column='1'/>
+          <var-decl name='' type-id='ac5ab5c8' visibility='default' filepath='include/linux/jump_label.h' line='102' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='fc8b497c' size-in-bits='64' id='0023218e'/>
@@ -4623,6 +4635,8 @@
       <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='1176' id='00bc0376'>
         <subrange length='147' type-id='7ff19f0f' id='351fcdaf'/>
       </array-type-def>
+      <pointer-type-def type-id='039b06ea' size-in-bits='64' id='00bc0f0c'/>
+      <pointer-type-def type-id='53acb60a' size-in-bits='64' id='00c1fc1c'/>
       <pointer-type-def type-id='4816a146' size-in-bits='64' id='00c4cbac'/>
       <pointer-type-def type-id='fe007c02' size-in-bits='64' id='00c7b870'/>
       <pointer-type-def type-id='6bf2c0de' size-in-bits='64' id='00ca7240'/>
@@ -4670,16 +4684,16 @@
           <var-decl name='rq_wait' type-id='b7f41d38' visibility='default' filepath='fs/aio.c' line='134' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1536'>
-          <var-decl name='' type-id='e7f43fc8' visibility='default' filepath='fs/aio.c' line='136' column='1'/>
+          <var-decl name='' type-id='e7f44027' visibility='default' filepath='fs/aio.c' line='136' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2048'>
-          <var-decl name='' type-id='e7f43fc9' visibility='default' filepath='fs/aio.c' line='148' column='1'/>
+          <var-decl name='' type-id='e7f44028' visibility='default' filepath='fs/aio.c' line='148' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2560'>
-          <var-decl name='' type-id='e7f43fca' visibility='default' filepath='fs/aio.c' line='153' column='1'/>
+          <var-decl name='' type-id='e7f44029' visibility='default' filepath='fs/aio.c' line='153' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='3584'>
-          <var-decl name='' type-id='e7f43fcb' visibility='default' filepath='fs/aio.c' line='158' column='1'/>
+          <var-decl name='' type-id='e7f4402a' visibility='default' filepath='fs/aio.c' line='158' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='4096'>
           <var-decl name='internal_pages' type-id='de8ffb46' visibility='default' filepath='fs/aio.c' line='164' column='1'/>
@@ -4774,6 +4788,14 @@
       </class-decl>
       <pointer-type-def type-id='8cd967bc' size-in-bits='64' id='00e8fe5a'/>
       <pointer-type-def type-id='4dbb5689' size-in-bits='64' id='00e96299'/>
+      <class-decl name='simple_xattrs' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/xattr.h' line='73' column='1' id='00ed5110'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='head' type-id='72f469ec' visibility='default' filepath='include/linux/xattr.h' line='74' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/linux/xattr.h' line='75' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='9e4acc7a' size-in-bits='64' id='00ee50b8'/>
       <class-decl name='iommu_fault_event' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/iommu.h' line='357' column='1' id='00f37356'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -4799,6 +4821,11 @@
       </class-decl>
       <typedef-decl name='efi_query_capsule_caps_t' type-id='558c7602' filepath='include/linux/efi.h' line='262' column='1' id='0112baf0'/>
       <pointer-type-def type-id='30913582' size-in-bits='64' id='0112fb3c'/>
+      <function-type size-in-bits='64' id='011362d8'>
+        <parameter type-id='acada613'/>
+        <parameter type-id='7fe42640'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='d6a1529b' size-in-bits='64' id='011a6d87'/>
       <pointer-type-def type-id='46c85660' size-in-bits='64' id='011c3e5a'/>
       <class-decl name='param_attribute' size-in-bits='512' is-struct='yes' visibility='default' filepath='kernel/params.c' line='523' column='1' id='0120aad5'>
@@ -5010,7 +5037,7 @@
           <var-decl name='ops' type-id='76e6e22f' visibility='default' filepath='include/sound/soc-topology.h' line='68' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
-          <var-decl name='' type-id='ac5ab681' visibility='default' filepath='include/sound/soc-topology.h' line='69' column='1'/>
+          <var-decl name='' type-id='ac5ab707' visibility='default' filepath='include/sound/soc-topology.h' line='69' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='448'>
           <var-decl name='private' type-id='eaa32e2f' visibility='default' filepath='include/sound/soc-topology.h' line='73' column='1'/>
@@ -5022,17 +5049,7 @@
       </array-type-def>
       <pointer-type-def type-id='ffad938a' size-in-bits='64' id='01ffd89c'/>
       <pointer-type-def type-id='400ed05a' size-in-bits='64' id='0200a298'/>
-      <class-decl name='bpf_xdp_link' size-in-bits='768' is-struct='yes' visibility='default' filepath='net/core/dev.c' line='8996' column='1' id='0200d321'>
-        <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='link' type-id='e07e9784' visibility='default' filepath='net/core/dev.c' line='8997' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='640'>
-          <var-decl name='dev' type-id='68a2d05b' visibility='default' filepath='net/core/dev.c' line='8998' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='704'>
-          <var-decl name='flags' type-id='95e97e5e' visibility='default' filepath='net/core/dev.c' line='8999' column='1'/>
-        </data-member>
-      </class-decl>
+      <class-decl name='bpf_xdp_link' is-struct='yes' visibility='default' is-declaration-only='yes' id='0200d321'/>
       <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='64' id='0209ab38'>
         <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
       </array-type-def>
@@ -5045,7 +5062,7 @@
       <qualified-type-def type-id='6eadcbe0' const='yes' id='02233ed7'/>
       <class-decl name='qstr' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/dcache.h' line='48' column='1' id='02244303'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab603' visibility='default' filepath='include/linux/dcache.h' line='49' column='1'/>
+          <var-decl name='' type-id='ac5ab5bb' visibility='default' filepath='include/linux/dcache.h' line='49' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
           <var-decl name='name' type-id='354f7eb9' visibility='default' filepath='include/linux/dcache.h' line='55' column='1'/>
@@ -5265,6 +5282,7 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='82f1f156' size-in-bits='64' id='02bc4f68'/>
+      <qualified-type-def type-id='cd8ce92b' const='yes' id='02bf2a9a'/>
       <pointer-type-def type-id='b5732d6f' size-in-bits='64' id='02c2e3f3'/>
       <function-type size-in-bits='64' id='02c44ccf'>
         <parameter type-id='1c936db9'/>
@@ -5313,6 +5331,7 @@
         <parameter type-id='7837cd88'/>
         <return type-id='80f4b756'/>
       </function-type>
+      <pointer-type-def type-id='02bf2a9a' size-in-bits='64' id='02f03310'/>
       <pointer-type-def type-id='a25ce1be' size-in-bits='64' id='02f11ed4'/>
       <function-type size-in-bits='64' id='02f1c4a9'>
         <parameter type-id='807b7702'/>
@@ -5334,7 +5353,65 @@
         <enumerator name='IOMMU_CAP_INTR_REMAP' value='1'/>
         <enumerator name='IOMMU_CAP_NOEXEC' value='2'/>
       </enum-decl>
-      <class-decl name='nameidata' is-struct='yes' visibility='default' is-declaration-only='yes' id='0319fc05'/>
+      <class-decl name='nameidata' size-in-bits='1792' is-struct='yes' visibility='default' filepath='fs/namei.c' line='505' column='1' id='0319fc05'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='path' type-id='b5382ece' visibility='default' filepath='fs/namei.c' line='506' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='last' type-id='02244303' visibility='default' filepath='fs/namei.c' line='507' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='root' type-id='b5382ece' visibility='default' filepath='fs/namei.c' line='508' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='inode' type-id='7e666abe' visibility='default' filepath='fs/namei.c' line='509' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='fs/namei.c' line='510' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='480'>
+          <var-decl name='seq' type-id='f0981eeb' visibility='default' filepath='fs/namei.c' line='511' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='m_seq' type-id='f0981eeb' visibility='default' filepath='fs/namei.c' line='511' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='544'>
+          <var-decl name='r_seq' type-id='f0981eeb' visibility='default' filepath='fs/namei.c' line='511' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='last_type' type-id='95e97e5e' visibility='default' filepath='fs/namei.c' line='512' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='608'>
+          <var-decl name='depth' type-id='f0981eeb' visibility='default' filepath='fs/namei.c' line='513' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='640'>
+          <var-decl name='total_link_count' type-id='95e97e5e' visibility='default' filepath='fs/namei.c' line='514' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='704'>
+          <var-decl name='stack' type-id='8543fa2a' visibility='default' filepath='fs/namei.c' line='520' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='768'>
+          <var-decl name='internal' type-id='04b7d390' visibility='default' filepath='fs/namei.c' line='520' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1536'>
+          <var-decl name='name' type-id='e9d22a06' visibility='default' filepath='fs/namei.c' line='521' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1600'>
+          <var-decl name='saved' type-id='26452515' visibility='default' filepath='fs/namei.c' line='522' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1664'>
+          <var-decl name='root_seq' type-id='f0981eeb' visibility='default' filepath='fs/namei.c' line='523' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1696'>
+          <var-decl name='dfd' type-id='95e97e5e' visibility='default' filepath='fs/namei.c' line='524' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1728'>
+          <var-decl name='dir_uid' type-id='d80b72e6' visibility='default' filepath='fs/namei.c' line='525' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1760'>
+          <var-decl name='dir_mode' type-id='2594b00f' visibility='default' filepath='fs/namei.c' line='526' column='1'/>
+        </data-member>
+      </class-decl>
       <function-type size-in-bits='64' id='031a4ff0'>
         <parameter type-id='c249b570'/>
         <return type-id='95e97e5e'/>
@@ -5372,6 +5449,7 @@
           <var-decl name='__crt_ctx' type-id='baf98fd3' visibility='default' filepath='include/linux/crypto.h' line='639' column='1'/>
         </data-member>
       </class-decl>
+      <pointer-type-def type-id='09101d01' size-in-bits='64' id='032c0add'/>
       <typedef-decl name='nf_hookfn' type-id='272e7e29' filepath='include/linux/netfilter.h' line='78' column='1' id='0331c4d6'/>
       <function-type size-in-bits='64' id='0332edd2'>
         <parameter type-id='0fbf3cfd'/>
@@ -5476,7 +5554,7 @@
           <var-decl name='completion_queue' type-id='0fbf3cfd' visibility='default' filepath='include/linux/netdevice.h' line='3283' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='768'>
-          <var-decl name='xmit' type-id='e7f4402f' visibility='default' filepath='include/linux/netdevice.h' line='3291' column='1'/>
+          <var-decl name='xmit' type-id='e7f440a5' visibility='default' filepath='include/linux/netdevice.h' line='3291' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1024'>
           <var-decl name='input_queue_head' type-id='f0981eeb' visibility='default' filepath='include/linux/netdevice.h' line='3296' column='1'/>
@@ -5508,11 +5586,11 @@
           <var-decl name='command' type-id='fa64b30d' visibility='default' filepath='include/linux/netdevice.h' line='928' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab646' visibility='default' filepath='include/linux/netdevice.h' line='929' column='1'/>
+          <var-decl name='' type-id='ac5ab682' visibility='default' filepath='include/linux/netdevice.h' line='929' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='f2c03b9b' size-in-bits='64' id='03676ee7'/>
-      <class-decl name='can_pkg_stats' size-in-bits='1024' is-struct='yes' visibility='default' filepath='include/../net/can/af_can.h' line='66' column='1' id='036e1e80'>
+      <class-decl name='can_pkg_stats' size-in-bits='1024' is-struct='yes' visibility='default' filepath='net/can/af_can.h' line='66' column='1' id='036e1e80'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='jiffies_init' type-id='7359adad' visibility='default' filepath='include/../net/can/af_can.h' line='67' column='1'/>
         </data-member>
@@ -5644,6 +5722,10 @@
         <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
         <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
       </array-type-def>
+      <function-type size-in-bits='64' id='039b06ea'>
+        <parameter type-id='944c4ff9'/>
+        <return type-id='48b5725f'/>
+      </function-type>
       <class-decl name='blk_mq_queue_data' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/blk-mq.h' line='273' column='1' id='03a1b8ac'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='rq' type-id='3dad1a48' visibility='default' filepath='include/linux/blk-mq.h' line='274' column='1'/>
@@ -5819,6 +5901,7 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='76b17fea' size-in-bits='64' id='047dcea8'/>
+      <pointer-type-def type-id='274c23aa' size-in-bits='64' id='04898764'/>
       <pointer-type-def type-id='e45577b8' size-in-bits='64' id='048b3ad6'/>
       <pointer-type-def type-id='7b596412' size-in-bits='64' id='0499c3f4'/>
       <pointer-type-def type-id='89f1cbf8' size-in-bits='64' id='04a219de'/>
@@ -5832,6 +5915,9 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='f154f192' size-in-bits='64' id='04b7616c'/>
+      <array-type-def dimensions='1' type-id='d3e6437c' size-in-bits='768' id='04b7d390'>
+        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
+      </array-type-def>
       <enum-decl name='dma_ctrl_flags' filepath='include/linux/dmaengine.h' line='195' column='1' id='04baee86'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='DMA_PREP_INTERRUPT' value='1'/>
@@ -5988,7 +6074,7 @@
           <var-decl name='e_perm' type-id='8efea9e5' visibility='default' filepath='include/linux/posix_acl.h' line='20' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='32'>
-          <var-decl name='' type-id='ac5ab667' visibility='default' filepath='include/linux/posix_acl.h' line='21' column='1'/>
+          <var-decl name='' type-id='ac5ab685' visibility='default' filepath='include/linux/posix_acl.h' line='21' column='1'/>
         </data-member>
       </class-decl>
       <array-type-def dimensions='1' type-id='98553e10' size-in-bits='6528' id='05487c29'>
@@ -6105,7 +6191,14 @@
       </function-type>
       <class-decl name='pci_vpd' is-struct='yes' visibility='default' is-declaration-only='yes' id='059a2256'/>
       <pointer-type-def type-id='96bf0a3b' size-in-bits='64' id='05a372cf'/>
-      <class-decl name='audit_tree_refs' is-struct='yes' visibility='default' is-declaration-only='yes' id='05a6e6cc'/>
+      <class-decl name='audit_tree_refs' size-in-bits='2048' is-struct='yes' visibility='default' filepath='kernel/auditsc.c' line='129' column='1' id='05a6e6cc'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='next' type-id='e9efa10a' visibility='default' filepath='kernel/auditsc.c' line='130' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='c' type-id='63d91190' visibility='default' filepath='kernel/auditsc.c' line='131' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='add29d6f' size-in-bits='64' id='05b00b8b'/>
       <class-decl name='drm_mode_fb_cmd2' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/uapi/drm/drm_mode.h' line='494' column='1' id='05bdad78'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -6347,6 +6440,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='f159f1b4' size-in-bits='64' id='065f4ac6'/>
+      <pointer-type-def type-id='95762a08' size-in-bits='64' id='066c338e'/>
       <function-type size-in-bits='64' id='066ca455'>
         <parameter type-id='fa0b179b'/>
         <parameter type-id='b59d7dce'/>
@@ -6737,6 +6831,14 @@
         <return type-id='48b5725f'/>
       </function-type>
       <pointer-type-def type-id='fc87d78f' size-in-bits='64' id='07d0a3e7'/>
+      <class-decl name='swap_cluster_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/swap.h' line='236' column='1' id='07d9955c'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='head' type-id='ed00f788' visibility='default' filepath='include/linux/swap.h' line='237' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='tail' type-id='ed00f788' visibility='default' filepath='include/linux/swap.h' line='238' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='b4a1f53d' size-in-bits='64' id='07da4e39'/>
       <function-type size-in-bits='64' id='07dc6635'>
         <parameter type-id='ff47b24b'/>
@@ -7040,10 +7142,42 @@
           <var-decl name='free' type-id='de50c37f' visibility='default' filepath='include/crypto/internal/hash.h' line='44' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1024'>
-          <var-decl name='' type-id='ac5ab5b1' visibility='default' filepath='include/crypto/internal/hash.h' line='45' column='1'/>
+          <var-decl name='' type-id='ac5ab605' visibility='default' filepath='include/crypto/internal/hash.h' line='45' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='8ef65cd1' size-in-bits='64' id='08d45f21'/>
+      <class-decl name='cec_pin_ops' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/media/cec-pin.h' line='36' column='1' id='08d82a05'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='read' type-id='cfad19e8' visibility='default' filepath='include/media/cec-pin.h' line='37' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='low' type-id='6dbc77f1' visibility='default' filepath='include/media/cec-pin.h' line='38' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='high' type-id='6dbc77f1' visibility='default' filepath='include/media/cec-pin.h' line='39' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='enable_irq' type-id='9c123d4e' visibility='default' filepath='include/media/cec-pin.h' line='40' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='disable_irq' type-id='6dbc77f1' visibility='default' filepath='include/media/cec-pin.h' line='41' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='free' type-id='6dbc77f1' visibility='default' filepath='include/media/cec-pin.h' line='42' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='status' type-id='c4365925' visibility='default' filepath='include/media/cec-pin.h' line='43' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='read_hpd' type-id='cfad19e8' visibility='default' filepath='include/media/cec-pin.h' line='44' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='read_5v' type-id='cfad19e8' visibility='default' filepath='include/media/cec-pin.h' line='45' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='received' type-id='6240ec2f' visibility='default' filepath='include/media/cec-pin.h' line='48' column='1'/>
+        </data-member>
+      </class-decl>
       <function-type size-in-bits='64' id='08dd4249'>
         <parameter type-id='27f3f5d8'/>
         <parameter type-id='cf29c9b3'/>
@@ -7095,7 +7229,7 @@
       </class-decl>
       <pointer-type-def type-id='4ca0c298' size-in-bits='64' id='08e531de'/>
       <pointer-type-def type-id='2c15778e' size-in-bits='64' id='08e5e0c8'/>
-      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='net/wireless/sme.c' line='34' column='1' id='08f5ca17'>
+      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='net/wireless/sme.c' line='34' column='1' id='08f5ca18'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='CFG80211_CONN_SCANNING' value='0'/>
         <enumerator name='CFG80211_CONN_SCAN_AGAIN' value='1'/>
@@ -7110,7 +7244,7 @@
         <enumerator name='CFG80211_CONN_ABANDON' value='10'/>
         <enumerator name='CFG80211_CONN_CONNECTED' value='11'/>
       </enum-decl>
-      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/net/bluetooth/hci_core.h' line='69' column='1' id='08f5ca18'>
+      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/net/bluetooth/hci_core.h' line='69' column='1' id='08f5ca19'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='DISCOVERY_STOPPED' value='0'/>
         <enumerator name='DISCOVERY_STARTING' value='1'/>
@@ -7118,21 +7252,21 @@
         <enumerator name='DISCOVERY_RESOLVING' value='3'/>
         <enumerator name='DISCOVERY_STOPPING' value='4'/>
       </enum-decl>
-      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/phy.h' line='326' column='1' id='08f5ca19'>
+      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/phy.h' line='326' column='1' id='08f5ca1b'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='MDIOBUS_ALLOCATED' value='1'/>
         <enumerator name='MDIOBUS_REGISTERED' value='2'/>
         <enumerator name='MDIOBUS_UNREGISTERED' value='3'/>
         <enumerator name='MDIOBUS_RELEASED' value='4'/>
       </enum-decl>
-      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/phy.h' line='359' column='1' id='08f5ca1a'>
+      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/phy.h' line='359' column='1' id='08f5ca1c'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='MDIOBUS_NO_CAP' value='0'/>
         <enumerator name='MDIOBUS_C22' value='1'/>
         <enumerator name='MDIOBUS_C45' value='2'/>
         <enumerator name='MDIOBUS_C22_C45' value='3'/>
       </enum-decl>
-      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/netdevice.h' line='2139' column='1' id='08f5ca1b'>
+      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/netdevice.h' line='2139' column='1' id='08f5ca1e'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='NETREG_UNINITIALIZED' value='0'/>
         <enumerator name='NETREG_REGISTERED' value='1'/>
@@ -7141,7 +7275,7 @@
         <enumerator name='NETREG_RELEASED' value='4'/>
         <enumerator name='NETREG_DUMMY' value='5'/>
       </enum-decl>
-      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/netdevice.h' line='2149' column='1' id='08f5ca1c'>
+      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/linux/netdevice.h' line='2149' column='1' id='08f5ca1f'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='RTNL_LINK_INITIALIZED' value='0'/>
         <enumerator name='RTNL_LINK_INITIALIZING' value='1'/>
@@ -7167,6 +7301,17 @@
       </class-decl>
       <qualified-type-def type-id='e094094c' const='yes' id='090a4485'/>
       <pointer-type-def type-id='edc58e1f' size-in-bits='64' id='090a6ee7'/>
+      <function-type size-in-bits='64' id='09101d01'>
+        <parameter type-id='0dc3586b'/>
+        <parameter type-id='7efbcaaf'/>
+        <parameter type-id='f0981eeb'/>
+        <parameter type-id='d61bf978'/>
+        <parameter type-id='95e97e5e'/>
+        <parameter type-id='95e97e5e'/>
+        <parameter type-id='b50a4934'/>
+        <parameter type-id='b50a4934'/>
+        <return type-id='48b5725f'/>
+      </function-type>
       <class-decl name='irq_domain_ops' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/irqdomain.h' line='106' column='1' id='0926e4bd'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='match' type-id='f1c95c76' visibility='default' filepath='include/linux/irqdomain.h' line='107' column='1'/>
@@ -7636,7 +7781,7 @@
           <var-decl name='stats' type-id='fbf2ba3a' visibility='default' filepath='include/linux/bpf.h' line='861' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='5056'>
-          <var-decl name='' type-id='ac5ab642' visibility='default' filepath='include/linux/bpf.h' line='862' column='1'/>
+          <var-decl name='' type-id='ac5ab67e' visibility='default' filepath='include/linux/bpf.h' line='862' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='5440'>
           <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/bpf.h' line='866' column='1'/>
@@ -7645,6 +7790,7 @@
       <pointer-type-def type-id='57bfbe05' size-in-bits='64' id='09dbca85'/>
       <pointer-type-def type-id='85bdf127' size-in-bits='64' id='09dcd1bf'/>
       <qualified-type-def type-id='b5b9216e' const='yes' id='09f052f7'/>
+      <pointer-type-def type-id='bdb32c88' size-in-bits='64' id='09f0b23a'/>
       <function-type size-in-bits='64' id='09f0c826'>
         <parameter type-id='6dca061b'/>
         <parameter type-id='eaa32e2f'/>
@@ -7790,7 +7936,7 @@
           <var-decl name='type' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2302' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='fmt' type-id='ac5ab5ec' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2312' column='1'/>
+          <var-decl name='fmt' type-id='ac5ab662' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2312' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='netns_nf' size-in-bits='1984' is-struct='yes' visibility='default' filepath='include/net/netns/netfilter.h' line='12' column='1' id='0a6298e0'>
@@ -7851,6 +7997,7 @@
       </function-type>
       <pointer-type-def type-id='7b49a935' size-in-bits='64' id='0a95e709'/>
       <pointer-type-def type-id='325adc8b' size-in-bits='64' id='0a9b173b'/>
+      <pointer-type-def type-id='1a8ed7df' size-in-bits='64' id='0aa1c7c3'/>
       <qualified-type-def type-id='486f930e' const='yes' id='0aade30f'/>
       <pointer-type-def type-id='c9365c7b' size-in-bits='64' id='0ab14abf'/>
       <class-decl name='drm_client_dev' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/drm/drm_client.h' line='70' column='1' id='0ab6a08c'>
@@ -7876,6 +8023,7 @@
           <var-decl name='modesets' type-id='8106240b' visibility='default' filepath='include/drm/drm_client.h' line='107' column='1'/>
         </data-member>
       </class-decl>
+      <pointer-type-def type-id='170c8692' size-in-bits='64' id='0abee587'/>
       <function-type size-in-bits='64' id='0ac430cb'>
         <parameter type-id='b7c1d7d5'/>
         <parameter type-id='cd012107'/>
@@ -7947,6 +8095,41 @@
         <parameter type-id='707be29c'/>
         <return type-id='b50a4934'/>
       </function-type>
+      <class-decl name='merkle_tree_params' size-in-bits='960' is-struct='yes' visibility='default' filepath='fs/verity/fsverity_private.h' line='45' column='1' id='0b26224b'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='hash_alg' type-id='c14ebfd3' visibility='default' filepath='fs/verity/fsverity_private.h' line='46' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='hashstate' type-id='bbaf3419' visibility='default' filepath='fs/verity/fsverity_private.h' line='47' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='digest_size' type-id='f0981eeb' visibility='default' filepath='fs/verity/fsverity_private.h' line='48' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='160'>
+          <var-decl name='block_size' type-id='f0981eeb' visibility='default' filepath='fs/verity/fsverity_private.h' line='49' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='hashes_per_block' type-id='f0981eeb' visibility='default' filepath='fs/verity/fsverity_private.h' line='50' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='224'>
+          <var-decl name='log_blocksize' type-id='f0981eeb' visibility='default' filepath='fs/verity/fsverity_private.h' line='51' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='log_arity' type-id='f0981eeb' visibility='default' filepath='fs/verity/fsverity_private.h' line='52' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='288'>
+          <var-decl name='num_levels' type-id='f0981eeb' visibility='default' filepath='fs/verity/fsverity_private.h' line='53' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='tree_size' type-id='91ce1af9' visibility='default' filepath='fs/verity/fsverity_private.h' line='54' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='level0_blocks' type-id='7359adad' visibility='default' filepath='fs/verity/fsverity_private.h' line='55' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='level_start' type-id='6094c99c' visibility='default' filepath='fs/verity/fsverity_private.h' line='61' column='1'/>
+        </data-member>
+      </class-decl>
       <enum-decl name='frs_typec_current' filepath='drivers/usb/typec/tcpm/tcpm.c' line='239' column='1' id='0b2a97f1'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='FRS_NOT_SUPPORTED' value='0'/>
@@ -8052,6 +8235,17 @@
       <pointer-type-def type-id='79256f62' size-in-bits='64' id='0b5f3d7c'/>
       <pointer-type-def type-id='05cdb97d' size-in-bits='64' id='0b603cc1'/>
       <pointer-type-def type-id='3f6ca798' size-in-bits='64' id='0b660ebe'/>
+      <class-decl name='arch_uprobe' size-in-bits='384' is-struct='yes' visibility='default' filepath='arch/arm64/include/asm/uprobes.h' line='24' column='1' id='0b6ba789'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='' type-id='ac5ab6b8' visibility='default' filepath='arch/arm64/include/asm/uprobes.h' line='25' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='api' type-id='f21a6717' visibility='default' filepath='arch/arm64/include/asm/uprobes.h' line='29' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='simulate' type-id='b50a4934' visibility='default' filepath='arch/arm64/include/asm/uprobes.h' line='30' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='5520e014' size-in-bits='64' id='0b6bd27e'/>
       <typedef-decl name='activate_complete' type-id='1ed1e4cd' filepath='include/scsi/scsi_dh.h' line='47' column='1' id='0b6eba4d'/>
       <function-type size-in-bits='64' id='0b70b14a'>
@@ -8108,6 +8302,12 @@
           <var-decl name='scan_active' type-id='7359adad' visibility='default' filepath='include/drm/drm_mm.h' line='213' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='0b8f3938'>
+        <parameter type-id='b3c6c7b8'/>
+        <parameter type-id='19c2251e'/>
+        <parameter type-id='7fe42640'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='71099d68' size-in-bits='64' id='0b8fca52'/>
       <enum-decl name='drm_connector_registration_state' filepath='include/drm/drm_connector.h' line='94' column='1' id='0b8fe6b9'>
         <underlying-type type-id='9cac1fee'/>
@@ -8346,7 +8546,7 @@
           <var-decl name='replay' type-id='74a8f9e9' visibility='default' filepath='include/uapi/linux/input.h' line='455' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
-          <var-decl name='u' type-id='ac5ab5d2' visibility='default' filepath='include/uapi/linux/input.h' line='463' column='1'/>
+          <var-decl name='u' type-id='ac5ab641' visibility='default' filepath='include/uapi/linux/input.h' line='463' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='1b04dce5' size-in-bits='64' id='0c6d12d5'/>
@@ -8358,7 +8558,14 @@
       <array-type-def dimensions='1' type-id='08ae2a9f' size-in-bits='256' id='0c7316af'>
         <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
       </array-type-def>
-      <class-decl name='uevent_sock' is-struct='yes' visibility='default' is-declaration-only='yes' id='0c7ab04d'/>
+      <class-decl name='uevent_sock' size-in-bits='192' is-struct='yes' visibility='default' filepath='lib/kobject_uevent.c' line='38' column='1' id='0c7ab04d'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='lib/kobject_uevent.c' line='39' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='sk' type-id='f772df6d' visibility='default' filepath='lib/kobject_uevent.c' line='40' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='65655453' size-in-bits='64' id='0c7d25ff'/>
       <pointer-type-def type-id='5344bebe' size-in-bits='64' id='0c7d3068'/>
       <class-decl name='iw_priv_args' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/uapi/linux/wireless.h' line='1063' column='1' id='0c842ad9'>
@@ -8386,7 +8593,7 @@
           <var-decl name='cpu_context' type-id='6a577ca5' visibility='default' filepath='arch/arm64/include/asm/processor.h' line='139' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='896'>
-          <var-decl name='uw' type-id='e7f43feb' visibility='default' filepath='arch/arm64/include/asm/processor.h' line='150' column='1'/>
+          <var-decl name='uw' type-id='e7f43f7f' visibility='default' filepath='arch/arm64/include/asm/processor.h' line='150' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='5248'>
           <var-decl name='android_vendor_data1' type-id='91ce1af9' visibility='default' filepath='arch/arm64/include/asm/processor.h' line='157' column='1'/>
@@ -8435,6 +8642,10 @@
           <var-decl name='ssid_len' type-id='f9b06939' visibility='default' filepath='include/net/cfg80211.h' line='2124' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='0c979a24'>
+        <parameter type-id='b94a2f7c'/>
+        <return type-id='b50a4934'/>
+      </function-type>
       <function-type size-in-bits='64' id='0c98f83d'>
         <parameter type-id='28271da3'/>
         <parameter type-id='b50a4934'/>
@@ -8522,7 +8733,7 @@
       </function-type>
       <class-decl name='pt_regs' size-in-bits='2688' is-struct='yes' visibility='default' filepath='arch/arm64/include/asm/ptrace.h' line='178' column='1' id='0d029111'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab595' visibility='default' filepath='arch/arm64/include/asm/ptrace.h' line='179' column='1'/>
+          <var-decl name='' type-id='ac5ab5b2' visibility='default' filepath='arch/arm64/include/asm/ptrace.h' line='179' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2176'>
           <var-decl name='orig_x0' type-id='91ce1af9' visibility='default' filepath='arch/arm64/include/asm/ptrace.h' line='188' column='1'/>
@@ -8700,6 +8911,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='2dd8407a' size-in-bits='64' id='0dbdf5f4'/>
+      <pointer-type-def type-id='41c62dab' size-in-bits='64' id='0dc3586b'/>
       <class-decl name='dma_device' size-in-bits='3648' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='850' column='1' id='0dcaa1e4'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='ref' type-id='400fb07b' visibility='default' filepath='include/linux/dmaengine.h' line='851' column='1'/>
@@ -8884,6 +9096,7 @@
       <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='368' id='0ddb15d8'>
         <subrange length='46' type-id='7ff19f0f' id='8b86bc1b'/>
       </array-type-def>
+      <pointer-type-def type-id='6652cba9' size-in-bits='64' id='0dde8c45'/>
       <pointer-type-def type-id='6ba772ee' size-in-bits='64' id='0de721e0'/>
       <pointer-type-def type-id='a8c11af0' size-in-bits='64' id='0dee990a'/>
       <qualified-type-def type-id='39b596d4' const='yes' id='0e085d99'/>
@@ -9076,6 +9289,7 @@
         <enumerator name='SND_COMPRESS_PLAYBACK' value='0'/>
         <enumerator name='SND_COMPRESS_CAPTURE' value='1'/>
       </enum-decl>
+      <pointer-type-def type-id='34a2420f' size-in-bits='64' id='0e87d404'/>
       <pointer-type-def type-id='5f5c9d88' size-in-bits='64' id='0e87f9be'/>
       <class-decl name='ipv6_devstat' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/net/if_inet6.h' line='164' column='1' id='0e97f526'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -9567,7 +9781,7 @@
           <var-decl name='profile_periodicity' type-id='f9b06939' visibility='default' filepath='include/net/mac80211.h' line='694' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2592'>
-          <var-decl name='he_oper' type-id='e7f4403f' visibility='default' filepath='include/net/mac80211.h' line='698' column='1'/>
+          <var-decl name='he_oper' type-id='e7f440b7' visibility='default' filepath='include/net/mac80211.h' line='698' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2656'>
           <var-decl name='he_obss_pd' type-id='198fcd88' visibility='default' filepath='include/net/mac80211.h' line='699' column='1'/>
@@ -10113,7 +10327,7 @@
           <var-decl name='padding' type-id='0209ab38' visibility='default' filepath='include/uapi/linux/iommu.h' line='334' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='448'>
-          <var-decl name='vendor' type-id='ac5ab5d6' visibility='default' filepath='include/uapi/linux/iommu.h' line='338' column='1'/>
+          <var-decl name='vendor' type-id='ac5ab5fb' visibility='default' filepath='include/uapi/linux/iommu.h' line='338' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='10e36dc5' size-in-bits='64' id='10f0a819'/>
@@ -10173,7 +10387,7 @@
           <var-decl name='type' type-id='80f4b756' visibility='default' filepath='include/linux/trace_events.h' line='200' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab59d' visibility='default' filepath='include/linux/trace_events.h' line='201' column='1'/>
+          <var-decl name='' type-id='ac5ab6a8' visibility='default' filepath='include/linux/trace_events.h' line='201' column='1'/>
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='111ab5a4'>
@@ -10374,7 +10588,7 @@
           <var-decl name='memory' type-id='635c3685' visibility='default' filepath='include/linux/memcontrol.h' line='218' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2816'>
-          <var-decl name='' type-id='ac5ab634' visibility='default' filepath='include/linux/memcontrol.h' line='220' column='1'/>
+          <var-decl name='' type-id='ac5ab5f0' visibility='default' filepath='include/linux/memcontrol.h' line='220' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='3712'>
           <var-decl name='kmem' type-id='635c3685' visibility='default' filepath='include/linux/memcontrol.h' line='226' column='1'/>
@@ -10637,7 +10851,7 @@
       <pointer-type-def type-id='99f57553' size-in-bits='64' id='1213819f'/>
       <union-decl name='hdmi_vendor_any_infoframe' size-in-bits='192' visibility='default' filepath='include/linux/hdmi.h' line='398' column='1' id='12153196'>
         <data-member access='public'>
-          <var-decl name='any' type-id='e7f43fc7' visibility='default' filepath='include/linux/hdmi.h' line='404' column='1'/>
+          <var-decl name='any' type-id='e7f44026' visibility='default' filepath='include/linux/hdmi.h' line='404' column='1'/>
         </data-member>
         <data-member access='public'>
           <var-decl name='hdmi' type-id='4db10e5c' visibility='default' filepath='include/linux/hdmi.h' line='405' column='1'/>
@@ -10879,7 +11093,7 @@
           <var-decl name='serial' type-id='c84025ab' visibility='default' filepath='include/linux/key.h' line='191' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab60c' visibility='default' filepath='include/linux/key.h' line='192' column='1'/>
+          <var-decl name='' type-id='ac5ab5a6' visibility='default' filepath='include/linux/key.h' line='192' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
           <var-decl name='sem' type-id='f19fdb93' visibility='default' filepath='include/linux/key.h' line='199' column='1'/>
@@ -10891,7 +11105,7 @@
           <var-decl name='security' type-id='eaa32e2f' visibility='default' filepath='include/linux/key.h' line='201' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='896'>
-          <var-decl name='' type-id='ac5ab60d' visibility='default' filepath='include/linux/key.h' line='202' column='1'/>
+          <var-decl name='' type-id='ac5ab5a7' visibility='default' filepath='include/linux/key.h' line='202' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='960'>
           <var-decl name='last_used_at' type-id='1afd27ac' visibility='default' filepath='include/linux/key.h' line='206' column='1'/>
@@ -10918,10 +11132,10 @@
           <var-decl name='flags' type-id='7359adad' visibility='default' filepath='include/linux/key.h' line='222' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1280'>
-          <var-decl name='' type-id='ac5ab60e' visibility='default' filepath='include/linux/key.h' line='239' column='1'/>
+          <var-decl name='' type-id='ac5ab5a8' visibility='default' filepath='include/linux/key.h' line='239' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1600'>
-          <var-decl name='' type-id='ac5ab60f' visibility='default' filepath='include/linux/key.h' line='254' column='1'/>
+          <var-decl name='' type-id='ac5ab5a9' visibility='default' filepath='include/linux/key.h' line='254' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1856'>
           <var-decl name='restrict_link' type-id='92daca01' visibility='default' filepath='include/linux/key.h' line='274' column='1'/>
@@ -11759,7 +11973,7 @@
           <var-decl name='header' type-id='23119536' visibility='default' filepath='include/linux/usb/pd.h' line='196' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='16'>
-          <var-decl name='' type-id='ac5ab5fc' visibility='default' filepath='include/linux/usb/pd.h' line='197' column='1'/>
+          <var-decl name='' type-id='ac5ab665' visibility='default' filepath='include/linux/usb/pd.h' line='197' column='1'/>
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='144e93b2'>
@@ -11799,7 +12013,7 @@
       <pointer-type-def type-id='850096b4' size-in-bits='64' id='146bc842'/>
       <class-decl name='worker' size-in-bits='1216' is-struct='yes' visibility='default' filepath='kernel/workqueue_internal.h' line='24' column='1' id='146df21f'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab662' visibility='default' filepath='kernel/workqueue_internal.h' line='26' column='1'/>
+          <var-decl name='' type-id='ac5ab6c7' visibility='default' filepath='kernel/workqueue_internal.h' line='26' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
           <var-decl name='current_work' type-id='83c1bde6' visibility='default' filepath='kernel/workqueue_internal.h' line='31' column='1'/>
@@ -12281,9 +12495,10 @@
         <subrange length='20' type-id='7ff19f0f' id='fdca39cf'/>
       </array-type-def>
       <pointer-type-def type-id='80b3d6aa' size-in-bits='64' id='157eca44'/>
+      <pointer-type-def type-id='504ee449' size-in-bits='64' id='1583af75'/>
       <class-decl name='bpf_cgroup_storage' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/linux/bpf-cgroup.h' line='53' column='1' id='15881542'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab596' visibility='default' filepath='include/linux/bpf-cgroup.h' line='54' column='1'/>
+          <var-decl name='' type-id='ac5ab5ba' visibility='default' filepath='include/linux/bpf-cgroup.h' line='54' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
           <var-decl name='map' type-id='b6a33eaf' visibility='default' filepath='include/linux/bpf-cgroup.h' line='58' column='1'/>
@@ -12411,7 +12626,7 @@
           <var-decl name='count' type-id='b59d7dce' visibility='default' filepath='include/linux/fs.h' line='358' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
-          <var-decl name='arg' type-id='ac5ab645' visibility='default' filepath='include/linux/fs.h' line='362' column='1'/>
+          <var-decl name='arg' type-id='ac5ab681' visibility='default' filepath='include/linux/fs.h' line='362' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
           <var-decl name='error' type-id='95e97e5e' visibility='default' filepath='include/linux/fs.h' line='363' column='1'/>
@@ -12564,85 +12779,85 @@
       </array-type-def>
       <class-decl name='compact_control' size-in-bits='1024' is-struct='yes' visibility='default' filepath='mm/internal.h' line='238' column='1' id='16773614'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='freepages' type-id='72f469ec' visibility='default' filepath='mm/internal.h' line='239' column='1'/>
+          <var-decl name='freepages' type-id='72f469ec' visibility='default' filepath='kernel/events/../../mm/internal.h' line='239' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
-          <var-decl name='migratepages' type-id='72f469ec' visibility='default' filepath='mm/internal.h' line='240' column='1'/>
+          <var-decl name='migratepages' type-id='72f469ec' visibility='default' filepath='kernel/events/../../mm/internal.h' line='240' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
-          <var-decl name='nr_freepages' type-id='f0981eeb' visibility='default' filepath='mm/internal.h' line='241' column='1'/>
+          <var-decl name='nr_freepages' type-id='f0981eeb' visibility='default' filepath='kernel/events/../../mm/internal.h' line='241' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='288'>
-          <var-decl name='nr_migratepages' type-id='f0981eeb' visibility='default' filepath='mm/internal.h' line='242' column='1'/>
+          <var-decl name='nr_migratepages' type-id='f0981eeb' visibility='default' filepath='kernel/events/../../mm/internal.h' line='242' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='320'>
-          <var-decl name='free_pfn' type-id='7359adad' visibility='default' filepath='mm/internal.h' line='243' column='1'/>
+          <var-decl name='free_pfn' type-id='7359adad' visibility='default' filepath='kernel/events/../../mm/internal.h' line='243' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='384'>
-          <var-decl name='migrate_pfn' type-id='7359adad' visibility='default' filepath='mm/internal.h' line='244' column='1'/>
+          <var-decl name='migrate_pfn' type-id='7359adad' visibility='default' filepath='kernel/events/../../mm/internal.h' line='244' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='448'>
-          <var-decl name='fast_start_pfn' type-id='7359adad' visibility='default' filepath='mm/internal.h' line='245' column='1'/>
+          <var-decl name='fast_start_pfn' type-id='7359adad' visibility='default' filepath='kernel/events/../../mm/internal.h' line='245' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='512'>
-          <var-decl name='zone' type-id='0a0aff97' visibility='default' filepath='mm/internal.h' line='246' column='1'/>
+          <var-decl name='zone' type-id='0a0aff97' visibility='default' filepath='kernel/events/../../mm/internal.h' line='246' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='576'>
-          <var-decl name='total_migrate_scanned' type-id='7359adad' visibility='default' filepath='mm/internal.h' line='247' column='1'/>
+          <var-decl name='total_migrate_scanned' type-id='7359adad' visibility='default' filepath='kernel/events/../../mm/internal.h' line='247' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='640'>
-          <var-decl name='total_free_scanned' type-id='7359adad' visibility='default' filepath='mm/internal.h' line='248' column='1'/>
+          <var-decl name='total_free_scanned' type-id='7359adad' visibility='default' filepath='kernel/events/../../mm/internal.h' line='248' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='704'>
-          <var-decl name='fast_search_fail' type-id='8efea9e5' visibility='default' filepath='mm/internal.h' line='249' column='1'/>
+          <var-decl name='fast_search_fail' type-id='8efea9e5' visibility='default' filepath='kernel/events/../../mm/internal.h' line='249' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='720'>
-          <var-decl name='search_order' type-id='a2185560' visibility='default' filepath='mm/internal.h' line='250' column='1'/>
+          <var-decl name='search_order' type-id='a2185560' visibility='default' filepath='kernel/events/../../mm/internal.h' line='250' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='736'>
-          <var-decl name='gfp_mask' type-id='96d7cfec' visibility='default' filepath='mm/internal.h' line='251' column='1'/>
+          <var-decl name='gfp_mask' type-id='96d7cfec' visibility='default' filepath='kernel/events/../../mm/internal.h' line='251' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='768'>
-          <var-decl name='order' type-id='95e97e5e' visibility='default' filepath='mm/internal.h' line='252' column='1'/>
+          <var-decl name='order' type-id='95e97e5e' visibility='default' filepath='kernel/events/../../mm/internal.h' line='252' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='800'>
-          <var-decl name='migratetype' type-id='95e97e5e' visibility='default' filepath='mm/internal.h' line='253' column='1'/>
+          <var-decl name='migratetype' type-id='95e97e5e' visibility='default' filepath='kernel/events/../../mm/internal.h' line='253' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='832'>
-          <var-decl name='alloc_flags' type-id='20f5f452' visibility='default' filepath='mm/internal.h' line='254' column='1'/>
+          <var-decl name='alloc_flags' type-id='20f5f452' visibility='default' filepath='kernel/events/../../mm/internal.h' line='254' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='864'>
-          <var-decl name='highest_zoneidx' type-id='2448a865' visibility='default' filepath='mm/internal.h' line='255' column='1'/>
+          <var-decl name='highest_zoneidx' type-id='2448a865' visibility='default' filepath='kernel/events/../../mm/internal.h' line='255' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='896'>
-          <var-decl name='mode' type-id='157252dd' visibility='default' filepath='mm/internal.h' line='256' column='1'/>
+          <var-decl name='mode' type-id='157252dd' visibility='default' filepath='kernel/events/../../mm/internal.h' line='256' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='928'>
-          <var-decl name='ignore_skip_hint' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='257' column='1'/>
+          <var-decl name='ignore_skip_hint' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='257' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='936'>
-          <var-decl name='no_set_skip_hint' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='258' column='1'/>
+          <var-decl name='no_set_skip_hint' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='258' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='944'>
-          <var-decl name='ignore_block_suitable' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='259' column='1'/>
+          <var-decl name='ignore_block_suitable' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='259' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='952'>
-          <var-decl name='direct_compaction' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='260' column='1'/>
+          <var-decl name='direct_compaction' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='260' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='960'>
-          <var-decl name='proactive_compaction' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='261' column='1'/>
+          <var-decl name='proactive_compaction' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='261' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='968'>
-          <var-decl name='whole_zone' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='262' column='1'/>
+          <var-decl name='whole_zone' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='262' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='976'>
-          <var-decl name='contended' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='263' column='1'/>
+          <var-decl name='contended' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='263' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='984'>
-          <var-decl name='rescan' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='264' column='1'/>
+          <var-decl name='rescan' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='264' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='992'>
-          <var-decl name='alloc_contig' type-id='b50a4934' visibility='default' filepath='mm/internal.h' line='265' column='1'/>
+          <var-decl name='alloc_contig' type-id='b50a4934' visibility='default' filepath='kernel/events/../../mm/internal.h' line='265' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='59a625dc' size-in-bits='64' id='168dc242'/>
@@ -12669,7 +12884,7 @@
           <var-decl name='hash' type-id='7359adad' visibility='default' filepath='include/linux/key.h' line='110' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab60b' visibility='default' filepath='include/linux/key.h' line='111' column='1'/>
+          <var-decl name='' type-id='ac5ab5ca' visibility='default' filepath='include/linux/key.h' line='111' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
           <var-decl name='type' type-id='d0a699d1' visibility='default' filepath='include/linux/key.h' line='123' column='1'/>
@@ -12731,7 +12946,7 @@
           <var-decl name='lockeddevcnt' type-id='f0981eeb' visibility='default' filepath='include/net/sch_generic.h' line='468' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1664'>
-          <var-decl name='chain0' type-id='e7f44012' visibility='default' filepath='include/net/sch_generic.h' line='472' column='1'/>
+          <var-decl name='chain0' type-id='e7f44054' visibility='default' filepath='include/net/sch_generic.h' line='472' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1856'>
           <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='include/net/sch_generic.h' line='473' column='1'/>
@@ -12744,11 +12959,6 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='bccdf330' size-in-bits='64' id='16c53416'/>
-      <function-type size-in-bits='64' id='16c9c8d4'>
-        <parameter type-id='1fc888a9'/>
-        <parameter type-id='f8dc9def'/>
-        <return type-id='48b5725f'/>
-      </function-type>
       <pointer-type-def type-id='23a849db' size-in-bits='64' id='16cfe92b'/>
       <pointer-type-def type-id='00d2c7e1' size-in-bits='64' id='16d08491'/>
       <pointer-type-def type-id='9666e837' size-in-bits='64' id='16d5931b'/>
@@ -12925,7 +13135,7 @@
           <var-decl name='name' type-id='26a90f95' visibility='default' filepath='include/linux/sched/topology.h' line='141' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2048'>
-          <var-decl name='' type-id='ac5ab660' visibility='default' filepath='include/linux/sched/topology.h' line='143' column='1'/>
+          <var-decl name='' type-id='ac5ab6be' visibility='default' filepath='include/linux/sched/topology.h' line='143' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2176'>
           <var-decl name='shared' type-id='774b23cf' visibility='default' filepath='include/linux/sched/topology.h' line='147' column='1'/>
@@ -12944,6 +13154,7 @@
         </data-member>
       </class-decl>
       <qualified-type-def type-id='d9ceb659' const='yes' id='170bab5e'/>
+      <typedef-decl name='probe_opcode_t' type-id='19c2251e' filepath='arch/arm64/include/asm/probes.h' line='12' column='1' id='170c8692'/>
       <pointer-type-def type-id='e74bcc7b' size-in-bits='64' id='170cc62f'/>
       <pointer-type-def type-id='4aa2ba58' size-in-bits='64' id='170fcd6a'/>
       <class-decl name='gen_pool' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/genalloc.h' line='58' column='1' id='171b0f6c'>
@@ -13027,6 +13238,12 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='d34384db' size-in-bits='64' id='17451907'/>
+      <function-type size-in-bits='64' id='17483488'>
+        <parameter type-id='e579788a'/>
+        <parameter type-id='2ae08426'/>
+        <parameter type-id='d02f4143'/>
+        <return type-id='e9265215'/>
+      </function-type>
       <enum-decl name='hk_flags' filepath='include/linux/sched/isolation.h' line='8' column='1' id='174b493d'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='HK_FLAG_TIMER' value='1'/>
@@ -13113,7 +13330,6 @@
       <qualified-type-def type-id='a240f41d' const='yes' id='17644e8c'/>
       <pointer-type-def type-id='78719a99' size-in-bits='64' id='1767a135'/>
       <pointer-type-def type-id='0f7f118a' size-in-bits='64' id='1768bf8c'/>
-      <pointer-type-def type-id='891a6859' size-in-bits='64' id='176d60a1'/>
       <function-type size-in-bits='64' id='1774d144'>
         <parameter type-id='666fb412'/>
         <parameter type-id='68a2d05b'/>
@@ -13339,6 +13555,14 @@
         <parameter type-id='3ff5601b'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <class-decl name='iomap_page_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/iomap.h' line='130' column='1' id='17ffbd3e'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='page_prepare' type-id='bbbc8ee7' visibility='default' filepath='include/linux/iomap.h' line='131' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='page_done' type-id='cb8ede2b' visibility='default' filepath='include/linux/iomap.h' line='133' column='1'/>
+        </data-member>
+      </class-decl>
       <enum-decl name='iio_event_direction' filepath='include/uapi/linux/iio/types.h' line='109' column='1' id='180bfe06'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='IIO_EV_DIR_EITHER' value='0'/>
@@ -14233,9 +14457,18 @@
         <parameter type-id='eaa32e2f'/>
         <return type-id='4bdecfd7'/>
       </function-type>
+      <function-type size-in-bits='64' id='1a03a546'>
+        <parameter type-id='d26fc4bf'/>
+        <parameter type-id='28379b39'/>
+        <parameter type-id='95e97e5e'/>
+        <parameter type-id='95e97e5e'/>
+        <parameter type-id='5f9774b0'/>
+        <parameter type-id='f9409001'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <class-decl name='v4l2_ext_controls' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1741' column='1' id='1a041cb4'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab5e7' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1742' column='1'/>
+          <var-decl name='' type-id='ac5ab65d' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1742' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='32'>
           <var-decl name='count' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1748' column='1'/>
@@ -14566,6 +14799,11 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <qualified-type-def type-id='c20dd28d' const='yes' id='1a814584'/>
+      <function-type size-in-bits='64' id='1a8ed7df'>
+        <parameter type-id='0fbf3cfd'/>
+        <parameter type-id='dc1ef2b7'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <union-decl name='i2c_smbus_data' size-in-bits='272' visibility='default' filepath='include/uapi/linux/i2c.h' line='135' column='1' id='1a96c066'>
         <data-member access='public'>
           <var-decl name='byte' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/i2c.h' line='136' column='1'/>
@@ -14599,7 +14837,7 @@
           <var-decl name='seq_ctrl' type-id='23119536' visibility='default' filepath='include/linux/ieee80211.h' line='1097' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='u' type-id='ac5ab677' visibility='default' filepath='include/linux/ieee80211.h' line='1257' column='1'/>
+          <var-decl name='u' type-id='ac5ab6fd' visibility='default' filepath='include/linux/ieee80211.h' line='1257' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='crypto_shash_spawn' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/crypto/internal/hash.h' line='58' column='1' id='1aafc68e'>
@@ -14808,12 +15046,13 @@
       </class-decl>
       <union-decl name='pn' size-in-bits='64' visibility='default' filepath='include/net/macsec.h' line='31' column='1' id='1b1f0e7e'>
         <data-member access='public'>
-          <var-decl name='' type-id='e7f43f95' visibility='default' filepath='include/net/macsec.h' line='32' column='1'/>
+          <var-decl name='' type-id='e7f44006' visibility='default' filepath='include/net/macsec.h' line='32' column='1'/>
         </data-member>
         <data-member access='public'>
           <var-decl name='full64' type-id='91ce1af9' visibility='default' filepath='include/net/macsec.h' line='43' column='1'/>
         </data-member>
       </union-decl>
+      <pointer-type-def type-id='011362d8' size-in-bits='64' id='1b33fc1a'/>
       <function-type size-in-bits='64' id='1b343ea9'>
         <parameter type-id='b9aa0100'/>
         <parameter type-id='26a90f95'/>
@@ -14844,6 +15083,7 @@
         <parameter type-id='75099793'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <pointer-type-def type-id='f4f74d50' size-in-bits='64' id='1b4ef70e'/>
       <function-type size-in-bits='64' id='1b555b55'>
         <parameter type-id='442b8d89'/>
         <parameter type-id='bfc022f4'/>
@@ -15428,6 +15668,32 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='99690429' size-in-bits='64' id='1cebc84d'/>
+      <class-decl name='bpf_prog_offload_ops' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/linux/bpf.h' line='471' column='1' id='1cf1b931'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='insn_hook' type-id='ae2f55a8' visibility='default' filepath='include/linux/bpf.h' line='473' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='finalize' type-id='ef9331ba' visibility='default' filepath='include/linux/bpf.h' line='475' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='replace_insn' type-id='8216cbc2' visibility='default' filepath='include/linux/bpf.h' line='477' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='remove_insns' type-id='f09703a8' visibility='default' filepath='include/linux/bpf.h' line='479' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='prepare' type-id='8f70b268' visibility='default' filepath='include/linux/bpf.h' line='481' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='translate' type-id='8f70b268' visibility='default' filepath='include/linux/bpf.h' line='482' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='destroy' type-id='70419063' visibility='default' filepath='include/linux/bpf.h' line='483' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/bpf.h' line='484' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='8f68aa3b' size-in-bits='64' id='1cf47bfb'/>
       <pointer-type-def type-id='1cbdedf4' size-in-bits='64' id='1cfd747a'/>
       <class-decl name='if_settings' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/uapi/linux/if.h' line='207' column='1' id='1cff49be'>
@@ -15438,7 +15704,7 @@
           <var-decl name='size' type-id='f0981eeb' visibility='default' filepath='include/uapi/linux/if.h' line='209' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='ifs_ifsu' type-id='ac5ab65b' visibility='default' filepath='include/uapi/linux/if.h' line='222' column='1'/>
+          <var-decl name='ifs_ifsu' type-id='ac5ab69b' visibility='default' filepath='include/uapi/linux/if.h' line='222' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='cgroup_subsys' size-in-bits='1920' is-struct='yes' visibility='default' filepath='include/linux/cgroup-defs.h' line='622' column='1' id='1d115fd5'>
@@ -15872,7 +16138,7 @@
           <var-decl name='base' type-id='7aeccae5' visibility='default' filepath='include/linux/ethtool.h' line='122' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='384'>
-          <var-decl name='link_modes' type-id='e7f44007' visibility='default' filepath='include/linux/ethtool.h' line='127' column='1'/>
+          <var-decl name='link_modes' type-id='e7f44044' visibility='default' filepath='include/linux/ethtool.h' line='127' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='input_mt_pos' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/input/mt.h' line='119' column='1' id='1e25d1dc'>
@@ -16131,13 +16397,12 @@
           <var-decl name='padding' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/iommu.h' line='117' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab5d4' visibility='default' filepath='include/uapi/linux/iommu.h' line='118' column='1'/>
+          <var-decl name='' type-id='ac5ab5f9' visibility='default' filepath='include/uapi/linux/iommu.h' line='118' column='1'/>
         </data-member>
       </class-decl>
       <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1008' id='1f1c2468'>
         <subrange length='126' type-id='7ff19f0f' id='1ad3f470'/>
       </array-type-def>
-      <pointer-type-def type-id='a286a01c' size-in-bits='64' id='1f1dd1be'/>
       <function-type size-in-bits='64' id='1f1ec116'>
         <parameter type-id='fa0b179b'/>
         <return type-id='91ce1af9'/>
@@ -16310,6 +16575,7 @@
           <var-decl name='packets' type-id='d3130597' visibility='default' filepath='include/net/gen_stats.h' line='13' column='1'/>
         </data-member>
       </class-decl>
+      <pointer-type-def type-id='f23d64e3' size-in-bits='64' id='1fa5a86b'/>
       <class-decl name='xhci_vendor_ops' size-in-bits='768' is-struct='yes' visibility='default' filepath='drivers/usb/host/xhci.h' line='2241' column='1' id='1faef6b3'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='vendor_init' type-id='e2d5afe3' visibility='default' filepath='drivers/usb/host/xhci.h' line='2242' column='1'/>
@@ -16404,7 +16670,6 @@
           <var-decl name='offset' type-id='c165e8b9' visibility='default' filepath='include/linux/remoteproc.h' line='77' column='1'/>
         </data-member>
       </class-decl>
-      <pointer-type-def type-id='c6b3a279' size-in-bits='64' id='1fc888a9'/>
       <function-type size-in-bits='64' id='1fc93694'>
         <parameter type-id='fa0b179b'/>
         <parameter type-id='95e97e5e'/>
@@ -16465,6 +16730,14 @@
         <parameter type-id='7292109c'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <class-decl name='agp_version' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/agp_backend.h' line='40' column='1' id='203080b0'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='major' type-id='1dc6a898' visibility='default' filepath='include/linux/agp_backend.h' line='41' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='16'>
+          <var-decl name='minor' type-id='1dc6a898' visibility='default' filepath='include/linux/agp_backend.h' line='42' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='d921fc28' size-in-bits='64' id='203080e2'/>
       <function-type size-in-bits='64' id='20332031'>
         <parameter type-id='419266fd'/>
@@ -16819,7 +17092,7 @@
       <qualified-type-def type-id='ec55eb74' const='yes' id='21109a44'/>
       <class-decl name='flowi' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/net/flow.h' line='174' column='1' id='2117397c'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='u' type-id='ac5ab64a' visibility='default' filepath='include/net/flow.h' line='180' column='1'/>
+          <var-decl name='u' type-id='ac5ab689' visibility='default' filepath='include/net/flow.h' line='180' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='26527266' size-in-bits='64' id='211c185c'/>
@@ -17272,7 +17545,7 @@
           <var-decl name='tx_time_est' type-id='19c2251e' visibility='default' filepath='include/net/mac80211.h' line='1056' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab673' visibility='default' filepath='include/net/mac80211.h' line='1059' column='1'/>
+          <var-decl name='' type-id='ac5ab6dd' visibility='default' filepath='include/net/mac80211.h' line='1059' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='345f1a5f' size-in-bits='64' id='2227a3ab'/>
@@ -17289,7 +17562,17 @@
         <return type-id='48b5725f'/>
       </function-type>
       <pointer-type-def type-id='6038e38f' size-in-bits='64' id='22428037'/>
-      <class-decl name='bpf_offload_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='22474385'/>
+      <class-decl name='bpf_offload_dev' size-in-bits='256' is-struct='yes' visibility='default' filepath='kernel/bpf/offload.c' line='35' column='1' id='22474385'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='ops' type-id='1b4ef70e' visibility='default' filepath='kernel/bpf/offload.c' line='36' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='netdevs' type-id='72f469ec' visibility='default' filepath='kernel/bpf/offload.c' line='37' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='priv' type-id='eaa32e2f' visibility='default' filepath='kernel/bpf/offload.c' line='38' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='ufs_hba_monitor' size-in-bits='1152' is-struct='yes' visibility='default' filepath='drivers/scsi/ufs/ufshcd.h' line='745' column='1' id='2251b9ac'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='chunk_size' type-id='7359adad' visibility='default' filepath='drivers/scsi/ufs/ufshcd.h' line='746' column='1'/>
@@ -17465,6 +17748,14 @@
       <pointer-type-def type-id='1ea25720' size-in-bits='64' id='22c1973a'/>
       <pointer-type-def type-id='7e4a9bc8' size-in-bits='64' id='22c37a8a'/>
       <qualified-type-def type-id='0e2723e7' const='yes' id='22c4fd1a'/>
+      <function-type size-in-bits='64' id='22d52e50'>
+        <parameter type-id='91ce1af9'/>
+        <parameter type-id='91ce1af9'/>
+        <parameter type-id='91ce1af9'/>
+        <parameter type-id='91ce1af9'/>
+        <parameter type-id='91ce1af9'/>
+        <return type-id='91ce1af9'/>
+      </function-type>
       <class-decl name='cpuidle_state_kobj' is-struct='yes' visibility='default' is-declaration-only='yes' id='22d74cfc'/>
       <function-type size-in-bits='64' id='22ddde2b'>
         <parameter type-id='5771c601'/>
@@ -17685,87 +17976,87 @@
           <var-decl name='key' type-id='00205383' visibility='default' filepath='include/linux/jump_label.h' line='372' column='1'/>
         </data-member>
       </class-decl>
-      <class-decl name='mount' size-in-bits='2752' is-struct='yes' visibility='default' filepath='include/../fs/mount.h' line='40' column='1' id='237ee462'>
+      <class-decl name='mount' size-in-bits='2752' is-struct='yes' visibility='default' filepath='fs/mount.h' line='40' column='1' id='237ee462'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='mnt_hash' type-id='03a4a074' visibility='default' filepath='include/../fs/mount.h' line='41' column='1'/>
+          <var-decl name='mnt_hash' type-id='03a4a074' visibility='default' filepath='fs/mount.h' line='41' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
-          <var-decl name='mnt_parent' type-id='b749c0b0' visibility='default' filepath='include/../fs/mount.h' line='42' column='1'/>
+          <var-decl name='mnt_parent' type-id='b749c0b0' visibility='default' filepath='fs/mount.h' line='42' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='mnt_mountpoint' type-id='27675065' visibility='default' filepath='include/../fs/mount.h' line='43' column='1'/>
+          <var-decl name='mnt_mountpoint' type-id='27675065' visibility='default' filepath='fs/mount.h' line='43' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
-          <var-decl name='mnt' type-id='19e88833' visibility='default' filepath='include/../fs/mount.h' line='44' column='1'/>
+          <var-decl name='mnt' type-id='19e88833' visibility='default' filepath='fs/mount.h' line='44' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='704'>
-          <var-decl name='' type-id='ac5ab5b6' visibility='default' filepath='include/../fs/mount.h' line='45' column='1'/>
+          <var-decl name='' type-id='ac5ab677' visibility='default' filepath='fs/mount.h' line='45' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='832'>
-          <var-decl name='mnt_pcp' type-id='06f65854' visibility='default' filepath='include/../fs/mount.h' line='50' column='1'/>
+          <var-decl name='mnt_pcp' type-id='06f65854' visibility='default' filepath='fs/mount.h' line='50' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='896'>
-          <var-decl name='mnt_mounts' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='55' column='1'/>
+          <var-decl name='mnt_mounts' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='55' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1024'>
-          <var-decl name='mnt_child' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='56' column='1'/>
+          <var-decl name='mnt_child' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='56' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1152'>
-          <var-decl name='mnt_instance' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='57' column='1'/>
+          <var-decl name='mnt_instance' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='57' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1280'>
-          <var-decl name='mnt_devname' type-id='80f4b756' visibility='default' filepath='include/../fs/mount.h' line='58' column='1'/>
+          <var-decl name='mnt_devname' type-id='80f4b756' visibility='default' filepath='fs/mount.h' line='58' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1344'>
-          <var-decl name='mnt_list' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='59' column='1'/>
+          <var-decl name='mnt_list' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='59' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1472'>
-          <var-decl name='mnt_expire' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='60' column='1'/>
+          <var-decl name='mnt_expire' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='60' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1600'>
-          <var-decl name='mnt_share' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='61' column='1'/>
+          <var-decl name='mnt_share' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='61' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1728'>
-          <var-decl name='mnt_slave_list' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='62' column='1'/>
+          <var-decl name='mnt_slave_list' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='62' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1856'>
-          <var-decl name='mnt_slave' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='63' column='1'/>
+          <var-decl name='mnt_slave' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='63' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1984'>
-          <var-decl name='mnt_master' type-id='b749c0b0' visibility='default' filepath='include/../fs/mount.h' line='64' column='1'/>
+          <var-decl name='mnt_master' type-id='b749c0b0' visibility='default' filepath='fs/mount.h' line='64' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2048'>
-          <var-decl name='mnt_ns' type-id='d60f4f10' visibility='default' filepath='include/../fs/mount.h' line='65' column='1'/>
+          <var-decl name='mnt_ns' type-id='d60f4f10' visibility='default' filepath='fs/mount.h' line='65' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2112'>
-          <var-decl name='mnt_mp' type-id='9dd535f2' visibility='default' filepath='include/../fs/mount.h' line='66' column='1'/>
+          <var-decl name='mnt_mp' type-id='9dd535f2' visibility='default' filepath='fs/mount.h' line='66' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2176'>
-          <var-decl name='' type-id='ac5ab5b7' visibility='default' filepath='include/../fs/mount.h' line='67' column='1'/>
+          <var-decl name='' type-id='ac5ab678' visibility='default' filepath='fs/mount.h' line='67' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2304'>
-          <var-decl name='mnt_umounting' type-id='72f469ec' visibility='default' filepath='include/../fs/mount.h' line='71' column='1'/>
+          <var-decl name='mnt_umounting' type-id='72f469ec' visibility='default' filepath='fs/mount.h' line='71' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2432'>
-          <var-decl name='mnt_fsnotify_marks' type-id='994d9d61' visibility='default' filepath='include/../fs/mount.h' line='73' column='1'/>
+          <var-decl name='mnt_fsnotify_marks' type-id='994d9d61' visibility='default' filepath='fs/mount.h' line='73' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2496'>
-          <var-decl name='mnt_fsnotify_mask' type-id='3f1a6b60' visibility='default' filepath='include/../fs/mount.h' line='74' column='1'/>
+          <var-decl name='mnt_fsnotify_mask' type-id='3f1a6b60' visibility='default' filepath='fs/mount.h' line='74' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2528'>
-          <var-decl name='mnt_id' type-id='95e97e5e' visibility='default' filepath='include/../fs/mount.h' line='76' column='1'/>
+          <var-decl name='mnt_id' type-id='95e97e5e' visibility='default' filepath='fs/mount.h' line='76' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2560'>
-          <var-decl name='mnt_group_id' type-id='95e97e5e' visibility='default' filepath='include/../fs/mount.h' line='77' column='1'/>
+          <var-decl name='mnt_group_id' type-id='95e97e5e' visibility='default' filepath='fs/mount.h' line='77' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2592'>
-          <var-decl name='mnt_expiry_mark' type-id='95e97e5e' visibility='default' filepath='include/../fs/mount.h' line='78' column='1'/>
+          <var-decl name='mnt_expiry_mark' type-id='95e97e5e' visibility='default' filepath='fs/mount.h' line='78' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2624'>
-          <var-decl name='mnt_pins' type-id='e151255a' visibility='default' filepath='include/../fs/mount.h' line='79' column='1'/>
+          <var-decl name='mnt_pins' type-id='e151255a' visibility='default' filepath='fs/mount.h' line='79' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2688'>
-          <var-decl name='mnt_stuck_children' type-id='e151255a' visibility='default' filepath='include/../fs/mount.h' line='80' column='1'/>
+          <var-decl name='mnt_stuck_children' type-id='e151255a' visibility='default' filepath='fs/mount.h' line='80' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='e9bea70c' size-in-bits='64' id='23a0ad0a'/>
@@ -17847,7 +18138,7 @@
           <var-decl name='fl_lmops' type-id='a548fbc8' visibility='default' filepath='include/linux/fs.h' line='1118' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1472'>
-          <var-decl name='fl_u' type-id='ac5ab606' visibility='default' filepath='include/linux/fs.h' line='1127' column='1'/>
+          <var-decl name='fl_u' type-id='ac5ab5c3' visibility='default' filepath='include/linux/fs.h' line='1127' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1728'>
           <var-decl name='android_reserved1' type-id='72f469ec' visibility='default' filepath='include/linux/fs.h' line='1129' column='1'/>
@@ -17958,7 +18249,7 @@
       </function-type>
       <class-decl name='fid' size-in-bits='160' is-struct='yes' visibility='default' filepath='include/linux/exportfs.h' line='118' column='1' id='2437c5c4'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab666' visibility='default' filepath='include/linux/exportfs.h' line='119' column='1'/>
+          <var-decl name='' type-id='ac5ab6ca' visibility='default' filepath='include/linux/exportfs.h' line='119' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='5895f71c' size-in-bits='64' id='243d1e96'/>
@@ -18257,6 +18548,7 @@
       </class-decl>
       <pointer-type-def type-id='5ad3f0d0' size-in-bits='64' id='249ef586'/>
       <qualified-type-def type-id='4d1a8c39' const='yes' id='24a174c6'/>
+      <pointer-type-def type-id='c044588f' size-in-bits='64' id='24a2e98b'/>
       <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='128' id='24a375b2'>
         <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
       </array-type-def>
@@ -18327,7 +18619,7 @@
           <var-decl name='is_ndp16' type-id='f9b06939' visibility='default' filepath='include/linux/usb/cdc_ncm.h' line='119' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1920'>
-          <var-decl name='' type-id='ac5ab5f1' visibility='default' filepath='include/linux/usb/cdc_ncm.h' line='120' column='1'/>
+          <var-decl name='' type-id='ac5ab62a' visibility='default' filepath='include/linux/usb/cdc_ncm.h' line='120' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1984'>
           <var-decl name='tx_timer_pending' type-id='19c2251e' visibility='default' filepath='include/linux/usb/cdc_ncm.h' line='125' column='1'/>
@@ -18402,10 +18694,15 @@
           <var-decl name='rx_ntbs' type-id='91ce1af9' visibility='default' filepath='include/linux/usb/cdc_ncm.h' line='150' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='24ae0207'>
+        <parameter type-id='bdcee7ae'/>
+        <return type-id='48b5725f'/>
+      </function-type>
       <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='128' id='24ae0315'>
         <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
       </array-type-def>
       <pointer-type-def type-id='91088608' size-in-bits='64' id='24b0cc5e'/>
+      <pointer-type-def type-id='909962af' size-in-bits='64' id='24b51593'/>
       <function-type size-in-bits='64' id='24bb49a8'>
         <parameter type-id='f23e2572'/>
         <parameter type-id='5f8a1ac4'/>
@@ -18455,6 +18752,7 @@
         <parameter type-id='ecb0ce18'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <pointer-type-def type-id='17483488' size-in-bits='64' id='24e78d82'/>
       <function-type size-in-bits='64' id='24f3731d'>
         <parameter type-id='fa0b179b'/>
         <parameter type-id='29d28711'/>
@@ -18465,6 +18763,9 @@
         <parameter type-id='75ae4804'/>
         <return type-id='48b5725f'/>
       </function-type>
+      <array-type-def dimensions='1' type-id='e3a91a7c' size-in-bits='infinite' id='250ecbd0'>
+        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
+      </array-type-def>
       <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='192' id='25108e54'>
         <subrange length='24' type-id='7ff19f0f' id='fdd3342b'/>
       </array-type-def>
@@ -18903,10 +19204,6 @@
           <var-decl name='hue' type-id='f0981eeb' visibility='default' filepath='include/drm/drm_connector.h' line='599' column='1'/>
         </data-member>
       </class-decl>
-      <function-type size-in-bits='64' id='25baaf57'>
-        <parameter type-id='414ea452'/>
-        <return type-id='48b5725f'/>
-      </function-type>
       <qualified-type-def type-id='f02c18fa' const='yes' id='25bc1b8d'/>
       <function-type size-in-bits='64' id='25c33493'>
         <parameter type-id='8bf48c31'/>
@@ -18937,6 +19234,32 @@
         <parameter type-id='7d5a17ad'/>
         <return type-id='453a795e'/>
       </function-type>
+      <class-decl name='btf_header' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/uapi/linux/btf.h' line='11' column='1' id='25d4b2dd'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='magic' type-id='d315442e' visibility='default' filepath='include/uapi/linux/btf.h' line='12' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='16'>
+          <var-decl name='version' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/btf.h' line='13' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='24'>
+          <var-decl name='flags' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/btf.h' line='14' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='hdr_len' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/btf.h' line='15' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='type_off' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/btf.h' line='18' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='96'>
+          <var-decl name='type_len' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/btf.h' line='19' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='str_off' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/btf.h' line='20' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='160'>
+          <var-decl name='str_len' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/btf.h' line='21' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='mtd_info' size-in-bits='11520' is-struct='yes' visibility='default' filepath='include/linux/mtd/mtd.h' line='235' column='1' id='25dc4075'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='type' type-id='b151a3a8' visibility='default' filepath='include/linux/mtd/mtd.h' line='236' column='1'/>
@@ -19122,7 +19445,7 @@
           <var-decl name='partitions' type-id='72f469ec' visibility='default' filepath='include/linux/mtd/mtd.h' line='389' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='11072'>
-          <var-decl name='' type-id='ac5ab5bb' visibility='default' filepath='include/linux/mtd/mtd.h' line='391' column='1'/>
+          <var-decl name='' type-id='ac5ab5f1' visibility='default' filepath='include/linux/mtd/mtd.h' line='391' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='pinctrl_desc' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/linux/pinctrl/pinctrl.h' line='130' column='1' id='25e1863f'>
@@ -19204,6 +19527,12 @@
         <parameter type-id='98d7a132'/>
         <return type-id='02ac9d9d'/>
       </function-type>
+      <function-type size-in-bits='64' id='261fcb9e'>
+        <parameter type-id='b3c6c7b8'/>
+        <parameter type-id='19c2251e'/>
+        <parameter type-id='19c2251e'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <typedef-decl name='filldir_t' type-id='78efe913' filepath='include/linux/fs.h' line='1812' column='1' id='262124ef'/>
       <class-decl name='snd_soc_tplg_vendor_value_elem' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/uapi/sound/asoc.h' line='207' column='1' id='26236645'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -19390,7 +19719,7 @@
         <return type-id='48b5725f'/>
       </function-type>
       <pointer-type-def type-id='ecabee4c' size-in-bits='64' id='268afde6'/>
-      <qualified-type-def type-id='61227238' const='yes' id='268fa5d8'/>
+      <qualified-type-def type-id='61227239' const='yes' id='268fa5d9'/>
       <pointer-type-def type-id='066f541d' size-in-bits='64' id='26989ff9'/>
       <pointer-type-def type-id='a547d92e' size-in-bits='64' id='2699ed14'/>
       <qualified-type-def type-id='16e7829f' const='yes' id='269d8092'/>
@@ -19434,6 +19763,12 @@
           <var-decl name='mask' type-id='1dc6a898' visibility='default' filepath='arch/arm64/include/asm/debug-monitors.h' line='92' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='26bba2ad'>
+        <parameter type-id='0dc3586b'/>
+        <parameter type-id='f0981eeb'/>
+        <parameter type-id='02f03310'/>
+        <return type-id='48b5725f'/>
+      </function-type>
       <pointer-type-def type-id='33c534fd' size-in-bits='64' id='26bfaed1'/>
       <pointer-type-def type-id='f1fbc58e' size-in-bits='64' id='26cad514'/>
       <pointer-type-def type-id='26b98d12' size-in-bits='64' id='26d099e0'/>
@@ -19569,6 +19904,14 @@
       <qualified-type-def type-id='0e5b8ca7' const='yes' id='27365fde'/>
       <pointer-type-def type-id='ddd7cbfe' size-in-bits='64' id='273a7d34'/>
       <typedef-decl name='mempool_t' type-id='5932767e' filepath='include/linux/mempool.h' line='26' column='1' id='2745fad8'/>
+      <function-type size-in-bits='64' id='274c23aa'>
+        <parameter type-id='944c4ff9'/>
+        <parameter type-id='f0981eeb'/>
+        <parameter type-id='d61bf978'/>
+        <parameter type-id='f9b37274'/>
+        <parameter type-id='b50a4934'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='9a46627e' size-in-bits='64' id='2753ede4'/>
       <function-type size-in-bits='64' id='276427e1'>
         <return type-id='95e97e5e'/>
@@ -19718,7 +20061,7 @@
       <pointer-type-def type-id='6e44244d' size-in-bits='64' id='27b80621'/>
       <class-decl name='ieee80211_key_seq' size-in-bits='160' is-struct='yes' visibility='default' filepath='include/net/mac80211.h' line='1891' column='1' id='27ba2d9f'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab672' visibility='default' filepath='include/net/mac80211.h' line='1892' column='1'/>
+          <var-decl name='' type-id='ac5ab6df' visibility='default' filepath='include/net/mac80211.h' line='1892' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='f111d4f3' size-in-bits='64' id='27bb8677'/>
@@ -19870,6 +20213,12 @@
       <pointer-type-def type-id='d8579536' size-in-bits='64' id='28375890'/>
       <pointer-type-def type-id='82a21fa9' size-in-bits='64' id='28379b39'/>
       <qualified-type-def type-id='822bf95b' const='yes' id='283e536e'/>
+      <enum-decl name='uprobe_filter_ctx' filepath='include/linux/uprobes.h' line='30' column='1' id='2840efdc'>
+        <underlying-type type-id='9cac1fee'/>
+        <enumerator name='UPROBE_FILTER_REGISTER' value='0'/>
+        <enumerator name='UPROBE_FILTER_UNREGISTER' value='1'/>
+        <enumerator name='UPROBE_FILTER_MMAP' value='2'/>
+      </enum-decl>
       <class-decl name='fib_rule_hdr' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/uapi/linux/fib_rules.h' line='19' column='1' id='284260b8'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='family' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fib_rules.h' line='20' column='1'/>
@@ -19904,6 +20253,17 @@
         <parameter type-id='08496218'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <class-decl name='nf_conntrack_expect_policy' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/net/netfilter/nf_conntrack_expect.h' line='70' column='1' id='28525fe0'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='max_expected' type-id='f0981eeb' visibility='default' filepath='include/net/netfilter/nf_conntrack_expect.h' line='71' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='timeout' type-id='f0981eeb' visibility='default' filepath='include/net/netfilter/nf_conntrack_expect.h' line='72' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='name' type-id='ac1fa8c0' visibility='default' filepath='include/net/netfilter/nf_conntrack_expect.h' line='73' column='1'/>
+        </data-member>
+      </class-decl>
       <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
       <pointer-type-def type-id='334e564a' size-in-bits='64' id='28588d1c'/>
       <pointer-type-def type-id='2f07c2f4' size-in-bits='64' id='2859cc56'/>
@@ -20049,6 +20409,7 @@
       </class-decl>
       <pointer-type-def type-id='78536370' size-in-bits='64' id='2908e93a'/>
       <pointer-type-def type-id='9ff1d50f' size-in-bits='64' id='290bf697'/>
+      <pointer-type-def type-id='a23d03e9' size-in-bits='64' id='290cebf9'/>
       <function-type size-in-bits='64' id='2914f7c3'>
         <parameter type-id='572fbdca'/>
         <parameter type-id='77e79a4b'/>
@@ -20698,10 +21059,10 @@
       <pointer-type-def type-id='ddf16879' size-in-bits='64' id='29af9a71'/>
       <class-decl name='audit_proctitle' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/../kernel/audit.h' line='92' column='1' id='29b11ca5'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='include/../kernel/audit.h' line='93' column='1'/>
+          <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='kernel/audit.h' line='93' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='value' type-id='26a90f95' visibility='default' filepath='include/../kernel/audit.h' line='94' column='1'/>
+          <var-decl name='value' type-id='26a90f95' visibility='default' filepath='kernel/audit.h' line='94' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='b44140ca' size-in-bits='64' id='29bf40b4'/>
@@ -20724,8 +21085,8 @@
         <subrange length='255' type-id='7ff19f0f' id='36e7f891'/>
       </array-type-def>
       <function-type size-in-bits='64' id='29ce7f43'>
-        <parameter type-id='f23e2572'/>
-        <parameter type-id='95e97e5e'/>
+        <parameter type-id='f23e2572' name='task'/>
+        <parameter type-id='95e97e5e' name='cpu'/>
         <return type-id='b50a4934'/>
       </function-type>
       <function-type size-in-bits='64' id='29cf1864'>
@@ -20778,7 +21139,7 @@
           <var-decl name='hash' type-id='f0981eeb' visibility='default' filepath='include/linux/kernfs.h' line='142' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='512'>
-          <var-decl name='' type-id='ac5ab60a' visibility='default' filepath='include/linux/kernfs.h' line='143' column='1'/>
+          <var-decl name='' type-id='ac5ab5c9' visibility='default' filepath='include/linux/kernfs.h' line='143' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='768'>
           <var-decl name='priv' type-id='eaa32e2f' visibility='default' filepath='include/linux/kernfs.h' line='149' column='1'/>
@@ -20911,6 +21272,7 @@
       <pointer-type-def type-id='38d1cb6d' size-in-bits='64' id='2a5d0ea1'/>
       <pointer-type-def type-id='1207cfa9' size-in-bits='64' id='2a5ff2f1'/>
       <pointer-type-def type-id='ecbba9ca' size-in-bits='64' id='2a614134'/>
+      <pointer-type-def type-id='6028f6e0' size-in-bits='64' id='2a7c7ffe'/>
       <class-decl name='netns_ct' size-in-bits='3328' is-struct='yes' visibility='default' filepath='include/net/netns/conntrack.h' line='95' column='1' id='2a831eeb'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='count' type-id='49178f86' visibility='default' filepath='include/net/netns/conntrack.h' line='96' column='1'/>
@@ -21169,7 +21531,7 @@
           <var-decl name='ip' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='1005' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='576'>
-          <var-decl name='tid_entry' type-id='e7f43f7c' visibility='default' filepath='include/linux/perf_event.h' line='1009' column='1'/>
+          <var-decl name='tid_entry' type-id='e7f43fa6' visibility='default' filepath='include/linux/perf_event.h' line='1009' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='640'>
           <var-decl name='time' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='1010' column='1'/>
@@ -21181,7 +21543,7 @@
           <var-decl name='stream_id' type-id='91ce1af9' visibility='default' filepath='include/linux/perf_event.h' line='1012' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='832'>
-          <var-decl name='cpu_entry' type-id='e7f43f7d' visibility='default' filepath='include/linux/perf_event.h' line='1016' column='1'/>
+          <var-decl name='cpu_entry' type-id='e7f43fa7' visibility='default' filepath='include/linux/perf_event.h' line='1016' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='896'>
           <var-decl name='callchain' type-id='cd3a82e3' visibility='default' filepath='include/linux/perf_event.h' line='1017' column='1'/>
@@ -21412,7 +21774,7 @@
           <var-decl name='val' type-id='d3130597' visibility='default' filepath='include/uapi/linux/perf_event.h' line='1121' column='1'/>
         </data-member>
         <data-member access='public'>
-          <var-decl name='' type-id='e7f43f7f' visibility='default' filepath='include/uapi/linux/perf_event.h' line='1122' column='1'/>
+          <var-decl name='' type-id='e7f43fd2' visibility='default' filepath='include/uapi/linux/perf_event.h' line='1122' column='1'/>
         </data-member>
       </union-decl>
       <class-decl name='regmap_access_table' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/regmap.h' line='220' column='1' id='2bed066b'>
@@ -21546,6 +21908,7 @@
         <parameter type-id='f7cfb49a'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <pointer-type-def type-id='542a1c2c' size-in-bits='64' id='2c88d3fa'/>
       <pointer-type-def type-id='97488913' size-in-bits='64' id='2c8ff697'/>
       <pointer-type-def type-id='3a97b64f' size-in-bits='64' id='2c927837'/>
       <class-decl name='nf_exp_event' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/net/netfilter/nf_conntrack_ecache.h' line='155' column='1' id='2c98045e'>
@@ -21590,6 +21953,36 @@
         <parameter type-id='e55856e5'/>
         <return type-id='48b5725f'/>
       </function-type>
+      <enum-decl name='bpf_arg_type' filepath='include/linux/bpf.h' line='264' column='1' id='2cf9a7a4'>
+        <underlying-type type-id='9cac1fee'/>
+        <enumerator name='ARG_DONTCARE' value='0'/>
+        <enumerator name='ARG_CONST_MAP_PTR' value='1'/>
+        <enumerator name='ARG_PTR_TO_MAP_KEY' value='2'/>
+        <enumerator name='ARG_PTR_TO_MAP_VALUE' value='3'/>
+        <enumerator name='ARG_PTR_TO_UNINIT_MAP_VALUE' value='4'/>
+        <enumerator name='ARG_PTR_TO_MAP_VALUE_OR_NULL' value='5'/>
+        <enumerator name='ARG_PTR_TO_MEM' value='6'/>
+        <enumerator name='ARG_PTR_TO_MEM_OR_NULL' value='7'/>
+        <enumerator name='ARG_PTR_TO_UNINIT_MEM' value='8'/>
+        <enumerator name='ARG_CONST_SIZE' value='9'/>
+        <enumerator name='ARG_CONST_SIZE_OR_ZERO' value='10'/>
+        <enumerator name='ARG_PTR_TO_CTX' value='11'/>
+        <enumerator name='ARG_PTR_TO_CTX_OR_NULL' value='12'/>
+        <enumerator name='ARG_ANYTHING' value='13'/>
+        <enumerator name='ARG_PTR_TO_SPIN_LOCK' value='14'/>
+        <enumerator name='ARG_PTR_TO_SOCK_COMMON' value='15'/>
+        <enumerator name='ARG_PTR_TO_INT' value='16'/>
+        <enumerator name='ARG_PTR_TO_LONG' value='17'/>
+        <enumerator name='ARG_PTR_TO_SOCKET' value='18'/>
+        <enumerator name='ARG_PTR_TO_SOCKET_OR_NULL' value='19'/>
+        <enumerator name='ARG_PTR_TO_BTF_ID' value='20'/>
+        <enumerator name='ARG_PTR_TO_ALLOC_MEM' value='21'/>
+        <enumerator name='ARG_PTR_TO_ALLOC_MEM_OR_NULL' value='22'/>
+        <enumerator name='ARG_CONST_ALLOC_SIZE_OR_ZERO' value='23'/>
+        <enumerator name='ARG_PTR_TO_BTF_ID_SOCK_COMMON' value='24'/>
+        <enumerator name='ARG_PTR_TO_PERCPU_BTF_ID' value='25'/>
+        <enumerator name='__BPF_ARG_TYPE_MAX' value='26'/>
+      </enum-decl>
       <function-type size-in-bits='64' id='2cfafd1c'>
         <parameter type-id='cfff5953'/>
         <parameter type-id='03054cfa'/>
@@ -21867,7 +22260,7 @@
           <var-decl name='flags' type-id='f9b06939' visibility='default' filepath='include/drm/drm_edid.h' line='105' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='48'>
-          <var-decl name='formula' type-id='ac5ab5c8' visibility='default' filepath='include/drm/drm_edid.h' line='124' column='1'/>
+          <var-decl name='formula' type-id='ac5ab60d' visibility='default' filepath='include/drm/drm_edid.h' line='124' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='154f1323' size-in-bits='64' id='2d642297'/>
@@ -21988,7 +22381,7 @@
       <array-type-def dimensions='1' type-id='8af57d41' size-in-bits='128' id='2d85a215'>
         <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
       </array-type-def>
-      <class-decl name='task_group' size-in-bits='3584' is-struct='yes' visibility='default' filepath='kernel/sched/sched.h' line='389' column='1' id='2d863538'>
+      <class-decl name='task_group' size-in-bits='3584' is-struct='yes' visibility='default' filepath='fs/../kernel/sched/sched.h' line='389' column='1' id='2d863538'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='css' type-id='7f3df443' visibility='default' filepath='kernel/sched/sched.h' line='390' column='1'/>
         </data-member>
@@ -22057,6 +22450,10 @@
       </class-decl>
       <pointer-type-def type-id='53ecac3a' size-in-bits='64' id='2d92dd30'/>
       <pointer-type-def type-id='b68346f7' size-in-bits='64' id='2da88de7'/>
+      <function-type size-in-bits='64' id='2db7308e'>
+        <parameter type-id='bdcee7ae'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='a27aef61' size-in-bits='64' id='2db792b9'/>
       <pointer-type-def type-id='81954c90' size-in-bits='64' id='2dbbe856'/>
       <pointer-type-def type-id='7fb3a80c' size-in-bits='64' id='2dd1b3d2'/>
@@ -22483,10 +22880,6 @@
         <parameter type-id='19c2251e'/>
         <return type-id='95e97e5e'/>
       </function-type>
-      <function-type size-in-bits='64' id='2eda4fae'>
-        <parameter type-id='414ea452'/>
-        <return type-id='95e97e5e'/>
-      </function-type>
       <pointer-type-def type-id='ee780377' size-in-bits='64' id='2edb3e4b'/>
       <class-decl name='ieee80211_vht_cap' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/linux/ieee80211.h' line='1731' column='1' id='2eec6999'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -22496,6 +22889,7 @@
           <var-decl name='supp_mcs' type-id='830056b5' visibility='default' filepath='include/linux/ieee80211.h' line='1733' column='1'/>
         </data-member>
       </class-decl>
+      <class-decl name='audit_chunk' is-struct='yes' visibility='default' is-declaration-only='yes' id='2eefac7a'/>
       <qualified-type-def type-id='8f68aa3b' const='yes' id='2ef05706'/>
       <pointer-type-def type-id='d6de54c5' size-in-bits='64' id='2effb43d'/>
       <pointer-type-def type-id='c67e920d' size-in-bits='64' id='2f00283d'/>
@@ -22557,7 +22951,7 @@
       </class-decl>
       <class-decl name='tty_buffer' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/tty.h' line='59' column='1' id='2f351d1f'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab63d' visibility='default' filepath='include/linux/tty.h' line='60' column='1'/>
+          <var-decl name='' type-id='ac5ab640' visibility='default' filepath='include/linux/tty.h' line='60' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
           <var-decl name='used' type-id='95e97e5e' visibility='default' filepath='include/linux/tty.h' line='64' column='1'/>
@@ -22648,7 +23042,7 @@
           <var-decl name='free' type-id='595e6a79' visibility='default' filepath='include/crypto/internal/skcipher.h' line='21' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1024'>
-          <var-decl name='' type-id='ac5ab5b2' visibility='default' filepath='include/crypto/internal/skcipher.h' line='22' column='1'/>
+          <var-decl name='' type-id='ac5ab606' visibility='default' filepath='include/crypto/internal/skcipher.h' line='22' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='3b43e527' size-in-bits='64' id='2f739ebb'/>
@@ -22706,7 +23100,7 @@
           <var-decl name='type' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2318' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='32'>
-          <var-decl name='parm' type-id='ac5ab5ed' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2323' column='1'/>
+          <var-decl name='parm' type-id='ac5ab663' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2323' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='9d07f7d6' size-in-bits='64' id='2f8b61b4'/>
@@ -22724,11 +23118,6 @@
       <pointer-type-def type-id='96c5d5bd' size-in-bits='64' id='2fc899e9'/>
       <pointer-type-def type-id='88565f1f' size-in-bits='64' id='2fcb9b17'/>
       <pointer-type-def type-id='c012d70e' size-in-bits='64' id='2fd02888'/>
-      <function-type size-in-bits='64' id='2fdc535f'>
-        <parameter type-id='1fc888a9'/>
-        <parameter type-id='176d60a1'/>
-        <return type-id='95e97e5e'/>
-      </function-type>
       <pointer-type-def type-id='06f84b1d' size-in-bits='64' id='2fde6795'/>
       <class-decl name='workqueue_attrs' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/workqueue.h' line='143' column='1' id='2fe6f208'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -22753,6 +23142,14 @@
           <var-decl name='counter' type-id='9b7c55ef' visibility='default' filepath='include/linux/types.h' line='174' column='1'/>
         </data-member>
       </class-decl>
+      <class-decl name='phylink_pcs' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/phylink.h' line='338' column='1' id='2ff052b1'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='ops' type-id='a6424831' visibility='default' filepath='include/linux/phylink.h' line='339' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='poll' type-id='b50a4934' visibility='default' filepath='include/linux/phylink.h' line='340' column='1'/>
+        </data-member>
+      </class-decl>
       <enum-decl name='ieee80211_rssi_event_data' filepath='include/net/mac80211.h' line='391' column='1' id='2ff52c3e'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='RSSI_EVENT_HIGH' value='0'/>
@@ -22849,6 +23246,9 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='6fcaf91e' size-in-bits='64' id='30864cdc'/>
+      <array-type-def dimensions='1' type-id='f9409001' size-in-bits='320' id='3086b1d4'>
+        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
+      </array-type-def>
       <pointer-type-def type-id='f52a1ce8' size-in-bits='64' id='30897c4e'/>
       <function-type size-in-bits='64' id='30913582'>
         <parameter type-id='3aaeef89'/>
@@ -23036,7 +23436,7 @@
           <var-decl name='irq_mask' type-id='185ccd91' visibility='default' filepath='include/linux/gpio/driver.h' line='269' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2304'>
-          <var-decl name='' type-id='ac5ab5f4' visibility='default' filepath='include/linux/gpio/driver.h' line='278' column='1'/>
+          <var-decl name='' type-id='ac5ab63a' visibility='default' filepath='include/linux/gpio/driver.h' line='278' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2368'>
           <var-decl name='android_kabi_reserved2' type-id='91ce1af9' visibility='default' filepath='include/linux/gpio/driver.h' line='279' column='1'/>
@@ -23044,10 +23444,10 @@
       </class-decl>
       <class-decl name='mnt_pcp' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/../fs/mount.h' line='28' column='1' id='3106563e'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='mnt_count' type-id='95e97e5e' visibility='default' filepath='include/../fs/mount.h' line='29' column='1'/>
+          <var-decl name='mnt_count' type-id='95e97e5e' visibility='default' filepath='fs/mount.h' line='29' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='32'>
-          <var-decl name='mnt_writers' type-id='95e97e5e' visibility='default' filepath='include/../fs/mount.h' line='30' column='1'/>
+          <var-decl name='mnt_writers' type-id='95e97e5e' visibility='default' filepath='fs/mount.h' line='30' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='f12ac4ae' size-in-bits='64' id='31094274'/>
@@ -23056,7 +23456,7 @@
       </array-type-def>
       <class-decl name='mm_struct' size-in-bits='7936' is-struct='yes' visibility='default' filepath='include/linux/mm_types.h' line='423' column='1' id='311626f1'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='e7f43fde' visibility='default' filepath='include/linux/mm_types.h' line='424' column='1'/>
+          <var-decl name='' type-id='e7f43f9c' visibility='default' filepath='include/linux/mm_types.h' line='424' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='7936'>
           <var-decl name='cpu_bitmap' type-id='c99b5ecd' visibility='default' filepath='include/linux/mm_types.h' line='644' column='1'/>
@@ -23133,6 +23533,7 @@
         </data-member>
       </class-decl>
       <typedef-decl name='__s32' type-id='95e97e5e' filepath='include/uapi/asm-generic/int-ll64.h' line='26' column='1' id='3158a266'/>
+      <pointer-type-def type-id='86eaa2e4' size-in-bits='64' id='315e4a4a'/>
       <pointer-type-def type-id='6ae7a739' size-in-bits='64' id='3168497d'/>
       <class-decl name='key_tag' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/key.h' line='102' column='1' id='3173bc57'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -23171,7 +23572,7 @@
       <qualified-type-def type-id='ad974450' const='yes' id='319b3a77'/>
       <class-decl name='qrwlock' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/asm-generic/qrwlock_types.h' line='13' column='1' id='319e0e18'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab601' visibility='default' filepath='include/asm-generic/qrwlock_types.h' line='14' column='1'/>
+          <var-decl name='' type-id='ac5ab5b4' visibility='default' filepath='include/asm-generic/qrwlock_types.h' line='14' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='32'>
           <var-decl name='wait_lock' type-id='641c41d1' visibility='default' filepath='include/asm-generic/qrwlock_types.h' line='26' column='1'/>
@@ -23241,6 +23642,7 @@
       </function-type>
       <pointer-type-def type-id='e0d0028a' size-in-bits='64' id='31cc9254'/>
       <qualified-type-def type-id='b151a3a8' const='yes' id='31d2e798'/>
+      <pointer-type-def type-id='9363a506' size-in-bits='64' id='31dd0444'/>
       <pointer-type-def type-id='c69a48a7' size-in-bits='64' id='31e035f7'/>
       <class-decl name='usb_cdc_mdlm_detail_desc' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/uapi/linux/usb/cdc.h' line='167' column='1' id='31e0f35d'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -23658,7 +24060,6 @@
           <var-decl name='thrashing_count' type-id='19c2251e' visibility='default' filepath='include/linux/delayacct.h' line='55' column='1'/>
         </data-member>
       </class-decl>
-      <pointer-type-def type-id='2eda4fae' size-in-bits='64' id='32271368'/>
       <function-type size-in-bits='64' id='322dfcc1'>
         <parameter type-id='8106240b'/>
         <parameter type-id='d1499e71'/>
@@ -23770,7 +24171,7 @@
           <var-decl name='type' type-id='c47ba023' visibility='default' filepath='include/linux/pm_qos.h' line='109' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='data' type-id='ac5ab59c' visibility='default' filepath='include/linux/pm_qos.h' line='114' column='1'/>
+          <var-decl name='data' type-id='ac5ab63f' visibility='default' filepath='include/linux/pm_qos.h' line='114' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='640'>
           <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/pm_qos.h' line='115' column='1'/>
@@ -24006,7 +24407,7 @@
       </function-type>
       <class-decl name='media_graph' size-in-bits='2240' is-struct='yes' visibility='default' filepath='include/media/media-entity.h' line='89' column='1' id='32ec86e0'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='stack' type-id='4cb10997' visibility='default' filepath='include/media/media-entity.h' line='93' column='1'/>
+          <var-decl name='stack' type-id='4cb10998' visibility='default' filepath='include/media/media-entity.h' line='93' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2048'>
           <var-decl name='ent_enum' type-id='4cd55af5' visibility='default' filepath='include/media/media-entity.h' line='95' column='1'/>
@@ -24135,7 +24536,7 @@
       </class-decl>
       <pointer-type-def type-id='55bdfa3e' size-in-bits='64' id='32efad44'/>
       <function-type size-in-bits='64' id='32efe300'>
-        <parameter type-id='f0981eeb'/>
+        <parameter type-id='f0981eeb' name='cpu'/>
         <return type-id='f0981eeb'/>
       </function-type>
       <function-type size-in-bits='64' id='32f8fd62'>
@@ -24310,7 +24711,7 @@
       </function-type>
       <pointer-type-def type-id='0f8b1896' size-in-bits='64' id='33f7eff4'/>
       <pointer-type-def type-id='8504f260' size-in-bits='64' id='33f86a47'/>
-      <enum-decl name='audit_state' filepath='include/../kernel/audit.h' line='23' column='1' id='33fc9455'>
+      <enum-decl name='audit_state' filepath='kernel/audit.h' line='23' column='1' id='33fc9455'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='AUDIT_DISABLED' value='0'/>
         <enumerator name='AUDIT_BUILD_CONTEXT' value='1'/>
@@ -24519,6 +24920,7 @@
           <var-decl name='irq_drv_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/regmap.h' line='1431' column='1'/>
         </data-member>
       </class-decl>
+      <typedef-decl name='probes_handler_t' type-id='ae26a81a' filepath='arch/arm64/include/asm/probes.h' line='13' column='1' id='34a2420f'/>
       <pointer-type-def type-id='ee6561a9' size-in-bits='64' id='34aa5735'/>
       <class-decl name='usb3_lpm_parameters' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/usb.h' line='538' column='1' id='34bd0a0b'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -24611,6 +25013,11 @@
           <var-decl name='free_cb' type-id='16575f26' visibility='default' filepath='include/drm/drm_mode_object.h' line='60' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='3512001c'>
+        <parameter type-id='944c4ff9'/>
+        <parameter type-id='6fd5b1ab'/>
+        <return type-id='48b5725f'/>
+      </function-type>
       <class-decl name='seqcount_raw_spinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/seqlock.h' line='276' column='1' id='35126ca4'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='seqcount' type-id='e14c3b11' visibility='default' filepath='include/linux/seqlock.h' line='276' column='1'/>
@@ -24686,6 +25093,29 @@
       <pointer-type-def type-id='835b9b57' size-in-bits='64' id='3591079f'/>
       <qualified-type-def type-id='b07b6d69' const='yes' id='359a7eea'/>
       <pointer-type-def type-id='64615833' size-in-bits='64' id='35a0b4f8'/>
+      <class-decl name='bpf_verifier_ops' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/bpf.h' line='444' column='1' id='35a61681'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='get_func_proto' type-id='db618ccd' visibility='default' filepath='include/linux/bpf.h' line='447' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='is_valid_access' type-id='88056adb' visibility='default' filepath='include/linux/bpf.h' line='453' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='gen_prologue' type-id='0dde8c45' visibility='default' filepath='include/linux/bpf.h' line='456' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='gen_ld_abs' type-id='1b33fc1a' visibility='default' filepath='include/linux/bpf.h' line='458' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='convert_ctx_access' type-id='bfd08e9e' visibility='default' filepath='include/linux/bpf.h' line='460' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='btf_struct_access' type-id='880823b8' visibility='default' filepath='include/linux/bpf.h' line='464' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/bpf.h' line='468' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='cf9a081c' size-in-bits='64' id='35aeb76e'/>
       <pointer-type-def type-id='49a7c5a7' size-in-bits='64' id='35b28c4f'/>
       <function-type size-in-bits='64' id='35b31004'>
@@ -24722,7 +25152,35 @@
       </array-type-def>
       <pointer-type-def type-id='984972f4' size-in-bits='64' id='35e7a722'/>
       <pointer-type-def type-id='647d371e' size-in-bits='64' id='35e8c658'/>
-      <class-decl name='tipc_discoverer' is-struct='yes' visibility='default' is-declaration-only='yes' id='35ec5fa0'/>
+      <class-decl name='tipc_discoverer' size-in-bits='1088' is-struct='yes' visibility='default' filepath='net/tipc/discover.c' line='62' column='1' id='35ec5fa0'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='bearer_id' type-id='19c2251e' visibility='default' filepath='net/tipc/discover.c' line='63' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='dest' type-id='9b941952' visibility='default' filepath='net/tipc/discover.c' line='64' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='net' type-id='a2bff676' visibility='default' filepath='net/tipc/discover.c' line='65' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='domain' type-id='19c2251e' visibility='default' filepath='net/tipc/discover.c' line='66' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='416'>
+          <var-decl name='num_nodes' type-id='95e97e5e' visibility='default' filepath='net/tipc/discover.c' line='67' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='net/tipc/discover.c' line='68' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='skb' type-id='0fbf3cfd' visibility='default' filepath='net/tipc/discover.c' line='69' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='timer' type-id='abe41e67' visibility='default' filepath='net/tipc/discover.c' line='70' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1024'>
+          <var-decl name='timer_intv' type-id='7359adad' visibility='default' filepath='net/tipc/discover.c' line='71' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='2914f7c3' size-in-bits='64' id='35f07b8f'/>
       <pointer-type-def type-id='4020579d' size-in-bits='64' id='35f4156d'/>
       <class-decl name='scmi_driver' size-in-bits='1664' is-struct='yes' visibility='default' filepath='include/linux/scmi_protocol.h' line='687' column='1' id='35ff1d34'>
@@ -25048,6 +25506,7 @@
       <pointer-type-def type-id='39d64410' size-in-bits='64' id='36ed3b9a'/>
       <pointer-type-def type-id='6ad7a215' size-in-bits='64' id='36f91979'/>
       <pointer-type-def type-id='c4a7b189' size-in-bits='64' id='36fca399'/>
+      <pointer-type-def type-id='f1bc64d3' size-in-bits='64' id='37058a7f'/>
       <enum-decl name='snd_soc_dpcm_update' filepath='include/sound/soc-dpcm.h' line='21' column='1' id='3708cdec'>
         <underlying-type type-id='9cac1fee'/>
         <enumerator name='SND_SOC_DPCM_UPDATE_NO' value='0'/>
@@ -25083,7 +25542,7 @@
           <var-decl name='size' type-id='2f162548' visibility='default' filepath='include/uapi/sound/asoc.h' line='235' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='32'>
-          <var-decl name='' type-id='ac5ab683' visibility='default' filepath='include/uapi/sound/asoc.h' line='236' column='1'/>
+          <var-decl name='' type-id='ac5ab709' visibility='default' filepath='include/uapi/sound/asoc.h' line='236' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='usb_config_descriptor' size-in-bits='72' is-struct='yes' visibility='default' filepath='include/uapi/linux/usb/ch9.h' line='349' column='1' id='372ebfa4'>
@@ -25119,6 +25578,7 @@
         <parameter type-id='4ab96a04'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <qualified-type-def type-id='08d82a05' const='yes' id='3744a45a'/>
       <pointer-type-def type-id='a8c69bdf' size-in-bits='64' id='374692c7'/>
       <pointer-type-def type-id='d98a9fd9' size-in-bits='64' id='37497cfd'/>
       <function-type size-in-bits='64' id='374a88a9'>
@@ -25579,7 +26039,7 @@
       <pointer-type-def type-id='175944cd' size-in-bits='64' id='38ed603d'/>
       <class-decl name='kernel_siginfo' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/signal_types.h' line='12' column='1' id='38ef7882'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='e7f43ff3' visibility='default' filepath='include/linux/signal_types.h' line='13' column='1'/>
+          <var-decl name='' type-id='e7f43f74' visibility='default' filepath='include/linux/signal_types.h' line='13' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='be0d5cf5' size-in-bits='64' id='38fe9344'/>
@@ -25780,6 +26240,26 @@
       </class-decl>
       <pointer-type-def type-id='aef83a98' size-in-bits='64' id='39341f7e'/>
       <qualified-type-def type-id='984972f4' const='yes' id='3944ca69'/>
+      <class-decl name='ir_raw_event' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/media/rc-core.h' line='299' column='1' id='39486498'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='' type-id='ac5ab621' visibility='default' filepath='include/media/rc-core.h' line='300' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='duty_cycle' type-id='f9b06939' visibility='default' filepath='include/media/rc-core.h' line='304' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='40'>
+          <var-decl name='pulse' type-id='f0981eeb' visibility='default' filepath='include/media/rc-core.h' line='306' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='41'>
+          <var-decl name='reset' type-id='f0981eeb' visibility='default' filepath='include/media/rc-core.h' line='307' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='42'>
+          <var-decl name='timeout' type-id='f0981eeb' visibility='default' filepath='include/media/rc-core.h' line='308' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='43'>
+          <var-decl name='carrier_report' type-id='f0981eeb' visibility='default' filepath='include/media/rc-core.h' line='309' column='1'/>
+        </data-member>
+      </class-decl>
       <function-type size-in-bits='64' id='395aad7e'>
         <parameter type-id='68a2d05b'/>
         <parameter type-id='7f9b4c1b'/>
@@ -26207,6 +26687,13 @@
         </data-member>
       </class-decl>
       <qualified-type-def type-id='026dac7c' const='yes' id='3a7813d3'/>
+      <function-type size-in-bits='64' id='3a7ed44b'>
+        <parameter type-id='7e666abe'/>
+        <parameter type-id='69bf7bee'/>
+        <parameter type-id='f0981eeb'/>
+        <parameter type-id='07751825'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <class-decl name='tcpc_dev' size-in-bits='1536' is-struct='yes' visibility='default' filepath='include/linux/usb/tcpm.h' line='126' column='1' id='3a8363f1'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='fwnode' type-id='4a935625' visibility='default' filepath='include/linux/usb/tcpm.h' line='127' column='1'/>
@@ -26424,6 +26911,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='cc2d5b01' size-in-bits='64' id='3aa8795d'/>
+      <qualified-type-def type-id='f0136291' const='yes' id='3aa8a3a4'/>
       <pointer-type-def type-id='cf8d7d81' size-in-bits='64' id='3aaeef89'/>
       <function-type size-in-bits='64' id='3ab04ceb'>
         <parameter type-id='666fb412'/>
@@ -26714,8 +27202,43 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='3e80a1bc' size-in-bits='64' id='3b2da7a6'/>
-      <class-decl name='iomap' is-struct='yes' visibility='default' is-declaration-only='yes' id='3b326cb5'/>
+      <class-decl name='iomap' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/iomap.h' line='81' column='1' id='3b326cb5'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='addr' type-id='91ce1af9' visibility='default' filepath='include/linux/iomap.h' line='82' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='offset' type-id='69bf7bee' visibility='default' filepath='include/linux/iomap.h' line='83' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='length' type-id='91ce1af9' visibility='default' filepath='include/linux/iomap.h' line='84' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='type' type-id='1dc6a898' visibility='default' filepath='include/linux/iomap.h' line='85' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='208'>
+          <var-decl name='flags' type-id='1dc6a898' visibility='default' filepath='include/linux/iomap.h' line='86' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='bdev' type-id='b88dd945' visibility='default' filepath='include/linux/iomap.h' line='87' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='dax_dev' type-id='75e6c41d' visibility='default' filepath='include/linux/iomap.h' line='88' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='inline_data' type-id='eaa32e2f' visibility='default' filepath='include/linux/iomap.h' line='89' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='private' type-id='eaa32e2f' visibility='default' filepath='include/linux/iomap.h' line='90' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='page_ops' type-id='1fa5a86b' visibility='default' filepath='include/linux/iomap.h' line='91' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/iomap.h' line='93' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='6831a786' size-in-bits='64' id='3b3fe200'/>
+      <pointer-type-def type-id='9a3305c0' size-in-bits='64' id='3b4117f6'/>
       <function-type size-in-bits='64' id='3b43e527'>
         <parameter type-id='29af9a71'/>
         <parameter type-id='f0981eeb'/>
@@ -26742,6 +27265,9 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='6c6e2c82' size-in-bits='64' id='3b71056c'/>
+      <array-type-def dimensions='1' type-id='57fba017' size-in-bits='49344' id='3b76fcc9'>
+        <subrange length='257' type-id='7ff19f0f' id='72e246d7'/>
+      </array-type-def>
       <pointer-type-def type-id='2bc124cb' size-in-bits='64' id='3b7e997b'/>
       <function-type size-in-bits='64' id='3b7ef195'>
         <parameter type-id='1c475548'/>
@@ -26886,6 +27412,20 @@
           <var-decl name='funcs' type-id='3a73453d' visibility='default' filepath='include/drm/drm_gem.h' line='313' column='1'/>
         </data-member>
       </class-decl>
+      <class-decl name='kutrace_ops' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/kutrace.h' line='82' column='1' id='3bc591bd'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='kutrace_trace_1' type-id='00c1fc1c' visibility='default' filepath='include/linux/kutrace.h' line='83' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='kutrace_trace_2' type-id='7aa98ff8' visibility='default' filepath='include/linux/kutrace.h' line='84' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='kutrace_trace_many' type-id='7fef6443' visibility='default' filepath='include/linux/kutrace.h' line='85' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='kutrace_trace_control' type-id='58d83a72' visibility='default' filepath='include/linux/kutrace.h' line='86' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='drm_crtc_crc' size-in-bits='576' is-struct='yes' visibility='default' filepath='include/drm/drm_debugfs_crc.h' line='53' column='1' id='3bcab18a'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/drm/drm_debugfs_crc.h' line='54' column='1'/>
@@ -27481,7 +28021,23 @@
           <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/net/netns/xfrm.h' line='83' column='1'/>
         </data-member>
       </class-decl>
-      <class-decl name='xdp_dev_bulk_queue' is-struct='yes' visibility='default' is-declaration-only='yes' id='3d34ccf8'/>
+      <class-decl name='xdp_dev_bulk_queue' size-in-bits='1344' is-struct='yes' visibility='default' filepath='kernel/bpf/devmap.c' line='55' column='1' id='3d34ccf8'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='q' type-id='a79c00bc' visibility='default' filepath='kernel/bpf/devmap.c' line='56' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1024'>
+          <var-decl name='flush_node' type-id='72f469ec' visibility='default' filepath='kernel/bpf/devmap.c' line='57' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1152'>
+          <var-decl name='dev' type-id='68a2d05b' visibility='default' filepath='kernel/bpf/devmap.c' line='58' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1216'>
+          <var-decl name='dev_rx' type-id='68a2d05b' visibility='default' filepath='kernel/bpf/devmap.c' line='59' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1280'>
+          <var-decl name='count' type-id='f0981eeb' visibility='default' filepath='kernel/bpf/devmap.c' line='60' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='7983eff8' size-in-bits='64' id='3d444e9a'/>
       <pointer-type-def type-id='155948e4' size-in-bits='64' id='3d4ca6d2'/>
       <pointer-type-def type-id='7e5ce7a8' size-in-bits='64' id='3d4d3aba'/>
@@ -27591,7 +28147,7 @@
           <var-decl name='radiotap_vht_details' type-id='1dc6a898' visibility='default' filepath='include/net/mac80211.h' line='2607' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1184'>
-          <var-decl name='radiotap_timestamp' type-id='e7f44043' visibility='default' filepath='include/net/mac80211.h' line='2611' column='1'/>
+          <var-decl name='radiotap_timestamp' type-id='e7f440c0' visibility='default' filepath='include/net/mac80211.h' line='2611' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1280'>
           <var-decl name='netdev_features' type-id='f9f4b16f' visibility='default' filepath='include/net/mac80211.h' line='2612' column='1'/>
@@ -27886,6 +28442,14 @@
         <enumerator name='NVDIMM_FWA_CAP_LIVE' value='3'/>
       </enum-decl>
       <pointer-type-def type-id='3bdb8693' size-in-bits='64' id='3e9b5e67'/>
+      <class-decl name='bpf_id_pair' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/bpf_verifier.h' line='208' column='1' id='3e9ce682'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='old' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='209' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='cur' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='210' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='2cfafd1c' size-in-bits='64' id='3e9fac96'/>
       <class-decl name='devfreq_event_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/linux/devfreq-event.h' line='65' column='1' id='3ea0d50a'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -28018,7 +28582,86 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <typedef-decl name='gfp_t' type-id='f0981eeb' filepath='include/linux/types.h' line='148' column='1' id='3eb7c31c'/>
-      <class-decl name='swap_info_struct' is-struct='yes' visibility='default' is-declaration-only='yes' id='3eb82749'/>
+      <class-decl name='swap_info_struct' size-in-bits='1984' is-struct='yes' visibility='default' filepath='include/linux/swap.h' line='244' column='1' id='3eb82749'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='flags' type-id='7359adad' visibility='default' filepath='include/linux/swap.h' line='245' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='prio' type-id='a2185560' visibility='default' filepath='include/linux/swap.h' line='246' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='list' type-id='e3a91a7c' visibility='default' filepath='include/linux/swap.h' line='247' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='type' type-id='28577a57' visibility='default' filepath='include/linux/swap.h' line='248' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='480'>
+          <var-decl name='max' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='249' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='swap_map' type-id='cf536864' visibility='default' filepath='include/linux/swap.h' line='250' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='cluster_info' type-id='96ae6b2e' visibility='default' filepath='include/linux/swap.h' line='251' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='640'>
+          <var-decl name='free_clusters' type-id='07d9955c' visibility='default' filepath='include/linux/swap.h' line='252' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='768'>
+          <var-decl name='lowest_bit' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='253' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='800'>
+          <var-decl name='highest_bit' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='254' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='832'>
+          <var-decl name='pages' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='255' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='864'>
+          <var-decl name='inuse_pages' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='256' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='896'>
+          <var-decl name='cluster_next' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='257' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='928'>
+          <var-decl name='cluster_nr' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='258' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='960'>
+          <var-decl name='cluster_next_cpu' type-id='807869d3' visibility='default' filepath='include/linux/swap.h' line='259' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1024'>
+          <var-decl name='percpu_cluster' type-id='5417cc83' visibility='default' filepath='include/linux/swap.h' line='260' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1088'>
+          <var-decl name='swap_extent_root' type-id='dec44472' visibility='default' filepath='include/linux/swap.h' line='261' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1152'>
+          <var-decl name='bdev' type-id='b88dd945' visibility='default' filepath='include/linux/swap.h' line='262' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1216'>
+          <var-decl name='swap_file' type-id='77e79a4b' visibility='default' filepath='include/linux/swap.h' line='263' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1280'>
+          <var-decl name='old_block_size' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='264' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1312'>
+          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/linux/swap.h' line='269' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1344'>
+          <var-decl name='cont_lock' type-id='fb4018a0' visibility='default' filepath='include/linux/swap.h' line='282' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1408'>
+          <var-decl name='discard_work' type-id='ef9025d0' visibility='default' filepath='include/linux/swap.h' line='286' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1792'>
+          <var-decl name='discard_clusters' type-id='07d9955c' visibility='default' filepath='include/linux/swap.h' line='287' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1920'>
+          <var-decl name='android_vendor_data1' type-id='91ce1af9' visibility='default' filepath='include/linux/swap.h' line='288' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1984'>
+          <var-decl name='avail_lists' type-id='250ecbd0' visibility='default' filepath='include/linux/swap.h' line='289' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='macsec_secy' size-in-bits='768' is-struct='yes' visibility='default' filepath='include/net/macsec.h' line='214' column='1' id='3ebb2302'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='netdev' type-id='68a2d05b' visibility='default' filepath='include/net/macsec.h' line='215' column='1'/>
@@ -28144,6 +28787,7 @@
       </enum-decl>
       <pointer-type-def type-id='47308153' size-in-bits='64' id='3eef3bc7'/>
       <pointer-type-def type-id='1227fbe9' size-in-bits='64' id='3ef2bf11'/>
+      <typedef-decl name='regex_match_func' type-id='24a2e98b' filepath='kernel/trace/trace.h' line='1610' column='1' id='3ef4b9b8'/>
       <class-decl name='nh_info' size-in-bits='1088' is-struct='yes' visibility='default' filepath='include/net/nexthop.h' line='51' column='1' id='3f017308'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='dev_hash' type-id='03a4a074' visibility='default' filepath='include/net/nexthop.h' line='52' column='1'/>
@@ -28161,7 +28805,7 @@
           <var-decl name='fdb_nh' type-id='b50a4934' visibility='default' filepath='include/net/nexthop.h' line='57' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
-          <var-decl name='' type-id='ac5ab66c' visibility='default' filepath='include/net/nexthop.h' line='59' column='1'/>
+          <var-decl name='' type-id='ac5ab632' visibility='default' filepath='include/net/nexthop.h' line='59' column='1'/>
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='3f0a3b53'>
@@ -28769,6 +29413,17 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='2f04a816' size-in-bits='64' id='4054d674'/>
+      <enum-decl name='ip_conntrack_info' filepath='include/uapi/linux/netfilter/nf_conntrack_common.h' line='7' column='1' id='405b934c'>
+        <underlying-type type-id='9cac1fee'/>
+        <enumerator name='IP_CT_ESTABLISHED' value='0'/>
+        <enumerator name='IP_CT_RELATED' value='1'/>
+        <enumerator name='IP_CT_NEW' value='2'/>
+        <enumerator name='IP_CT_IS_REPLY' value='3'/>
+        <enumerator name='IP_CT_ESTABLISHED_REPLY' value='3'/>
+        <enumerator name='IP_CT_RELATED_REPLY' value='4'/>
+        <enumerator name='IP_CT_NUMBER' value='5'/>
+        <enumerator name='IP_CT_UNTRACKED' value='7'/>
+      </enum-decl>
       <pointer-type-def type-id='b4db8337' size-in-bits='64' id='40672f7b'/>
       <class-decl name='sdio_func' size-in-bits='7936' is-struct='yes' visibility='default' filepath='include/linux/mmc/sdio_func.h' line='34' column='1' id='4073d265'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -28952,6 +29607,11 @@
           <var-decl name='name' type-id='16dc656a' visibility='default' filepath='include/linux/mod_devicetable.h' line='449' column='1'/>
         </data-member>
       </class-decl>
+      <enum-decl name='chipset_type' filepath='include/linux/agp_backend.h' line='35' column='1' id='409df417'>
+        <underlying-type type-id='9cac1fee'/>
+        <enumerator name='NOT_SUPPORTED' value='0'/>
+        <enumerator name='SUPPORTED' value='1'/>
+      </enum-decl>
       <pointer-type-def type-id='49390c3d' size-in-bits='64' id='40a250d9'/>
       <class-decl name='timespec64' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/time64.h' line='13' column='1' id='40a816ad'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -29227,7 +29887,6 @@
       </class-decl>
       <qualified-type-def type-id='9a61119e' const='yes' id='41426935'/>
       <typedef-decl name='snd_ctl_elem_iface_t' type-id='95e97e5e' filepath='include/uapi/sound/asound.h' line='963' column='1' id='4143fc17'/>
-      <pointer-type-def type-id='e07e9784' size-in-bits='64' id='414ea452'/>
       <pointer-type-def type-id='40a816ad' size-in-bits='64' id='4151733d'/>
       <class-decl name='v4l2_subdev_platform_data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/media/v4l2-subdev.h' line='819' column='1' id='415476f4'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -29282,7 +29941,7 @@
           <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='include/linux/splice.h' line='32' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
-          <var-decl name='u' type-id='ac5ab600' visibility='default' filepath='include/linux/splice.h' line='40' column='1'/>
+          <var-decl name='u' type-id='ac5ab67b' visibility='default' filepath='include/linux/splice.h' line='40' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
           <var-decl name='pos' type-id='69bf7bee' visibility='default' filepath='include/linux/splice.h' line='41' column='1'/>
@@ -29298,6 +29957,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='48dbb365' size-in-bits='64' id='41865b69'/>
+      <pointer-type-def type-id='4eba1120' size-in-bits='64' id='4186b116'/>
       <class-decl name='rproc_dump_segment' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/linux/remoteproc.h' line='470' column='1' id='4187a976'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='node' type-id='72f469ec' visibility='default' filepath='include/linux/remoteproc.h' line='471' column='1'/>
@@ -29333,7 +29993,7 @@
           <var-decl name='pad2' type-id='f9b06939' visibility='default' filepath='include/drm/drm_edid.h' line='150' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='24'>
-          <var-decl name='data' type-id='ac5ab5c9' visibility='default' filepath='include/drm/drm_edid.h' line='157' column='1'/>
+          <var-decl name='data' type-id='ac5ab60e' visibility='default' filepath='include/drm/drm_edid.h' line='157' column='1'/>
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='419202b8'>
@@ -29351,6 +30011,23 @@
       <array-type-def dimensions='1' type-id='a1f34f28' size-in-bits='2048' id='41c4bc5d'>
         <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
       </array-type-def>
+      <class-decl name='phylink_config' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/phylink.h' line='70' column='1' id='41c62dab'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='include/linux/phylink.h' line='71' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='type' type-id='bce2e958' visibility='default' filepath='include/linux/phylink.h' line='72' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='96'>
+          <var-decl name='pcs_poll' type-id='b50a4934' visibility='default' filepath='include/linux/phylink.h' line='73' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='104'>
+          <var-decl name='poll_fixed_state' type-id='b50a4934' visibility='default' filepath='include/linux/phylink.h' line='74' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='get_fixed_state' type-id='aefee0d0' visibility='default' filepath='include/linux/phylink.h' line='75' column='1'/>
+        </data-member>
+      </class-decl>
       <function-type size-in-bits='64' id='41c81272'>
         <parameter type-id='af051c69'/>
         <parameter type-id='f0981eeb'/>
@@ -29411,6 +30088,9 @@
         <parameter type-id='5760dcb0'/>
         <return type-id='48b5725f'/>
       </function-type>
+      <array-type-def dimensions='1' type-id='fbc017ef' size-in-bits='8192' id='420686dd'>
+        <subrange length='128' type-id='7ff19f0f' id='1eb1687a'/>
+      </array-type-def>
       <pointer-type-def type-id='e84913bd' size-in-bits='64' id='4209d6b5'/>
       <function-type size-in-bits='64' id='420b230d'>
         <parameter type-id='dfeb7f6c'/>
@@ -29492,6 +30172,7 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='d9de7d63' size-in-bits='64' id='423f39eb'/>
+      <pointer-type-def type-id='828bc029' size-in-bits='64' id='42446285'/>
       <pointer-type-def type-id='d3bb804d' size-in-bits='64' id='42454c29'/>
       <pointer-type-def type-id='4afdce44' size-in-bits='64' id='424a6df6'/>
       <class-decl name='mmc_bus_ops' size-in-bits='896' is-struct='yes' visibility='default' filepath='drivers/mmc/core/core.h' line='20' column='1' id='424ad5b6'>
@@ -29554,13 +30235,12 @@
           <var-decl name='indirect' type-id='f0981eeb' visibility='default' filepath='include/uapi/sound/asound.h' line='1048' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='576'>
-          <var-decl name='value' type-id='ac5ab67b' visibility='default' filepath='include/uapi/sound/asound.h' line='1067' column='1'/>
+          <var-decl name='value' type-id='ac5ab650' visibility='default' filepath='include/uapi/sound/asound.h' line='1067' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='8768'>
           <var-decl name='reserved' type-id='6f10c3ff' visibility='default' filepath='include/uapi/sound/asound.h' line='1068' column='1'/>
         </data-member>
       </class-decl>
-      <pointer-type-def type-id='25baaf57' size-in-bits='64' id='42861783'/>
       <pointer-type-def type-id='e03e976a' size-in-bits='64' id='428819c0'/>
       <function-type size-in-bits='64' id='428b7011'>
         <return type-id='19c2251e'/>
@@ -29617,7 +30297,7 @@
           <var-decl name='count' type-id='f0981eeb' visibility='default' filepath='include/net/inet_hashtables.h' line='114' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab66e' visibility='default' filepath='include/net/inet_hashtables.h' line='115' column='1'/>
+          <var-decl name='' type-id='ac5ab703' visibility='default' filepath='include/net/inet_hashtables.h' line='115' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='df587ad7' size-in-bits='64' id='42bc911b'/>
@@ -29729,7 +30409,7 @@
           <var-decl name='params' type-id='1291defd' visibility='default' filepath='net/wireless/sme.c' line='32' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='3072'>
-          <var-decl name='state' type-id='08f5ca17' visibility='default' filepath='net/wireless/sme.c' line='47' column='1'/>
+          <var-decl name='state' type-id='08f5ca18' visibility='default' filepath='net/wireless/sme.c' line='47' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='3104'>
           <var-decl name='bssid' type-id='cf1a4160' visibility='default' filepath='net/wireless/sme.c' line='48' column='1'/>
@@ -29752,7 +30432,20 @@
       </class-decl>
       <pointer-type-def type-id='ce30b5d2' size-in-bits='64' id='4343d470'/>
       <pointer-type-def type-id='ea4e578a' size-in-bits='64' id='4346d2a4'/>
-      <class-decl name='fsverity_info' is-struct='yes' visibility='default' is-declaration-only='yes' id='43489bca'/>
+      <class-decl name='fsverity_info' size-in-bits='2048' is-struct='yes' visibility='default' filepath='fs/verity/fsverity_private.h' line='73' column='1' id='43489bca'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='tree_params' type-id='0b26224b' visibility='default' filepath='fs/verity/fsverity_private.h' line='74' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='960'>
+          <var-decl name='root_hash' type-id='47ba3182' visibility='default' filepath='fs/verity/fsverity_private.h' line='75' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1472'>
+          <var-decl name='file_digest' type-id='47ba3182' visibility='default' filepath='fs/verity/fsverity_private.h' line='76' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1984'>
+          <var-decl name='inode' type-id='c5a4eb7f' visibility='default' filepath='fs/verity/fsverity_private.h' line='77' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='d5b6f34c' size-in-bits='64' id='434e45fe'/>
       <class-decl name='regulator_init_data' size-in-bits='1728' is-struct='yes' visibility='default' filepath='include/linux/regulator/machine.h' line='236' column='1' id='435002d4'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -29927,6 +30620,10 @@
           <var-decl name='info_element' type-id='bc123684' visibility='default' filepath='include/../drivers/net/wireless/intel/ipw2x00/libipw.h' line='408' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='43d4d3e0'>
+        <parameter type-id='b3c6c7b8'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='722249f6' size-in-bits='64' id='43dccc40'/>
       <function-type size-in-bits='64' id='43e7c387'>
         <parameter type-id='260390aa'/>
@@ -29953,7 +30650,7 @@
           <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2071' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab5ea' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2072' column='1'/>
+          <var-decl name='' type-id='ac5ab660' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2072' column='1'/>
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='440843bd'>
@@ -30102,9 +30799,9 @@
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='44b564e4'>
-        <parameter type-id='a585cbc4'/>
-        <parameter type-id='bbaf3419'/>
-        <parameter type-id='f0981eeb'/>
+        <parameter type-id='a585cbc4' name='tfm'/>
+        <parameter type-id='bbaf3419' name='key'/>
+        <parameter type-id='f0981eeb' name='keylen'/>
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='9281c70f' size-in-bits='64' id='44bef697'/>
@@ -30212,6 +30909,7 @@
         <parameter type-id='b600bf62'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <pointer-type-def type-id='470b0e09' size-in-bits='64' id='452b34c2'/>
       <pointer-type-def type-id='1546c604' size-in-bits='64' id='45305972'/>
       <function-type size-in-bits='64' id='453343e6'>
         <parameter type-id='7e666abe'/>
@@ -30626,7 +31324,7 @@
           <var-decl name='fn' type-id='d5b25e9c' visibility='default' filepath='include/linux/restart_block.h' line='26' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab62e' visibility='default' filepath='include/linux/restart_block.h' line='27' column='1'/>
+          <var-decl name='' type-id='ac5ab5da' visibility='default' filepath='include/linux/restart_block.h' line='27' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='58407416' size-in-bits='64' id='45ef3730'/>
@@ -30887,6 +31585,7 @@
           <var-decl name='size' type-id='d3130597' visibility='default' filepath='include/uapi/drm/drm_mode.h' line='813' column='1'/>
         </data-member>
       </class-decl>
+      <pointer-type-def type-id='faa28adf' size-in-bits='64' id='46d78c8b'/>
       <qualified-type-def type-id='2eec6999' const='yes' id='46f53066'/>
       <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' visibility='default' filepath='arch/arm64/include/asm/mmu.h' line='20' column='1' id='46f77458' is-anonymous='yes'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -30920,6 +31619,7 @@
         <parameter type-id='750dbc1d'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <typedef-decl name='pstate_check_t' type-id='b21b8f21' filepath='arch/arm64/include/asm/insn.h' line='508' column='1' id='470b0e09'/>
       <typedef-decl name='efi_bool_t' type-id='f9b06939' filepath='include/linux/efi.h' line='47' column='1' id='471304a8'/>
       <pointer-type-def type-id='c89dc0a4' size-in-bits='64' id='47150d4e'/>
       <function-type size-in-bits='64' id='471695ce'>
@@ -31007,7 +31707,7 @@
           <var-decl name='reg_val' type-id='2f162548' visibility='default' filepath='drivers/scsi/ufs/ufshci.h' line='304' column='1'/>
         </data-member>
         <data-member access='public'>
-          <var-decl name='' type-id='e7f43fbd' visibility='default' filepath='drivers/scsi/ufs/ufshci.h' line='305' column='1'/>
+          <var-decl name='' type-id='e7f4400d' visibility='default' filepath='drivers/scsi/ufs/ufshci.h' line='305' column='1'/>
         </data-member>
       </union-decl>
       <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='640' id='4725c728'>
@@ -31151,68 +31851,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='32197ce9' size-in-bits='64' id='47877f81'/>
-      <class-decl name='gs_port' size-in-bits='6016' is-struct='yes' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='98' column='1' id='4788f063'>
-        <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='port' type-id='7e1e521a' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='99' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3392'>
-          <var-decl name='port_lock' type-id='fb4018a0' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='100' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3456'>
-          <var-decl name='port_usb' type-id='3921c1a0' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='102' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3520'>
-          <var-decl name='port_num' type-id='f9b06939' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='107' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3584'>
-          <var-decl name='read_pool' type-id='72f469ec' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='109' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3712'>
-          <var-decl name='read_started' type-id='95e97e5e' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='110' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3744'>
-          <var-decl name='read_allocated' type-id='95e97e5e' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='111' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3776'>
-          <var-decl name='read_queue' type-id='72f469ec' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='112' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3904'>
-          <var-decl name='n_read' type-id='f0981eeb' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='113' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='3968'>
-          <var-decl name='push' type-id='5ad6e0ef' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='114' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5056'>
-          <var-decl name='write_pool' type-id='72f469ec' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='116' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5184'>
-          <var-decl name='write_started' type-id='95e97e5e' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='117' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5216'>
-          <var-decl name='write_allocated' type-id='95e97e5e' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='118' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5248'>
-          <var-decl name='port_write_buf' type-id='7664edcc' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='119' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5440'>
-          <var-decl name='drain_wait' type-id='b5ab048f' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='120' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5632'>
-          <var-decl name='write_busy' type-id='b50a4934' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='121' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5696'>
-          <var-decl name='close_wait' type-id='b5ab048f' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='122' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5888'>
-          <var-decl name='suspended' type-id='b50a4934' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='123' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5896'>
-          <var-decl name='start_delayed' type-id='b50a4934' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='124' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='5904'>
-          <var-decl name='port_line_coding' type-id='d4a32434' visibility='default' filepath='drivers/usb/gadget/function/u_serial.c' line='127' column='1'/>
-        </data-member>
-      </class-decl>
+      <class-decl name='gs_port' is-struct='yes' visibility='default' is-declaration-only='yes' id='4788f063'/>
       <class-decl name='deferred_freelist_item' size-in-bits='256' is-struct='yes' visibility='default' filepath='drivers/dma-buf/heaps/deferred-free-helper.h' line='37' column='1' id='479592e1'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='nr_pages' type-id='b59d7dce' visibility='default' filepath='drivers/dma-buf/heaps/deferred-free-helper.h' line='38' column='1'/>
@@ -31252,6 +31891,14 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='19891358' size-in-bits='64' id='47abf612'/>
+      <class-decl name='bpf_reference_state' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/bpf_verifier.h' line='168' column='1' id='47b0e447'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='id' type-id='95e97e5e' visibility='default' filepath='include/linux/bpf_verifier.h' line='172' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='insn_idx' type-id='95e97e5e' visibility='default' filepath='include/linux/bpf_verifier.h' line='176' column='1'/>
+        </data-member>
+      </class-decl>
       <function-type size-in-bits='64' id='47b43ff6'>
         <parameter type-id='37175e4d'/>
         <parameter type-id='95e97e5e'/>
@@ -31343,7 +31990,7 @@
           <var-decl name='sk' type-id='f772df6d' visibility='default' filepath='include/net/ip.h' line='125' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
-          <var-decl name='' type-id='ac5ab627' visibility='default' filepath='include/net/ip.h' line='126' column='1'/>
+          <var-decl name='' type-id='ac5ab669' visibility='default' filepath='include/net/ip.h' line='126' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
           <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='include/net/ip.h' line='130' column='1'/>
@@ -31502,7 +32149,7 @@
           <var-decl name='content' type-id='8efea9e5' visibility='default' filepath='include/sound/info.h' line='67' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
-          <var-decl name='c' type-id='ac5ab680' visibility='default' filepath='include/sound/info.h' line='71' column='1'/>
+          <var-decl name='c' type-id='ac5ab655' visibility='default' filepath='include/sound/info.h' line='71' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='384'>
           <var-decl name='parent' type-id='b9608bfc' visibility='default' filepath='include/sound/info.h' line='72' column='1'/>
@@ -31761,6 +32408,7 @@
           <var-decl name='eval_value' type-id='7359adad' visibility='default' filepath='include/linux/tracepoint.h' line='31' column='1'/>
         </data-member>
       </class-decl>
+      <qualified-type-def type-id='cf9b45ac' const='yes' id='49b990e7'/>
       <typedef-decl name='pci_power_t' type-id='95e97e5e' filepath='include/linux/pci.h' line='156' column='1' id='49c32219'/>
       <qualified-type-def type-id='91ce1af9' const='yes' id='49c81889'/>
       <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/uapi/linux/hdlc/ioctl.h' line='58' column='1' id='49ce3838' is-anonymous='yes'>
@@ -31870,6 +32518,7 @@
       </array-type-def>
       <pointer-type-def type-id='f06f451b' size-in-bits='64' id='4a00a0f7'/>
       <pointer-type-def type-id='64f32e32' size-in-bits='64' id='4a028f44'/>
+      <pointer-type-def type-id='39486498' size-in-bits='64' id='4a06e68e'/>
       <class-decl name='hid_device_id' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/mod_devicetable.h' line='166' column='1' id='4a0784fb'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='bus' type-id='d315442e' visibility='default' filepath='include/linux/mod_devicetable.h' line='167' column='1'/>
@@ -32353,7 +33002,7 @@
       </function-type>
       <function-type size-in-bits='64' id='4b7af74a'>
         <parameter type-id='42c8f564'/>
-        <return type-id='a6223bf6'/>
+        <return type-id='a6223bf7'/>
       </function-type>
       <pointer-type-def type-id='025c78c3' size-in-bits='64' id='4b81d8e7'/>
       <pointer-type-def type-id='a752caf1' size-in-bits='64' id='4b860c99'/>
@@ -32785,7 +33434,7 @@
           <var-decl name='hard_use_expires_seconds' type-id='d3130597' visibility='default' filepath='include/uapi/linux/xfrm.h' line='74' column='1'/>
         </data-member>
       </class-decl>
-      <array-type-def dimensions='1' type-id='e7f43fb1' size-in-bits='2048' id='4cb10997'>
+      <array-type-def dimensions='1' type-id='e7f44018' size-in-bits='2048' id='4cb10998'>
         <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
       </array-type-def>
       <function-type size-in-bits='64' id='4cb2ce2a'>
@@ -32917,7 +33566,7 @@
           <var-decl name='type' type-id='2f162548' visibility='default' filepath='include/uapi/sound/asoc.h' line='253' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab684' visibility='default' filepath='include/uapi/sound/asoc.h' line='254' column='1'/>
+          <var-decl name='' type-id='ac5ab70a' visibility='default' filepath='include/uapi/sound/asoc.h' line='254' column='1'/>
         </data-member>
       </class-decl>
       <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='160' id='4d5a4f46'>
@@ -33414,6 +34063,20 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='cd1955fc' size-in-bits='64' id='4eb95ade'/>
+      <class-decl name='regex' size-in-bits='2176' is-struct='yes' visibility='default' filepath='kernel/trace/trace.h' line='1621' column='1' id='4eba1120'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='pattern' type-id='d1617432' visibility='default' filepath='kernel/trace/trace.h' line='1622' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='2048'>
+          <var-decl name='len' type-id='95e97e5e' visibility='default' filepath='kernel/trace/trace.h' line='1623' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='2080'>
+          <var-decl name='field_len' type-id='95e97e5e' visibility='default' filepath='kernel/trace/trace.h' line='1624' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='2112'>
+          <var-decl name='match' type-id='3ef4b9b8' visibility='default' filepath='kernel/trace/trace.h' line='1625' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='sched_statistics' size-in-bits='1728' is-struct='yes' visibility='default' filepath='include/linux/sched.h' line='425' column='1' id='4ebe02b2'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='wait_start' type-id='91ce1af9' visibility='default' filepath='include/linux/sched.h' line='427' column='1'/>
@@ -33575,6 +34238,7 @@
       <pointer-type-def type-id='fb73ecde' size-in-bits='64' id='4f312040'/>
       <type-decl name='unsigned __int128' size-in-bits='128' id='4f340252'/>
       <pointer-type-def type-id='6c0e4a93' size-in-bits='64' id='4f3d95df'/>
+      <pointer-type-def type-id='22d52e50' size-in-bits='64' id='4f40055a'/>
       <function-type size-in-bits='64' id='4f4445b6'>
         <parameter type-id='855e3679'/>
         <return type-id='48b5725f'/>
@@ -33737,6 +34401,12 @@
           <var-decl name='den' type-id='f0981eeb' visibility='default' filepath='include/linux/clk-provider.h' line='72' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='4f938dce'>
+        <parameter type-id='b3c6c7b8'/>
+        <parameter type-id='95e97e5e'/>
+        <parameter type-id='95e97e5e'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='f2b4d088' size-in-bits='64' id='4fa10f9e'/>
       <function-type size-in-bits='64' id='4fa40360'>
         <parameter type-id='51a94113'/>
@@ -33917,6 +34587,12 @@
           <var-decl name='entry' type-id='72f469ec' visibility='default' filepath='include/linux/wait.h' line='33' column='1'/>
         </data-member>
       </class-decl>
+      <function-type size-in-bits='64' id='504ee449'>
+        <parameter type-id='6dca061b'/>
+        <parameter type-id='eaa32e2f'/>
+        <parameter type-id='4c98e95d'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <class-decl name='drm_mode_config' size-in-bits='9856' is-struct='yes' visibility='default' filepath='include/drm/drm_mode_config.h' line='358' column='1' id='5052051f'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='mutex' type-id='925167dc' visibility='default' filepath='include/drm/drm_mode_config.h' line='369' column='1'/>
@@ -34679,7 +35355,7 @@
           <var-decl name='cra_type' type-id='71dc7604' visibility='default' filepath='include/linux/crypto.h' line='484' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2560'>
-          <var-decl name='cra_u' type-id='ac5ab5a8' visibility='default' filepath='include/linux/crypto.h' line='489' column='1'/>
+          <var-decl name='cra_u' type-id='ac5ab598' visibility='default' filepath='include/linux/crypto.h' line='489' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2816'>
           <var-decl name='cra_init' type-id='469599ea' visibility='default' filepath='include/linux/crypto.h' line='491' column='1'/>
@@ -35020,7 +35696,7 @@
           <var-decl name='fs' type-id='a8ce468c' visibility='default' filepath='include/uapi/linux/ethtool.h' line='1092' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1472'>
-          <var-decl name='' type-id='ac5ab65a' visibility='default' filepath='include/uapi/linux/ethtool.h' line='1093' column='1'/>
+          <var-decl name='' type-id='ac5ab69a' visibility='default' filepath='include/uapi/linux/ethtool.h' line='1093' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1504'>
           <var-decl name='rule_locs' type-id='d5016f6f' visibility='default' filepath='include/uapi/linux/ethtool.h' line='1097' column='1'/>
@@ -35178,9 +35854,48 @@
       </function-type>
       <pointer-type-def type-id='e5af4d64' size-in-bits='64' id='5260af22'/>
       <pointer-type-def type-id='a8adbe3d' size-in-bits='64' id='5264cf1d'/>
-      <class-decl name='userfaultfd_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='526b1662'/>
+      <class-decl name='userfaultfd_ctx' size-in-bits='1024' is-struct='yes' visibility='default' filepath='fs/userfaultfd.c' line='51' column='1' id='526b1662'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='fault_pending_wqh' type-id='b5ab048f' visibility='default' filepath='fs/userfaultfd.c' line='53' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='fault_wqh' type-id='b5ab048f' visibility='default' filepath='fs/userfaultfd.c' line='55' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='fd_wqh' type-id='b5ab048f' visibility='default' filepath='fs/userfaultfd.c' line='57' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='event_wqh' type-id='b5ab048f' visibility='default' filepath='fs/userfaultfd.c' line='59' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='768'>
+          <var-decl name='refile_seq' type-id='0b9c5397' visibility='default' filepath='fs/userfaultfd.c' line='61' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='800'>
+          <var-decl name='refcount' type-id='64615833' visibility='default' filepath='fs/userfaultfd.c' line='63' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='832'>
+          <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='fs/userfaultfd.c' line='65' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='864'>
+          <var-decl name='features' type-id='f0981eeb' visibility='default' filepath='fs/userfaultfd.c' line='67' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='896'>
+          <var-decl name='released' type-id='b50a4934' visibility='default' filepath='fs/userfaultfd.c' line='69' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='904'>
+          <var-decl name='mmap_changing' type-id='b50a4934' visibility='default' filepath='fs/userfaultfd.c' line='71' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='960'>
+          <var-decl name='mm' type-id='df4b7819' visibility='default' filepath='fs/userfaultfd.c' line='73' column='1'/>
+        </data-member>
+      </class-decl>
+      <function-type size-in-bits='64' id='526d0aae'>
+        <parameter type-id='b94a2f7c'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <pointer-type-def type-id='5ef8814f' size-in-bits='64' id='52704eb7'/>
       <pointer-type-def type-id='616601a4' size-in-bits='64' id='52850a16'/>
+      <pointer-type-def type-id='f28519a1' size-in-bits='64' id='528735d1'/>
       <class-decl name='uic_command' size-in-bits='448' is-struct='yes' visibility='default' filepath='drivers/scsi/ufs/ufshcd.h' line='96' column='1' id='52999e5a'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='command' type-id='19c2251e' visibility='default' filepath='drivers/scsi/ufs/ufshcd.h' line='97' column='1'/>
@@ -35202,6 +35917,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='c3e60881' size-in-bits='64' id='5299fb35'/>
+      <pointer-type-def type-id='c387f6d1' size-in-bits='64' id='529ca3c5'/>
       <pointer-type-def type-id='df67c5d0' size-in-bits='64' id='52a50596'/>
       <class-decl name='xfrm_policy_hthresh' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/net/netns/xfrm.h' line='24' column='1' id='52aaaba4'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -35227,6 +35943,7 @@
       <pointer-type-def type-id='e44b8083' size-in-bits='64' id='52abf1d3'/>
       <pointer-type-def type-id='72c04684' size-in-bits='64' id='52af43ea'/>
       <pointer-type-def type-id='f27bb1b0' size-in-bits='64' id='52b8956e'/>
+      <type-decl name='unnamed-enum-underlying-type-0' is-anonymous='yes' is-declaration-only='yes' id='52ba91e1'/>
       <pointer-type-def type-id='e09a048e' size-in-bits='64' id='52baee64'/>
       <class-decl name='attribute_container' size-in-bits='768' is-struct='yes' visibility='default' filepath='include/linux/attribute_container.h' line='16' column='1' id='52bea74f'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -35278,6 +35995,7 @@
         <parameter type-id='35078cb9'/>
         <return type-id='48b5725f'/>
       </function-type>
+      <pointer-type-def type-id='dd3740c5' size-in-bits='64' id='52d55a05'/>
       <pointer-type-def type-id='09818b99' size-in-bits='64' id='52dd4de5'/>
       <pointer-type-def type-id='4706793b' size-in-bits='64' id='52e63b6f'/>
       <function-type size-in-bits='64' id='52e7eff9'>
@@ -35414,6 +36132,11 @@
       <pointer-type-def type-id='1d8506ad' size-in-bits='64' id='53955211'/>
       <pointer-type-def type-id='10216dc5' size-in-bits='64' id='53a00f3d'/>
       <pointer-type-def type-id='628f102a' size-in-bits='64' id='53a5ad54'/>
+      <function-type size-in-bits='64' id='53acb60a'>
+        <parameter type-id='91ce1af9'/>
+        <parameter type-id='91ce1af9'/>
+        <return type-id='48b5725f'/>
+      </function-type>
       <array-type-def dimensions='1' type-id='e151255a' size-in-bits='4096' id='53b70d6c'>
         <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
       </array-type-def>
@@ -35433,7 +36156,7 @@
           <var-decl name='dl_nr_running' type-id='7359adad' visibility='default' filepath='kernel/sched/sched.h' line='679' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='earliest_dl' type-id='e7f4402b' visibility='default' filepath='kernel/sched/sched.h' line='691' column='1'/>
+          <var-decl name='earliest_dl' type-id='e7f4409a' visibility='default' filepath='kernel/sched/sched.h' line='691' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='320'>
           <var-decl name='dl_nr_migratory' type-id='7359adad' visibility='default' filepath='kernel/sched/sched.h' line='693' column='1'/>
@@ -35608,7 +36331,7 @@
       </class-decl>
       <class-decl name='spinlock' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/linux/spinlock_types.h' line='71' column='1' id='53fb272e'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab632' visibility='default' filepath='include/linux/spinlock_types.h' line='72' column='1'/>
+          <var-decl name='' type-id='ac5ab5de' visibility='default' filepath='include/linux/spinlock_types.h' line='72' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='f22a8abb' size-in-bits='64' id='5403cb36'/>
@@ -35620,6 +36343,7 @@
         <parameter type-id='eaa32e2f'/>
         <return type-id='48b5725f'/>
       </function-type>
+      <pointer-type-def type-id='723fef03' size-in-bits='64' id='5417cc83'/>
       <class-decl name='rcu_segcblist' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/linux/rcu_segcblist.h' line='66' column='1' id='541c023a'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='head' type-id='69c138b1' visibility='default' filepath='include/linux/rcu_segcblist.h' line='67' column='1'/>
@@ -35646,6 +36370,65 @@
       <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='160' id='5429fe4a'>
         <subrange length='20' type-id='7ff19f0f' id='fdca39cf'/>
       </array-type-def>
+      <class-decl name='bpf_reg_state' size-in-bits='960' is-struct='yes' visibility='default' filepath='include/linux/bpf_verifier.h' line='44' column='1' id='542a1c2c'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='type' type-id='e830436a' visibility='default' filepath='include/linux/bpf_verifier.h' line='46' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='' type-id='ac5ab6b4' visibility='default' filepath='include/linux/bpf_verifier.h' line='47' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='off' type-id='a7832498' visibility='default' filepath='include/linux/bpf_verifier.h' line='64' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='160'>
+          <var-decl name='id' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='74' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='ref_obj_id' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='114' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='var_off' type-id='58cfbed9' visibility='default' filepath='include/linux/bpf_verifier.h' line='121' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='smin_value' type-id='9b7c55ef' visibility='default' filepath='include/linux/bpf_verifier.h' line='127' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='smax_value' type-id='9b7c55ef' visibility='default' filepath='include/linux/bpf_verifier.h' line='128' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='umin_value' type-id='91ce1af9' visibility='default' filepath='include/linux/bpf_verifier.h' line='129' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='umax_value' type-id='91ce1af9' visibility='default' filepath='include/linux/bpf_verifier.h' line='130' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='640'>
+          <var-decl name='s32_min_value' type-id='a7832498' visibility='default' filepath='include/linux/bpf_verifier.h' line='131' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='672'>
+          <var-decl name='s32_max_value' type-id='a7832498' visibility='default' filepath='include/linux/bpf_verifier.h' line='132' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='704'>
+          <var-decl name='u32_min_value' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='133' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='736'>
+          <var-decl name='u32_max_value' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='134' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='768'>
+          <var-decl name='parent' type-id='2c88d3fa' visibility='default' filepath='include/linux/bpf_verifier.h' line='136' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='832'>
+          <var-decl name='frameno' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='143' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='864'>
+          <var-decl name='subreg_def' type-id='a7832498' visibility='default' filepath='include/linux/bpf_verifier.h' line='148' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='896'>
+          <var-decl name='live' type-id='97424d4b' visibility='default' filepath='include/linux/bpf_verifier.h' line='149' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='928'>
+          <var-decl name='precise' type-id='b50a4934' visibility='default' filepath='include/linux/bpf_verifier.h' line='151' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='libipw_disassoc' size-in-bits='208' is-struct='yes' visibility='default' filepath='include/../drivers/net/wireless/intel/ipw2x00/libipw.h' line='433' column='1' id='542fbd1c'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='header' type-id='0fcffaf6' visibility='default' filepath='include/../drivers/net/wireless/intel/ipw2x00/libipw.h' line='434' column='1'/>
@@ -35830,7 +36613,7 @@
           <var-decl name='iommu_dev' type-id='fa0b179b' visibility='default' filepath='include/linux/io-pgtable.h' line='93' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='384'>
-          <var-decl name='' type-id='ac5ab5d3' visibility='default' filepath='include/linux/io-pgtable.h' line='96' column='1'/>
+          <var-decl name='' type-id='ac5ab619' visibility='default' filepath='include/linux/io-pgtable.h' line='96' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='tcp_congestion_ops' size-in-bits='1216' is-struct='yes' visibility='default' filepath='include/net/tcp.h' line='1051' column='1' id='54718f09'>
@@ -35939,6 +36722,9 @@
       <pointer-type-def type-id='0f47abb9' size-in-bits='64' id='54a031e1'/>
       <pointer-type-def type-id='9ea75344' size-in-bits='64' id='54a1bec6'/>
       <pointer-type-def type-id='c70cf626' size-in-bits='64' id='54a734c8'/>
+      <array-type-def dimensions='1' type-id='066c338e' size-in-bits='512' id='54b1c598'>
+        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
+      </array-type-def>
       <function-type size-in-bits='64' id='54b1caeb'>
         <parameter type-id='93762a0a'/>
         <parameter type-id='eaa32e2f'/>
@@ -36333,6 +37119,9 @@
         <parameter type-id='083811d3'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <array-type-def dimensions='1' type-id='39486498' size-in-bits='32768' id='55a95556'>
+        <subrange length='512' type-id='7ff19f0f' id='c11630dd'/>
+      </array-type-def>
       <array-type-def dimensions='1' type-id='a7a31b92' size-in-bits='infinite' id='55b5dc02'>
         <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
       </array-type-def>
@@ -36981,7 +37770,7 @@
           <var-decl name='ttbr0' type-id='91ce1af9' visibility='default' filepath='arch/arm64/include/asm/thread_info.h' line='30' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='' type-id='ac5ab62c' visibility='default' filepath='arch/arm64/include/asm/thread_info.h' line='32' column='1'/>
+          <var-decl name='' type-id='ac5ab5b3' visibility='default' filepath='arch/arm64/include/asm/thread_info.h' line='32' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
           <var-decl name='scs_base' type-id='eaa32e2f' visibility='default' filepath='arch/arm64/include/asm/thread_info.h' line='45' column='1'/>
@@ -37047,7 +37836,7 @@
           <var-decl name='pan_id' type-id='23119536' visibility='default' filepath='include/net/cfg802154.h' line='232' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab675' visibility='default' filepath='include/net/cfg802154.h' line='233' column='1'/>
+          <var-decl name='' type-id='ac5ab629' visibility='default' filepath='include/net/cfg802154.h' line='233' column='1'/>
         </data-member>
       </class-decl>
       <enum-decl name='thermal_trip_type' filepath='include/uapi/linux/thermal.h' line='12' column='1' id='57e8e954'>
@@ -37058,6 +37847,29 @@
         <enumerator name='THERMAL_TRIP_CRITICAL' value='3'/>
       </enum-decl>
       <pointer-type-def type-id='cb6487f8' size-in-bits='64' id='57f0383a'/>
+      <class-decl name='bpf_subprog_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/bpf_verifier.h' line='380' column='1' id='57fba017'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='start' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='382' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='linfo_idx' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='383' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='stack_depth' type-id='1dc6a898' visibility='default' filepath='include/linux/bpf_verifier.h' line='384' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='80'>
+          <var-decl name='has_tail_call' type-id='b50a4934' visibility='default' filepath='include/linux/bpf_verifier.h' line='385' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='88'>
+          <var-decl name='tail_call_reachable' type-id='b50a4934' visibility='default' filepath='include/linux/bpf_verifier.h' line='386' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='96'>
+          <var-decl name='has_ld_abs' type-id='b50a4934' visibility='default' filepath='include/linux/bpf_verifier.h' line='387' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='android_kabi_reserved1' type-id='91ce1af9' visibility='default' filepath='include/linux/bpf_verifier.h' line='389' column='1'/>
+        </data-member>
+      </class-decl>
       <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='1728' id='581194db'>
         <subrange length='27' type-id='7ff19f0f' id='fddb82f0'/>
       </array-type-def>
@@ -37258,7 +38070,7 @@
           <var-decl name='alg' type-id='67f526b5' visibility='default' filepath='include/crypto/algapi.h' line='73' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='' type-id='ac5ab5a7' visibility='default' filepath='include/crypto/algapi.h' line='74' column='1'/>
+          <var-decl name='' type-id='ac5ab597' visibility='default' filepath='include/crypto/algapi.h' line='74' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
           <var-decl name='frontend' type-id='71dc7604' visibility='default' filepath='include/crypto/algapi.h' line='80' column='1'/>
@@ -37280,6 +38092,14 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='514d8c48' size-in-bits='64' id='58cfaa0e'/>
+      <class-decl name='tnum' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/linux/tnum.h' line='14' column='1' id='58cfbed9'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='value' type-id='91ce1af9' visibility='default' filepath='include/linux/tnum.h' line='15' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='mask' type-id='91ce1af9' visibility='default' filepath='include/linux/tnum.h' line='16' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='e1ee975e' size-in-bits='64' id='58d10a98'/>
       <typedef-decl name='snd_pcm_hw_rule_func_t' type-id='657a5cf1' filepath='include/sound/pcm.h' line='226' column='1' id='58d3b2a5'/>
       <pointer-type-def type-id='0965e7f8' size-in-bits='64' id='58d59612'/>
@@ -37287,6 +38107,7 @@
         <parameter type-id='67f526b5'/>
         <return type-id='48b5725f'/>
       </function-type>
+      <pointer-type-def type-id='5d75af28' size-in-bits='64' id='58d83a72'/>
       <class-decl name='async_domain' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/async.h' line='18' column='1' id='58dbb714'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='pending' type-id='72f469ec' visibility='default' filepath='include/linux/async.h' line='19' column='1'/>
@@ -37411,7 +38232,7 @@
         <return type-id='48b5725f'/>
       </function-type>
       <function-type size-in-bits='64' id='593ec809'>
-        <parameter type-id='343c3ae4' name='policy'/>
+        <parameter type-id='343c3ae4'/>
         <return type-id='48b5725f'/>
       </function-type>
       <class-decl name='media_interface' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/media/media-entity.h' line='338' column='1' id='5943f90f'>
@@ -37523,13 +38344,13 @@
       </class-decl>
       <class-decl name='sock_common' size-in-bits='1088' is-struct='yes' visibility='default' filepath='include/net/sock.h' line='164' column='1' id='5999c5f7'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab64d' visibility='default' filepath='include/net/sock.h' line='165' column='1'/>
+          <var-decl name='' type-id='ac5ab68d' visibility='default' filepath='include/net/sock.h' line='165' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab64e' visibility='default' filepath='include/net/sock.h' line='172' column='1'/>
+          <var-decl name='' type-id='ac5ab68e' visibility='default' filepath='include/net/sock.h' line='172' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='96'>
-          <var-decl name='' type-id='ac5ab64f' visibility='default' filepath='include/net/sock.h' line='177' column='1'/>
+          <var-decl name='' type-id='ac5ab68f' visibility='default' filepath='include/net/sock.h' line='177' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='128'>
           <var-decl name='skc_family' type-id='8efea9e5' visibility='default' filepath='include/net/sock.h' line='185' column='1'/>
@@ -37553,7 +38374,7 @@
           <var-decl name='skc_bound_dev_if' type-id='95e97e5e' visibility='default' filepath='include/net/sock.h' line='191' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='' type-id='ac5ab650' visibility='default' filepath='include/net/sock.h' line='192' column='1'/>
+          <var-decl name='' type-id='ac5ab690' visibility='default' filepath='include/net/sock.h' line='192' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='320'>
           <var-decl name='skc_prot' type-id='d2524501' visibility='default' filepath='include/net/sock.h' line='196' column='1'/>
@@ -37571,13 +38392,13 @@
           <var-decl name='skc_cookie' type-id='28ee064c' visibility='default' filepath='include/net/sock.h' line='204' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='768'>
-          <var-decl name='' type-id='ac5ab651' visibility='default' filepath='include/net/sock.h' line='211' column='1'/>
+          <var-decl name='' type-id='ac5ab691' visibility='default' filepath='include/net/sock.h' line='211' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='832'>
           <var-decl name='skc_dontcopy_begin' type-id='1fdc7fa6' visibility='default' filepath='include/net/sock.h' line='221' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='832'>
-          <var-decl name='' type-id='ac5ab652' visibility='default' filepath='include/net/sock.h' line='223' column='1'/>
+          <var-decl name='' type-id='ac5ab692' visibility='default' filepath='include/net/sock.h' line='223' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='960'>
           <var-decl name='skc_tx_queue_mapping' type-id='8efea9e5' visibility='default' filepath='include/net/sock.h' line='227' column='1'/>
@@ -37586,7 +38407,7 @@
           <var-decl name='skc_rx_queue_mapping' type-id='8efea9e5' visibility='default' filepath='include/net/sock.h' line='229' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='992'>
-          <var-decl name='' type-id='ac5ab653' visibility='default' filepath='include/net/sock.h' line='231' column='1'/>
+          <var-decl name='' type-id='ac5ab693' visibility='default' filepath='include/net/sock.h' line='231' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1024'>
           <var-decl name='skc_refcnt' type-id='64615833' visibility='default' filepath='include/net/sock.h' line='237' column='1'/>
@@ -37595,7 +38416,7 @@
           <var-decl name='skc_dontcopy_end' type-id='1fdc7fa6' visibility='default' filepath='include/net/sock.h' line='239' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1056'>
-          <var-decl name='' type-id='ac5ab654' visibility='default' filepath='include/net/sock.h' line='240' column='1'/>
+          <var-decl name='' type-id='ac5ab694' visibility='default' filepath='include/net/sock.h' line='240' column='1'/>
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='599afbc8'>
@@ -38246,7 +39067,7 @@
           <var-decl name='ptype_specific' type-id='72f469ec' visibility='default' filepath='include/linux/netdevice.h' line='1938' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1344'>
-          <var-decl name='adj_list' type-id='e7f43fe9' visibility='default' filepath='include/linux/netdevice.h' line='1943' column='1'/>
+          <var-decl name='adj_list' type-id='e7f44048' visibility='default' filepath='include/linux/netdevice.h' line='1943' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1600'>
           <var-decl name='features' type-id='f9f4b16f' visibility='default' filepath='include/linux/netdevice.h' line='1945' column='1'/>
@@ -38525,13 +39346,13 @@
           <var-decl name='link_watch_list' type-id='72f469ec' visibility='default' filepath='include/linux/netdevice.h' line='2137' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='10048'>
-          <var-decl name='reg_state' type-id='08f5ca1b' visibility='default' filepath='include/linux/netdevice.h' line='2145' column='1'/>
+          <var-decl name='reg_state' type-id='08f5ca1e' visibility='default' filepath='include/linux/netdevice.h' line='2145' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='10056'>
           <var-decl name='dismantle' type-id='b50a4934' visibility='default' filepath='include/linux/netdevice.h' line='2147' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='10064'>
-          <var-decl name='rtnl_link_state' type-id='08f5ca1c' visibility='default' filepath='include/linux/netdevice.h' line='2152' column='1'/>
+          <var-decl name='rtnl_link_state' type-id='08f5ca1f' visibility='default' filepath='include/linux/netdevice.h' line='2152' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='10080'>
           <var-decl name='needs_free_netdev' type-id='b50a4934' visibility='default' filepath='include/linux/netdevice.h' line='2154' column='1'/>
@@ -38549,7 +39370,7 @@
           <var-decl name='ml_priv_type' type-id='9c6bf017' visibility='default' filepath='include/linux/netdevice.h' line='2165' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='10368'>
-          <var-decl name='' type-id='ac5ab628' visibility='default' filepath='include/linux/netdevice.h' line='2167' column='1'/>
+          <var-decl name='' type-id='ac5ab683' visibility='default' filepath='include/linux/netdevice.h' line='2167' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='10432'>
           <var-decl name='dev' type-id='66e487eb' visibility='default' filepath='include/linux/netdevice.h' line='2180' column='1'/>
@@ -38785,6 +39606,7 @@
           <var-decl name='nlmsg_pid' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/netlink.h' line='49' column='1'/>
         </data-member>
       </class-decl>
+      <qualified-type-def type-id='83e3d743' const='yes' id='5b387b2e'/>
       <class-decl name='v4l2_audioout' size-in-bits='416' is-struct='yes' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1991' column='1' id='5b3ea0c8'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='index' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1992' column='1'/>
@@ -39133,6 +39955,76 @@
       </class-decl>
       <typedef-decl name='regmap_hw_free_context' type-id='b7f9d8e6' filepath='include/linux/regmap.h' line='469' column='1' id='5c459137'/>
       <pointer-type-def type-id='d66ae2ca' size-in-bits='64' id='5c4c6144'/>
+      <class-decl name='bpf_verifier_state' size-in-bits='960' is-struct='yes' visibility='default' filepath='include/linux/bpf_verifier.h' line='216' column='1' id='5c60eeb8'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='frame' type-id='54b1c598' visibility='default' filepath='include/linux/bpf_verifier.h' line='218' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='parent' type-id='eead95ce' visibility='default' filepath='include/linux/bpf_verifier.h' line='219' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='branches' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='265' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='608'>
+          <var-decl name='insn_idx' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='266' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='640'>
+          <var-decl name='curframe' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='267' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='672'>
+          <var-decl name='active_spin_lock' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='268' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='704'>
+          <var-decl name='speculative' type-id='b50a4934' visibility='default' filepath='include/linux/bpf_verifier.h' line='269' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='736'>
+          <var-decl name='first_insn_idx' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='272' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='768'>
+          <var-decl name='last_insn_idx' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='273' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='832'>
+          <var-decl name='jmp_history' type-id='a238132e' visibility='default' filepath='include/linux/bpf_verifier.h' line='279' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='896'>
+          <var-decl name='jmp_history_cnt' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='280' column='1'/>
+        </data-member>
+      </class-decl>
+      <class-decl name='agp_kern_info' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/linux/agp_backend.h' line='45' column='1' id='5c698e85'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='version' type-id='203080b0' visibility='default' filepath='include/linux/agp_backend.h' line='46' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='device' type-id='85196e3f' visibility='default' filepath='include/linux/agp_backend.h' line='47' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='chipset' type-id='409df417' visibility='default' filepath='include/linux/agp_backend.h' line='48' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='mode' type-id='7359adad' visibility='default' filepath='include/linux/agp_backend.h' line='49' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='aper_base' type-id='7359adad' visibility='default' filepath='include/linux/agp_backend.h' line='50' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='aper_size' type-id='b59d7dce' visibility='default' filepath='include/linux/agp_backend.h' line='51' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='max_memory' type-id='95e97e5e' visibility='default' filepath='include/linux/agp_backend.h' line='52' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='416'>
+          <var-decl name='current_memory' type-id='95e97e5e' visibility='default' filepath='include/linux/agp_backend.h' line='53' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='cant_use_aperture' type-id='b50a4934' visibility='default' filepath='include/linux/agp_backend.h' line='54' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='page_mask' type-id='7359adad' visibility='default' filepath='include/linux/agp_backend.h' line='55' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='vm_ops' type-id='9be87662' visibility='default' filepath='include/linux/agp_backend.h' line='56' column='1'/>
+        </data-member>
+      </class-decl>
       <function-type size-in-bits='64' id='5c6f297d'>
         <parameter type-id='7b332e1c'/>
         <return type-id='48b5725f'/>
@@ -39456,7 +40348,7 @@
           <var-decl name='vpd' type-id='0b72939c' visibility='default' filepath='include/linux/pci.h' line='474' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='25024'>
-          <var-decl name='' type-id='ac5ab5a3' visibility='default' filepath='include/linux/pci.h' line='481' column='1'/>
+          <var-decl name='' type-id='ac5ab5a1' visibility='default' filepath='include/linux/pci.h' line='481' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='25088'>
           <var-decl name='ats_cap' type-id='1dc6a898' visibility='default' filepath='include/linux/pci.h' line='485' column='1'/>
@@ -39632,7 +40524,23 @@
         <enumerator name='UTASK_SSTEP_TRAPPED' value='3'/>
       </enum-decl>
       <typedef-decl name='upf_t' type-id='f0981eeb' filepath='include/linux/serial_core.h' line='107' column='1' id='5d1b117e'/>
-      <class-decl name='platform_msi_priv_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='5d1d7263'/>
+      <class-decl name='platform_msi_priv_data' size-in-bits='512' is-struct='yes' visibility='default' filepath='drivers/base/platform-msi.c' line='23' column='1' id='5d1d7263'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='drivers/base/platform-msi.c' line='24' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='host_data' type-id='eaa32e2f' visibility='default' filepath='drivers/base/platform-msi.c' line='25' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='arg' type-id='e36320e9' visibility='default' filepath='drivers/base/platform-msi.c' line='26' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='write_msg' type-id='c335ba2b' visibility='default' filepath='drivers/base/platform-msi.c' line='27' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='devid' type-id='95e97e5e' visibility='default' filepath='drivers/base/platform-msi.c' line='28' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='macsec_dev_stats' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/net/macsec.h' line='91' column='1' id='5d27c895'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='OutPktsUntagged' type-id='d3130597' visibility='default' filepath='include/net/macsec.h' line='92' column='1'/>
@@ -39710,6 +40618,11 @@
         <return type-id='27675065'/>
       </function-type>
       <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
+      <function-type size-in-bits='64' id='5d75af28'>
+        <parameter type-id='91ce1af9'/>
+        <parameter type-id='91ce1af9'/>
+        <return type-id='91ce1af9'/>
+      </function-type>
       <pointer-type-def type-id='09ffba8a' size-in-bits='64' id='5d92c9e0'/>
       <class-decl name='cfg80211_bss_select_adjust' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/net/cfg80211.h' line='2285' column='1' id='5da08e25'>
         <data-member access='public' layout-offset-in-bits='0'>
@@ -39933,6 +40846,9 @@
       <pointer-type-def type-id='af6e35e9' size-in-bits='64' id='5e15576d'/>
       <pointer-type-def type-id='389d1e82' size-in-bits='64' id='5e185d4c'/>
       <pointer-type-def type-id='24451821' size-in-bits='64' id='5e1def9d'/>
+      <array-type-def dimensions='1' type-id='b5ab048f' size-in-bits='768' id='5e2423be'>
+        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
+      </array-type-def>
       <pointer-type-def type-id='b31bfc8a' size-in-bits='64' id='5e2671f8'/>
       <enum-decl name='ieee80211_smps_mode' filepath='include/net/mac80211.h' line='1536' column='1' id='5e2794d2'>
         <underlying-type type-id='9cac1fee'/>
@@ -39975,7 +40891,7 @@
           <var-decl name='memory' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1048' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='512'>
-          <var-decl name='m' type-id='ac5ab5e2' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1054' column='1'/>
+          <var-decl name='m' type-id='ac5ab657' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1054' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='576'>
           <var-decl name='length' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1055' column='1'/>
@@ -39984,7 +40900,7 @@
           <var-decl name='reserved2' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1056' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='640'>
-          <var-decl name='' type-id='ac5ab5e3' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1057' column='1'/>
+          <var-decl name='' type-id='ac5ab658' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1057' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='dma_chan' size-in-bits='896' is-struct='yes' visibility='default' filepath='include/linux/dmaengine.h' line='330' column='1' id='5e3b10aa'>
@@ -40737,7 +41653,7 @@
           <var-decl name='info' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/btf.h' line='41' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab65e' visibility='default' filepath='include/uapi/linux/btf.h' line='49' column='1'/>
+          <var-decl name='' type-id='ac5ab69f' visibility='default' filepath='include/uapi/linux/btf.h' line='49' column='1'/>
         </data-member>
       </class-decl>
       <enum-decl name='query_opcode' filepath='drivers/scsi/ufs/ufs.h' line='398' column='1' id='5f757f13'>
@@ -40910,6 +41826,11 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='124bcd53' size-in-bits='64' id='5f9265d7'/>
+      <enum-decl name='bpf_access_type' filepath='include/linux/bpf.h' line='361' column='1' id='5f9774b0'>
+        <underlying-type type-id='9cac1fee'/>
+        <enumerator name='BPF_READ' value='1'/>
+        <enumerator name='BPF_WRITE' value='2'/>
+      </enum-decl>
       <function-type size-in-bits='64' id='5f9b036f'>
         <parameter type-id='80f25feb'/>
         <return type-id='95e97e5e'/>
@@ -41002,6 +41923,7 @@
         <parameter type-id='6951bca2'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <qualified-type-def type-id='35a61681' const='yes' id='6028f6e0'/>
       <class-decl name='nf_exp_event_notifier' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/net/netfilter/nf_conntrack_ecache.h' line='161' column='1' id='602fd1a9'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='fcn' type-id='c8fa3070' visibility='default' filepath='include/net/netfilter/nf_conntrack_ecache.h' line='162' column='1'/>
@@ -41310,7 +42232,7 @@
       </class-decl>
       <class-decl name='lockref' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/lockref.h' line='25' column='1' id='60efdfd3'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab610' visibility='default' filepath='include/linux/lockref.h' line='26' column='1'/>
+          <var-decl name='' type-id='ac5ab5cb' visibility='default' filepath='include/linux/lockref.h' line='26' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='drm_plane_funcs' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/drm/drm_plane.h' line='256' column='1' id='60eff7ff'>
@@ -41550,7 +42472,18 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='b35335c8' size-in-bits='64' id='611a28de'/>
-      <union-decl name='fscrypt_policy' visibility='default' is-declaration-only='yes' id='61227238'/>
+      <union-decl name='fscrypt_policy' size-in-bits='192' visibility='default' filepath='fs/crypto/fscrypt_private.h' line='110' column='1' id='61227238'>
+        <data-member access='public'>
+          <var-decl name='version' type-id='f9b06939' visibility='default' filepath='fs/crypto/fscrypt_private.h' line='111' column='1'/>
+        </data-member>
+        <data-member access='public'>
+          <var-decl name='v1' type-id='74e2c23b' visibility='default' filepath='fs/crypto/fscrypt_private.h' line='112' column='1'/>
+        </data-member>
+        <data-member access='public'>
+          <var-decl name='v2' type-id='75e2c3ce' visibility='default' filepath='fs/crypto/fscrypt_private.h' line='113' column='1'/>
+        </data-member>
+      </union-decl>
+      <union-decl name='fscrypt_policy' visibility='default' is-declaration-only='yes' id='61227239'/>
       <class-decl name='nvdimm_key_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/libnvdimm.h' line='175' column='1' id='61250075'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='data' type-id='e3dc4fdb' visibility='default' filepath='include/linux/libnvdimm.h' line='176' column='1'/>
@@ -42000,6 +42933,12 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='0ee576bb' size-in-bits='64' id='629ca5cb'/>
+      <function-type size-in-bits='64' id='629e5a31'>
+        <parameter type-id='0dc3586b'/>
+        <parameter type-id='f0981eeb'/>
+        <parameter type-id='d61bf978'/>
+        <return type-id='48b5725f'/>
+      </function-type>
       <pointer-type-def type-id='4b1b543a' size-in-bits='64' id='62a0dabf'/>
       <pointer-type-def type-id='f0c7f006' size-in-bits='64' id='62a26160'/>
       <enum-decl name='string_size_units' filepath='include/linux/string_helpers.h' line='13' column='1' id='62b4b863'>
@@ -42007,7 +42946,23 @@
         <enumerator name='STRING_UNITS_10' value='0'/>
         <enumerator name='STRING_UNITS_2' value='1'/>
       </enum-decl>
-      <class-decl name='futex_pi_state' is-struct='yes' visibility='default' is-declaration-only='yes' id='62bd013f'/>
+      <class-decl name='futex_pi_state' size-in-bits='704' is-struct='yes' visibility='default' filepath='kernel/futex.c' line='173' column='1' id='62bd013f'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='list' type-id='72f469ec' visibility='default' filepath='kernel/futex.c' line='178' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='pi_mutex' type-id='dd823037' visibility='default' filepath='kernel/futex.c' line='183' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='owner' type-id='f23e2572' visibility='default' filepath='kernel/futex.c' line='185' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='refcount' type-id='64615833' visibility='default' filepath='kernel/futex.c' line='186' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='key' type-id='cbf1908e' visibility='default' filepath='kernel/futex.c' line='188' column='1'/>
+        </data-member>
+      </class-decl>
       <typedef-decl name='nf_logfn' type-id='ffb045fe' filepath='include/net/netfilter/nf_log.h' line='39' column='1' id='62c10f49'/>
       <pointer-type-def type-id='12f283a5' size-in-bits='64' id='62c51a1d'/>
       <class-decl name='vm_area_struct' size-in-bits='1856' is-struct='yes' visibility='default' filepath='include/linux/mm_types.h' line='319' column='1' id='62c85860'>
@@ -42039,7 +42994,7 @@
           <var-decl name='vm_flags' type-id='7359adad' visibility='default' filepath='include/linux/mm_types.h' line='348' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='704'>
-          <var-decl name='' type-id='ac5ab618' visibility='default' filepath='include/linux/mm_types.h' line='358' column='1'/>
+          <var-decl name='' type-id='ac5ab5d3' visibility='default' filepath='include/linux/mm_types.h' line='358' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='960'>
           <var-decl name='anon_vma_chain' type-id='72f469ec' visibility='default' filepath='include/linux/mm_types.h' line='376' column='1'/>
@@ -42631,6 +43586,9 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='c35ca4f3' size-in-bits='64' id='63d7819b'/>
+      <array-type-def dimensions='1' type-id='ca3485a8' size-in-bits='1984' id='63d91190'>
+        <subrange length='31' type-id='7ff19f0f' id='ae5e1d19'/>
+      </array-type-def>
       <function-type size-in-bits='64' id='63df6bcc'>
         <parameter type-id='be65fdd0'/>
         <parameter type-id='fbc017ef'/>
@@ -42681,7 +43639,7 @@
           <var-decl name='sequence' type-id='91ce1af9' visibility='default' filepath='include/drm/drm_vblank.h' line='54' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='704'>
-          <var-decl name='event' type-id='ac5ab5cb' visibility='default' filepath='include/drm/drm_vblank.h' line='78' column='1'/>
+          <var-decl name='event' type-id='ac5ab612' visibility='default' filepath='include/drm/drm_vblank.h' line='78' column='1'/>
         </data-member>
       </class-decl>
       <function-type size-in-bits='64' id='6428f4eb'>
@@ -42995,6 +43953,7 @@
           <var-decl name='index' type-id='8f048e17' visibility='default' filepath='include/media/h264-ctrls.h' line='152' column='1'/>
         </data-member>
       </class-decl>
+      <pointer-type-def type-id='80a367ec' size-in-bits='64' id='65936caa'/>
       <pointer-type-def type-id='b9acff95' size-in-bits='64' id='659a1059'/>
       <pointer-type-def type-id='f8a88be2' size-in-bits='64' id='65a8a3df'/>
       <class-decl name='gnet_dump' size-in-bits='768' is-struct='yes' visibility='default' filepath='include/net/gen_stats.h' line='23' column='1' id='65baad60'>
@@ -43066,7 +44025,7 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='bed4c75a' size-in-bits='64' id='65e6c748'/>
-      <class-decl name='tipc_media' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/../net/tipc/bearer.h' line='103' column='1' id='65e7c8b8'>
+      <class-decl name='tipc_media' size-in-bits='832' is-struct='yes' visibility='default' filepath='net/tipc/bearer.h' line='103' column='1' id='65e7c8b8'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='send_msg' type-id='a170b5bb' visibility='default' filepath='include/../net/tipc/bearer.h' line='104' column='1'/>
         </data-member>
@@ -43201,6 +44160,12 @@
       <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
         <subrange length='20' type-id='7ff19f0f' id='fdca39cf'/>
       </array-type-def>
+      <function-type size-in-bits='64' id='6652cba9'>
+        <parameter type-id='7fe42640'/>
+        <parameter type-id='b50a4934'/>
+        <parameter type-id='18145275'/>
+        <return type-id='95e97e5e'/>
+      </function-type>
       <class-decl name='libipw_channel' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/../drivers/net/wireless/intel/ipw2x00/libipw.h' line='698' column='1' id='66536c62'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='freq' type-id='19c2251e' visibility='default' filepath='include/../drivers/net/wireless/intel/ipw2x00/libipw.h' line='699' column='1'/>
@@ -43920,7 +44885,7 @@
           <var-decl name='group_info' type-id='383471a1' visibility='default' filepath='include/linux/cred.h' line='147' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1216'>
-          <var-decl name='' type-id='ac5ab602' visibility='default' filepath='include/linux/cred.h' line='149' column='1'/>
+          <var-decl name='' type-id='ac5ab5a4' visibility='default' filepath='include/linux/cred.h' line='149' column='1'/>
         </data-member>
       </class-decl>
       <class-decl name='thermal_zone_of_device_ops' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/linux/thermal.h' line='322' column='1' id='67409b07'>
@@ -43991,7 +44956,113 @@
       <pointer-type-def type-id='7ac013b4' size-in-bits='64' id='67acad02'/>
       <pointer-type-def type-id='aec72305' size-in-bits='64' id='67adf9a9'/>
       <pointer-type-def type-id='16c375b8' size-in-bits='64' id='67b214d6'/>
-      <class-decl name='rcu_node' is-struct='yes' visibility='default' is-declaration-only='yes' id='67b24a02'/>
+      <class-decl name='rcu_node' size-in-bits='4608' is-struct='yes' visibility='default' filepath='kernel/rcu/tree.h' line='45' column='1' id='67b24a02'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='lock' type-id='f5c90b3f' visibility='default' filepath='kernel/rcu/tree.h' line='46' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='gp_seq' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='49' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='gp_seq_needed' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='50' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='completedqs' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='51' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='qsmask' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='52' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='rcu_gp_init_mask' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='58' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='qsmaskinit' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='59' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='qsmaskinitnext' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='63' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='expmask' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='65' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='expmaskinit' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='68' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='640'>
+          <var-decl name='expmaskinitnext' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='72' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='704'>
+          <var-decl name='cbovldmask' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='76' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='768'>
+          <var-decl name='ffmask' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='78' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='832'>
+          <var-decl name='grpmask' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='79' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='896'>
+          <var-decl name='grplo' type-id='95e97e5e' visibility='default' filepath='kernel/rcu/tree.h' line='81' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='928'>
+          <var-decl name='grphi' type-id='95e97e5e' visibility='default' filepath='kernel/rcu/tree.h' line='82' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='960'>
+          <var-decl name='grpnum' type-id='f9b06939' visibility='default' filepath='kernel/rcu/tree.h' line='83' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='968'>
+          <var-decl name='level' type-id='f9b06939' visibility='default' filepath='kernel/rcu/tree.h' line='84' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='976'>
+          <var-decl name='wait_blkd_tasks' type-id='b50a4934' visibility='default' filepath='kernel/rcu/tree.h' line='85' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1024'>
+          <var-decl name='parent' type-id='d5d06540' visibility='default' filepath='kernel/rcu/tree.h' line='89' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1088'>
+          <var-decl name='blkd_tasks' type-id='72f469ec' visibility='default' filepath='kernel/rcu/tree.h' line='90' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1216'>
+          <var-decl name='gp_tasks' type-id='e84b031a' visibility='default' filepath='kernel/rcu/tree.h' line='94' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1280'>
+          <var-decl name='exp_tasks' type-id='e84b031a' visibility='default' filepath='kernel/rcu/tree.h' line='98' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1344'>
+          <var-decl name='boost_tasks' type-id='e84b031a' visibility='default' filepath='kernel/rcu/tree.h' line='104' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1408'>
+          <var-decl name='boost_mtx' type-id='dd823037' visibility='default' filepath='kernel/rcu/tree.h' line='112' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1664'>
+          <var-decl name='boost_time' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='115' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1728'>
+          <var-decl name='boost_kthread_task' type-id='f23e2572' visibility='default' filepath='kernel/rcu/tree.h' line='117' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1792'>
+          <var-decl name='boost_kthread_status' type-id='f0981eeb' visibility='default' filepath='kernel/rcu/tree.h' line='120' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='1856'>
+          <var-decl name='nocb_gp_wq' type-id='a15e24ba' visibility='default' filepath='kernel/rcu/tree.h' line='123' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='2560'>
+          <var-decl name='fqslock' type-id='f5c90b3f' visibility='default' filepath='kernel/rcu/tree.h' line='126' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='3072'>
+          <var-decl name='exp_lock' type-id='fb4018a0' visibility='default' filepath='kernel/rcu/tree.h' line='128' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='3136'>
+          <var-decl name='exp_seq_rq' type-id='7359adad' visibility='default' filepath='kernel/rcu/tree.h' line='129' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='3200'>
+          <var-decl name='exp_wq' type-id='5e2423be' visibility='default' filepath='kernel/rcu/tree.h' line='130' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='3968'>
+          <var-decl name='rew' type-id='b4ccf447' visibility='default' filepath='kernel/rcu/tree.h' line='131' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='4352'>
+          <var-decl name='exp_need_flush' type-id='b50a4934' visibility='default' filepath='kernel/rcu/tree.h' line='132' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='d24b8c9c' size-in-bits='64' id='67bbaeda'/>
       <array-type-def dimensions='1' type-id='f0981eeb' size-in-bits='320' id='67c1c82c'>
         <subrange length='10' type-id='7ff19f0f' id='487da03a'/>
@@ -44143,8 +45214,51 @@
         <parameter type-id='9c313c2d'/>
         <return type-id='95e97e5e'/>
       </function-type>
+      <enum-decl name='cec_pin_state' filepath='drivers/media/cec/core/cec-pin-priv.h' line='15' column='1' id='68160603'>
+        <underlying-type type-id='9cac1fee'/>
+        <enumerator name='CEC_ST_OFF' value='0'/>
+        <enumerator name='CEC_ST_IDLE' value='1'/>
+        <enumerator name='CEC_ST_TX_WAIT' value='2'/>
+        <enumerator name='CEC_ST_TX_WAIT_FOR_HIGH' value='3'/>
+        <enumerator name='CEC_ST_TX_START_BIT_LOW' value='4'/>
+        <enumerator name='CEC_ST_TX_START_BIT_HIGH' value='5'/>
+        <enumerator name='CEC_ST_TX_START_BIT_HIGH_SHORT' value='6'/>
+        <enumerator name='CEC_ST_TX_START_BIT_HIGH_LONG' value='7'/>
+        <enumerator name='CEC_ST_TX_START_BIT_LOW_CUSTOM' value='8'/>
+        <enumerator name='CEC_ST_TX_START_BIT_HIGH_CUSTOM' value='9'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_0_LOW' value='10'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_0_HIGH' value='11'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_0_HIGH_SHORT' value='12'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_0_HIGH_LONG' value='13'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_LOW' value='14'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_HIGH' value='15'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_HIGH_SHORT' value='16'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_HIGH_LONG' value='17'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_HIGH_PRE_SAMPLE' value='18'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_HIGH_POST_SAMPLE' value='19'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_HIGH_POST_SAMPLE_SHORT' value='20'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_1_HIGH_POST_SAMPLE_LONG' value='21'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_LOW_CUSTOM' value='22'/>
+        <enumerator name='CEC_ST_TX_DATA_BIT_HIGH_CUSTOM' value='23'/>
+        <enumerator name='CEC_ST_TX_PULSE_LOW_CUSTOM' value='24'/>
+        <enumerator name='CEC_ST_TX_PULSE_HIGH_CUSTOM' value='25'/>
+        <enumerator name='CEC_ST_TX_LOW_DRIVE' value='26'/>
+        <enumerator name='CEC_ST_RX_START_BIT_LOW' value='27'/>
+        <enumerator name='CEC_ST_RX_START_BIT_HIGH' value='28'/>
+        <enumerator name='CEC_ST_RX_DATA_SAMPLE' value='29'/>
+        <enumerator name='CEC_ST_RX_DATA_POST_SAMPLE' value='30'/>
+        <enumerator name='CEC_ST_RX_DATA_WAIT_FOR_LOW' value='31'/>
+        <enumerator name='CEC_ST_RX_ACK_LOW' value='32'/>
+        <enumerator name='CEC_ST_RX_ACK_LOW_POST' value='33'/>
+        <enumerator name='CEC_ST_RX_ACK_HIGH_POST' value='34'/>
+        <enumerator name='CEC_ST_RX_ACK_FINISH' value='35'/>
+        <enumerator name='CEC_ST_RX_LOW_DRIVE' value='36'/>
+        <enumerator name='CEC_ST_RX_IRQ' value='37'/>
+        <enumerator name='CEC_PIN_STATES' value='38'/>
+      </enum-decl>
       <pointer-type-def type-id='c148e595' size-in-bits='64' id='68197365'/>
       <pointer-type-def type-id='425496d7' size-in-bits='64' id='6829b047'/>
+      <qualified-type-def type-id='8861584a' const='yes' id='682ab981'/>
       <function-type size-in-bits='64' id='6831a786'>
         <parameter type-id='a970a64c'/>
         <parameter type-id='6e160b14'/>
@@ -44468,7 +45582,7 @@
           <var-decl name='pmsr_capa' type-id='5abfac26' visibility='default' filepath='include/net/cfg80211.h' line='5066' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='11072'>
-          <var-decl name='tid_config_support' type-id='e7f43f93' visibility='default' filepath='include/net/cfg80211.h' line='5071' column='1'/>
+          <var-decl name='tid_config_support' type-id='e7f43fdc' visibility='default' filepath='include/net/cfg80211.h' line='5071' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='11264'>
           <var-decl name='max_data_retry_count' type-id='f9b06939' visibility='default' filepath='include/net/cfg80211.h' line='5073' column='1'/>
@@ -45063,7 +46177,7 @@
       </function-type>
       <class-decl name='tcf_result' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/net/sch_generic.h' line='315' column='1' id='68d8e236'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab64c' visibility='default' filepath='include/net/sch_generic.h' line='316' column='1'/>
+          <var-decl name='' type-id='ac5ab68c' visibility='default' filepath='include/net/sch_generic.h' line='316' column='1'/>
         </data-member>
       </class-decl>
       <qualified-type-def type-id='a3285bb7' const='yes' id='68dd2616'/>
@@ -45217,33 +46331,33 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='82a4acbf' size-in-bits='64' id='6957e3f3'/>
-      <class-decl name='key_user' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/../security/keys/internal.h' line='54' column='1' id='696d238e'>
+      <class-decl name='key_user' size-in-bits='832' is-struct='yes' visibility='default' filepath='security/keys/internal.h' line='54' column='1' id='696d238e'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='node' type-id='2a8a6332' visibility='default' filepath='include/../security/keys/internal.h' line='55' column='1'/>
+          <var-decl name='node' type-id='2a8a6332' visibility='default' filepath='security/keys/internal.h' line='55' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='cons_lock' type-id='925167dc' visibility='default' filepath='include/../security/keys/internal.h' line='56' column='1'/>
+          <var-decl name='cons_lock' type-id='925167dc' visibility='default' filepath='security/keys/internal.h' line='56' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='576'>
-          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='include/../security/keys/internal.h' line='57' column='1'/>
+          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='security/keys/internal.h' line='57' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='608'>
-          <var-decl name='usage' type-id='64615833' visibility='default' filepath='include/../security/keys/internal.h' line='58' column='1'/>
+          <var-decl name='usage' type-id='64615833' visibility='default' filepath='security/keys/internal.h' line='58' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='640'>
-          <var-decl name='nkeys' type-id='49178f86' visibility='default' filepath='include/../security/keys/internal.h' line='59' column='1'/>
+          <var-decl name='nkeys' type-id='49178f86' visibility='default' filepath='security/keys/internal.h' line='59' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='672'>
-          <var-decl name='nikeys' type-id='49178f86' visibility='default' filepath='include/../security/keys/internal.h' line='60' column='1'/>
+          <var-decl name='nikeys' type-id='49178f86' visibility='default' filepath='security/keys/internal.h' line='60' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='704'>
-          <var-decl name='uid' type-id='d80b72e6' visibility='default' filepath='include/../security/keys/internal.h' line='61' column='1'/>
+          <var-decl name='uid' type-id='d80b72e6' visibility='default' filepath='security/keys/internal.h' line='61' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='736'>
-          <var-decl name='qnkeys' type-id='95e97e5e' visibility='default' filepath='include/../security/keys/internal.h' line='62' column='1'/>
+          <var-decl name='qnkeys' type-id='95e97e5e' visibility='default' filepath='security/keys/internal.h' line='62' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='768'>
-          <var-decl name='qnbytes' type-id='95e97e5e' visibility='default' filepath='include/../security/keys/internal.h' line='63' column='1'/>
+          <var-decl name='qnbytes' type-id='95e97e5e' visibility='default' filepath='security/keys/internal.h' line='63' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='c372d726' size-in-bits='64' id='696df79c'/>
@@ -45525,6 +46639,11 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='21c5156b' size-in-bits='64' id='6a407553'/>
+      <function-type size-in-bits='64' id='6a43fbe9'>
+        <parameter type-id='8738d729'/>
+        <parameter type-id='18145275'/>
+        <return type-id='9de9a74c'/>
+      </function-type>
       <pointer-type-def type-id='3944ca69' size-in-bits='64' id='6a4a6779'/>
       <pointer-type-def type-id='e4f938dc' size-in-bits='64' id='6a54ab42'/>
       <class-decl name='cpu_context' size-in-bits='832' is-struct='yes' visibility='default' filepath='arch/arm64/include/asm/processor.h' line='122' column='1' id='6a577ca5'>
@@ -45758,7 +46877,7 @@
           <var-decl name='rt_gw_family' type-id='f9b06939' visibility='default' filepath='include/net/route.h' line='60' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1056'>
-          <var-decl name='' type-id='ac5ab670' visibility='default' filepath='include/net/route.h' line='62' column='1'/>
+          <var-decl name='' type-id='ac5ab634' visibility='default' filepath='include/net/route.h' line='62' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='1184'>
           <var-decl name='rt_mtu_locked' type-id='19c2251e' visibility='default' filepath='include/net/route.h' line='68' column='1'/>
@@ -45776,7 +46895,14 @@
       <pointer-type-def type-id='b69ec80d' size-in-bits='64' id='6aed11b9'/>
       <pointer-type-def type-id='e3e12fea' size-in-bits='64' id='6af04ca4'/>
       <pointer-type-def type-id='74e7a035' size-in-bits='64' id='6af64a09'/>
-      <class-decl name='uncached_list' is-struct='yes' visibility='default' is-declaration-only='yes' id='6b1203e5'/>
+      <class-decl name='uncached_list' size-in-bits='192' is-struct='yes' visibility='default' filepath='net/ipv6/route.c' line='128' column='1' id='6b1203e5'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='net/ipv4/route.c' line='1544' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='head' type-id='72f469ec' visibility='default' filepath='net/ipv4/route.c' line='1545' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='tty_bufhead' size-in-bits='1344' is-struct='yes' visibility='default' filepath='include/linux/tty.h' line='86' column='1' id='6b1bde38'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='head' type-id='a150e667' visibility='default' filepath='include/linux/tty.h' line='87' column='1'/>
@@ -46384,6 +47510,7 @@
       <pointer-type-def type-id='aaad2fce' size-in-bits='64' id='6ca57870'/>
       <pointer-type-def type-id='93b4100d' size-in-bits='64' id='6ca6fa6d'/>
       <pointer-type-def type-id='32037540' size-in-bits='64' id='6cae92ea'/>
+      <pointer-type-def type-id='26bba2ad' size-in-bits='64' id='6cb3a271'/>
       <class-decl name='pci_device_id' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/linux/mod_devicetable.h' line='38' column='1' id='6cb59de2'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='vendor' type-id='3f1a6b60' visibility='default' filepath='include/linux/mod_devicetable.h' line='39' column='1'/>
@@ -46978,7 +48105,6 @@
       <pointer-type-def type-id='80d02f4e' size-in-bits='64' id='6e731d78'/>
       <pointer-type-def type-id='c2b72af8' size-in-bits='64' id='6e764b1e'/>
       <pointer-type-def type-id='929b60e1' size-in-bits='64' id='6e829429'/>
-      <qualified-type-def type-id='bc84eba7' const='yes' id='6e85ad52'/>
       <class-decl name='v4l2_subdev_video_ops' size-in-bits='1152' is-struct='yes' visibility='default' filepath='include/media/v4l2-subdev.h' line='413' column='1' id='6eadcbe0'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='s_routing' type-id='f9d7b9fc' visibility='default' filepath='include/media/v4l2-subdev.h' line='414' column='1'/>
@@ -47105,6 +48231,23 @@
       <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='1024' id='6f10c3ff'>
         <subrange length='128' type-id='7ff19f0f' id='1eb1687a'/>
       </array-type-def>
+      <class-decl name='bpf_verifier_log' size-in-bits='8384' is-struct='yes' visibility='default' filepath='include/linux/bpf_verifier.h' line='344' column='1' id='6f157377'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='level' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='345' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='kbuf' type-id='b54ce520' visibility='default' filepath='include/linux/bpf_verifier.h' line='346' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='8256'>
+          <var-decl name='ubuf' type-id='26a90f95' visibility='default' filepath='include/linux/bpf_verifier.h' line='347' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='8320'>
+          <var-decl name='len_used' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='348' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='8352'>
+          <var-decl name='len_total' type-id='19c2251e' visibility='default' filepath='include/linux/bpf_verifier.h' line='349' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='7c3a095f' size-in-bits='64' id='6f262307'/>
       <pointer-type-def type-id='924e6a9f' size-in-bits='64' id='6f2bf2e3'/>
       <pointer-type-def type-id='f569a53c' size-in-bits='64' id='6f33eada'/>
@@ -47211,6 +48354,7 @@
       <array-type-def dimensions='1' type-id='02913b69' size-in-bits='6144' id='6fcbfa84'>
         <subrange length='96' type-id='7ff19f0f' id='1df62250'/>
       </array-type-def>
+      <pointer-type-def type-id='cd8ce92b' size-in-bits='64' id='6fd5b1ab'/>
       <function-type size-in-bits='64' id='6fd68117'>
         <parameter type-id='0fbf3cfd'/>
         <parameter type-id='68a2d05b'/>
@@ -47284,10 +48428,75 @@
         <enumerator name='BAR_RX_EVENT' value='2'/>
         <enumerator name='BA_FRAME_TIMEOUT' value='3'/>
       </enum-decl>
+      <pointer-type-def type-id='24ae0207' size-in-bits='64' id='70419063'/>
       <pointer-type-def type-id='bdcf5751' size-in-bits='64' id='7041aa49'/>
       <pointer-type-def type-id='5113b296' size-in-bits='64' id='70487b28'/>
       <pointer-type-def type-id='f5c90b3f' size-in-bits='64' id='704982b4'/>
-      <class-decl name='writeback_control' is-struct='yes' visibility='default' is-declaration-only='yes' id='705711f5'/>
+      <class-decl name='writeback_control' size-in-bits='768' is-struct='yes' visibility='default' filepath='include/linux/writeback.h' line='51' column='1' id='705711f5'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='nr_to_write' type-id='bd54fe1a' visibility='default' filepath='include/linux/writeback.h' line='52' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='pages_skipped' type-id='bd54fe1a' visibility='default' filepath='include/linux/writeback.h' line='54' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='range_start' type-id='69bf7bee' visibility='default' filepath='include/linux/writeback.h' line='61' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='range_end' type-id='69bf7bee' visibility='default' filepath='include/linux/writeback.h' line='62' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='sync_mode' type-id='cf92d981' visibility='default' filepath='include/linux/writeback.h' line='64' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='288'>
+          <var-decl name='for_kupdate' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='66' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='289'>
+          <var-decl name='for_background' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='67' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='290'>
+          <var-decl name='tagged_writepages' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='68' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='291'>
+          <var-decl name='for_reclaim' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='69' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='292'>
+          <var-decl name='range_cyclic' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='70' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='293'>
+          <var-decl name='for_sync' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='71' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='294'>
+          <var-decl name='no_cgroup_owner' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='79' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='295'>
+          <var-decl name='punt_to_cgroup' type-id='f0981eeb' visibility='default' filepath='include/linux/writeback.h' line='81' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='wb' type-id='f885ca7d' visibility='default' filepath='include/linux/writeback.h' line='84' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
+          <var-decl name='inode' type-id='7e666abe' visibility='default' filepath='include/linux/writeback.h' line='85' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='wb_id' type-id='95e97e5e' visibility='default' filepath='include/linux/writeback.h' line='88' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='480'>
+          <var-decl name='wb_lcand_id' type-id='95e97e5e' visibility='default' filepath='include/linux/writeback.h' line='89' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='512'>
+          <var-decl name='wb_tcand_id' type-id='95e97e5e' visibility='default' filepath='include/linux/writeback.h' line='90' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='576'>
+          <var-decl name='wb_bytes' type-id='b59d7dce' visibility='default' filepath='include/linux/writeback.h' line='91' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='640'>
+          <var-decl name='wb_lcand_bytes' type-id='b59d7dce' visibility='default' filepath='include/linux/writeback.h' line='92' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='704'>
+          <var-decl name='wb_tcand_bytes' type-id='b59d7dce' visibility='default' filepath='include/linux/writeback.h' line='93' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='2181e5cc' size-in-bits='64' id='705eaeca'/>
       <pointer-type-def type-id='45947737' size-in-bits='64' id='706d79ff'/>
       <function-type size-in-bits='64' id='706f3909'>
@@ -47508,6 +48717,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='e6f3a13f' size-in-bits='64' id='70b08f83'/>
+      <typedef-decl name='filter_pred_fn_t' type-id='24b51593' filepath='kernel/trace/trace.h' line='1608' column='1' id='70bbf57e'/>
       <pointer-type-def type-id='25edcf18' size-in-bits='64' id='70be41da'/>
       <qualified-type-def type-id='63b74212' const='yes' id='70bf28f5'/>
       <class-decl name='blk_mq_ctxs' size-in-bits='832' is-struct='yes' visibility='default' filepath='block/blk-mq.h' line='10' column='1' id='70bf757e'>
@@ -47568,6 +48778,7 @@
         <return type-id='48b5725f'/>
       </function-type>
       <pointer-type-def type-id='81d3e1dd' size-in-bits='64' id='710bea3d'/>
+      <pointer-type-def type-id='3744a45a' size-in-bits='64' id='710edc50'/>
       <class-decl name='clk_parent_map' size-in-bits='320' is-struct='yes' visibility='default' filepath='drivers/clk/clk.c' line='48' column='1' id='710f82fd'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='hw' type-id='9e6d4b4e' visibility='default' filepath='drivers/clk/clk.c' line='49' column='1'/>
@@ -47663,6 +48874,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='9e8c0698' size-in-bits='64' id='71480a3e'/>
+      <pointer-type-def type-id='d1e93cda' size-in-bits='64' id='714fd734'/>
       <function-type size-in-bits='64' id='714fe898'>
         <parameter type-id='f5438ac7'/>
         <parameter type-id='ba0b1d2e'/>
@@ -47950,7 +49162,7 @@
       </function-type>
       <class-decl name='kqid' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/quota.h' line='68' column='1' id='72028e1c'>
         <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab61b' visibility='default' filepath='include/linux/quota.h' line='69' column='1'/>
+          <var-decl name='' type-id='ac5ab5d9' visibility='default' filepath='include/linux/quota.h' line='69' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='32'>
           <var-decl name='type' type-id='9ff1dafd' visibility='default' filepath='include/linux/quota.h' line='74' column='1'/>
@@ -48099,7 +49311,7 @@
           <var-decl name='twsk_prot' type-id='d68ad8b5' visibility='default' filepath='include/net/sock.h' line='1258' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2752'>
-          <var-decl name='h' type-id='ac5ab655' visibility='default' filepath='include/net/sock.h' line='1265' column='1'/>
+          <var-decl name='h' type-id='ac5ab695' visibility='default' filepath='include/net/sock.h' line='1265' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='2816'>
           <var-decl name='owner' type-id='2730d015' visibility='default' filepath='include/net/sock.h' line='1267' column='1'/>
@@ -48144,6 +49356,14 @@
       <pointer-type-def type-id='dd72818d' size-in-bits='64' id='722604ad'/>
       <pointer-type-def type-id='dbbc1900' size-in-bits='64' id='723114f6'/>
       <pointer-type-def type-id='a192e032' size-in-bits='64' id='7236c5c8'/>
+      <class-decl name='percpu_cluster' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/linux/swap.h' line='231' column='1' id='723fef03'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='index' type-id='ed00f788' visibility='default' filepath='include/linux/swap.h' line='232' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='next' type-id='f0981eeb' visibility='default' filepath='include/linux/swap.h' line='233' column='1'/>
+        </data-member>
+      </class-decl>
       <class-decl name='snd_dma_device' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/sound/memalloc.h' line='19' column='1' id='724d481c'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='type' type-id='95e97e5e' visibility='default' filepath='include/sound/memalloc.h' line='20' column='1'/>
@@ -49029,6 +50249,7 @@
       </class-decl>
       <pointer-type-def type-id='a73b2f11' size-in-bits='64' id='73892d6d'/>
       <pointer-type-def type-id='2d2d4460' size-in-bits='64' id='738b5bc2'/>
+      <pointer-type-def type-id='a289efe7' size-in-bits='64' id='739356af'/>
       <union-decl name='xhci_trb' size-in-bits='128' visibility='default' filepath='drivers/usb/host/xhci.h' line='1351' column='1' id='73956807'>
         <data-member access='public'>
           <var-decl name='link' type-id='80702149' visibility='default' filepath='drivers/usb/host/xhci.h' line='1352' column='1'/>
@@ -49141,7 +50362,7 @@
       <pointer-type-def type-id='1e330b13' size-in-bits='64' id='74005b57'/>
       <pointer-type-def type-id='5cdc243f' size-in-bits='64' id='740a3d8b'/>
       <pointer-type-def type-id='f3d147c3' size-in-bits='64' id='740b5503'/>
-      <class-decl name='sched_class' size-in-bits='1792' is-struct='yes' visibility='default' filepath='kernel/sched/sched.h' line='1831' column='1' id='74191d27'>
+      <class-decl name='sched_class' size-in-bits='1792' is-struct='yes' visibility='default' filepath='fs/../kernel/sched/sched.h' line='1831' column='1' id='74191d27'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='uclamp_enabled' type-id='95e97e5e' visibility='default' filepath='kernel/sched/sched.h' line='1834' column='1'/>
         </data-member>
@@ -49354,7 +50575,6 @@
         <parameter type-id='b50a4934'/>
         <return type-id='f7b0e1b4'/>
       </function-type>
-      <pointer-type-def type-id='6e85ad52' size-in-bits='64' id='747013e8'/>
       <function-type size-in-bits='64' id='747e7623'>
         <parameter type-id='06b2cd14'/>
         <return type-id='df412e35'/>
@@ -49423,6 +50643,23 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='d12f4a1d' size-in-bits='64' id='74d89ebd'/>
+      <class-decl name='fscrypt_policy_v1' size-in-bits='96' is-struct='yes' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='40' column='1' id='74e2c23b'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='version' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='41' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='8'>
+          <var-decl name='contents_encryption_mode' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='42' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='16'>
+          <var-decl name='filenames_encryption_mode' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='43' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='24'>
+          <var-decl name='flags' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='44' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='master_key_descriptor' type-id='0209ab38' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='45' column='1'/>
+        </data-member>
+      </class-decl>
       <pointer-type-def type-id='ce67f06c' size-in-bits='64' id='74e71fae'/>
       <function-type size-in-bits='64' id='74e7a035'>
         <parameter type-id='02f11ed4'/>
@@ -49612,9 +50849,30 @@
       </class-decl>
       <pointer-type-def type-id='18c89148' size-in-bits='64' id='75d065d2'/>
       <pointer-type-def type-id='5a7d7f6d' size-in-bits='64' id='75d4b09d'/>
+      <class-decl name='fscrypt_policy_v2' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='66' column='1' id='75e2c3ce'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='version' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='67' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='8'>
+          <var-decl name='contents_encryption_mode' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='68' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='16'>
+          <var-decl name='filenames_encryption_mode' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='69' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='24'>
+          <var-decl name='flags' type-id='8f048e17' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='70' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='__reserved' type-id='c213d3d4' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='71' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='master_key_identifier' type-id='9396cabb' visibility='default' filepath='include/uapi/linux/fscrypt.h' line='72' column='1'/>
+        </data-member>
+      </class-decl>
       <array-type-def dimensions='1' type-id='80f4b756' size-in-bits='64' id='75e4a9bd'>
         <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
       </array-type-def>
+      <pointer-type-def type-id='e953a5bd' size-in-bits='64' id='75e6c41d'/>
       <pointer-type-def type-id='8d24b00b' size-in-bits='64' id='75e9503b'/>
       <enum-decl name='attr_idn' filepath='drivers/scsi/ufs/ufs.h' line='137' column='1' id='75eb1735'>
         <underlying-type type-id='9cac1fee'/>
@@ -49718,13 +50976,13 @@
       </function-type>
       <union-decl name='flowi_uli' size-in-bits='32' visibility='default' filepath='include/net/flow.h' line='46' column='1' id='76355708'>
         <data-member access='public'>
-          <var-decl name='ports' type-id='e7f4400b' visibility='default' filepath='include/net/flow.h' line='50' column='1'/>
+          <var-decl name='ports' type-id='e7f4404c' visibility='default' filepath='include/net/flow.h' line='50' column='1'/>
         </data-member>
         <data-member access='public'>
-          <var-decl name='icmpt' type-id='e7f4400c' visibility='default' filepath='include/net/flow.h' line='55' column='1'/>
+          <var-decl name='icmpt' type-id='e7f4404d' visibility='default' filepath='include/net/flow.h' line='55' column='1'/>
         </data-member>
         <data-member access='public'>
-          <var-decl name='dnports' type-id='e7f4400d' visibility='default' filepath='include/net/flow.h' line='60' column='1'/>
+          <var-decl name='dnports' type-id='e7f4404e' visibility='default' filepath='include/net/flow.h' line='60' column='1'/>
         </data-member>
         <data-member access='public'>
           <var-decl name='spi' type-id='78a133c2' visibility='default' filepath='include/net/flow.h' line='62' column='1'/>
@@ -49733,7 +50991,7 @@
           <var-decl name='gre_key' type-id='78a133c2' visibility='default' filepath='include/net/flow.h' line='63' column='1'/>
         </data-member>
         <data-member access='public'>
-          <var-decl name='mht' type-id='e7f4400e' visibility='default' filepath='include/net/flow.h' line='67' column='1'/>
+          <var-decl name='mht' type-id='e7f4404f' visibility='default' filepath='include/net/flow.h' line='67' column='1'/>
         </data-member>
       </union-decl>
       <pointer-type-def type-id='df510f4a' size-in-bits='64' id='763c550c'/>
@@ -49747,7 +51005,7 @@
           <var-decl name='index' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1828' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab5e8' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1829' column='1'/>
+          <var-decl name='' type-id='ac5ab65e' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1829' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='320'>
           <var-decl name='reserved' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='1833' column='1'/>
@@ -49768,14 +51026,6 @@
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='86717875' size-in-bits='64' id='76642109'/>
-      <class-decl name='kfifo' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/linux/kfifo.h' line='83' column='1' id='7664edcc'>
-        <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='' type-id='ac5ab5fa' visibility='default' filepath='include/linux/kfifo.h' line='83' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='buf' type-id='5e6516ee' visibility='default' filepath='include/linux/kfifo.h' line='83' column='1'/>
-        </data-member>
-      </class-decl>
       <function-type size-in-bits='64' id='766eac03'>
         <parameter type-id='fa0b179b'/>
         <parameter type-id='a7832498'/>
@@ -49816,7 +51066,7 @@
           <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2035' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='' type-id='ac5ab5e9' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2036' column='1'/>
+          <var-decl name='' type-id='ac5ab65f' visibility='default' filepath='include/uapi/linux/videodev2.h' line='2036' column='1'/>
         </data-member>
       </class-decl>
       <pointer-type-def type-id='a82172e0' size-in-bits='64' id='76a7b3fe'/>
@@ -50249,23 +51499,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='f3a6417e' size-in-bits='64' id='77da1114'/>
-      <class-decl name='eventfd_ctx' size-in-bits='384' is-struct='yes' visibility='default' filepath='fs/eventfd.c' line='32' column='1' id='77dc8383'>
-        <data-member access='public' layout-offset-in-bits='0'>
-          <var-decl name='kref' type-id='400fb07b' visibility='default' filepath='fs/eventfd.c' line='33' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='64'>
-          <var-decl name='wqh' type-id='b5ab048f' visibility='default' filepath='fs/eventfd.c' line='34' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='256'>
-          <var-decl name='count' type-id='d3130597' visibility='default' filepath='fs/eventfd.c' line='43' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='320'>
-          <var-decl name='flags' type-id='f0981eeb' visibility='default' filepath='fs/eventfd.c' line='44' column='1'/>
-        </data-member>
-        <data-member access='public' layout-offset-in-bits='352'>
-          <var-decl name='id' type-id='95e97e5e' visibility='default' filepath='fs/eventfd.c' line='45' column='1'/>
-        </data-member>
-      </class-decl>
+      <class-decl name='eventfd_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='77dc8383'/>
       <class-decl name='llist_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/linux/llist.h' line='54' column='1' id='77df194e'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='first' type-id='023b769e' visibility='default' filepath='include/linux/llist.h' line='55' column='1'/>
@@ -50813,6 +52047,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='79236ccf' size-in-bits='64' id='7a29ff27'/>
+      <pointer-type-def type-id='cf6ab69a' size-in-bits='64' id='7a2c7648'/>
       <function-type size-in-bits='64' id='7a348508'>
         <parameter type-id='bff05edb'/>
         <parameter type-id='cf29c9b3'/>
@@ -51083,7 +52318,7 @@
           <var-decl name='use_callback' type-id='b50a4934' visibility='default' filepath='include/linux/interrupt.h' line='625' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='192'>
-          <var-decl name='' type-id='ac5ab661' visibility='default' filepath='include/linux/interrupt.h' line='626' column='1'/>
+          <var-decl name='' type-id='ac5ab6bf' visibility='default' filepath='include/linux/interrupt.h' line='626' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='256'>
           <var-decl name='data' type-id='7359adad' visibility='default' filepath='include/linux/interrupt.h' line='630' column='1'/>
@@ -51229,6 +52464,7 @@
         </data-member>
       </class-decl>
       <pointer-type-def type-id='56a7b834' size-in-bits='64' id='7aa5a21e'/>
+      <pointer-type-def type-id='af01054e' size-in-bits='64' id='7aa98ff8'/>
       <class-decl name='snd_hwdep_dsp_status' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/uapi/sound/asound.h' line='131' column='1' id='7ac013b4'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='version' type-id='f0981eeb' visibility='default' filepath='include/uapi/sound/asound.h' line='132' column='1'/>
@@ -51430,6 +52666,7 @@
         <subrange length='10' type-id='7ff19f0f' id='487da03a'/>
       </array-type-def>
       <pointer-type-def type-id='e4205152' size-in-bits='64' id='7b15200c'/>
+      <pointer-type-def type-id='629e5a31' size-in-bits='64' id='7b1b6f25'/>
       <class-decl name='pcpu_rx_sc_stats' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/net/macsec.h' line='126' column='1' id='7b2b38d1'>
         <data-member access='public' layout-offset-in-bits='0'>
           <var-decl name='stats' type-id='7a9d0373' visibility='default' filepath='include/net/macsec.h' line='127' column='1'/>
@@ -51455,11 +52692,36 @@
       </function-type>
       <pointer-type-def type-id='8aecb761' size-in-bits='64' id='7b4e3cad'/>
       <pointer-type-def type-id='71f18ea5' size-in-bits='64' id='7b4ee155'/>
-      <class-decl name='kernfs_iattrs' is-struct='yes' visibility='default' is-declaration-only='yes' id='7b5435ce'/>
+      <class-decl name='kernfs_iattrs' size-in-bits='704' is-struct='yes' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='21' column='1' id='7b5435ce'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='ia_uid' type-id='d80b72e6' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='22' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='32'>
+          <var-decl name='ia_gid' type-id='094d8048' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='23' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='ia_atime' type-id='40a816ad' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='24' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='ia_mtime' type-id='40a816ad' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='25' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='ia_ctime' type-id='40a816ad' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='26' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='448'>
+          <var-decl name='xattrs' type-id='00ed5110' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='28' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='640'>
+          <var-decl name='nr_user_xattrs' type-id='49178f86' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='29' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='672'>
+          <var-decl name='user_xattr_size' type-id='49178f86' visibility='default' filepath='fs/kernfs/kernfs-internal.h' line='30' column='1'/>
+        </data-member>
+      </class-decl>
       <function-type size-in-bits='64' id='7b596412'>
-        <parameter type-id='5474f420'/>
-        <parameter type-id='bbaf3419'/>
-        <parameter type-id='f0981eeb'/>
+        <parameter type-id='5474f420' name='tfm'/>
+        <parameter type-id='bbaf3419' name='seed'/>
+        <parameter type-id='f0981eeb' name='slen'/>
         <return type-id='95e97e5e'/>
       </function-type>
       <pointer-type-def type-id='ebf8e47f' size-in-bits='64' id='7b5a288b'/>
@@ -52012,6 +53274,9 @@
         <enumerator name='HDMI_3D_STRUCTURE_TOP_AND_BOTTOM' value='6'/>
         <enumerator name='HDMI_3D_STRUCTURE_SIDE_BY_SIDE_HALF' value='8'/>
       </enum-decl>
+      <array-type-def dimensions='1' type-id='3e9ce682' size-in-bits='4800' id='7c702142'>
+        <subrange length='75' type-id='7ff19f0f' id='62dd0131'/>
+      </array-type-def>
       <pointer-type-def type-id='e30804d9' size-in-bits='64' id='7c70f4dd'/>
       <array-type-def dimensions='1' type-id='0f8b1896' size-in-bits='infinite' id='7c792e5e'>
         <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
@@ -52088,7 +53353,7 @@
           <var-decl name='type' type-id='3f1a6b60' visibility='default' filepath='include/uapi/linux/videodev2.h' line='861' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='160'>
-          <var-decl name='' type-id='ac5ab5e0' visibility='default' filepath='include/uapi/linux/videodev2.h' line='863' column='1'/>
+          <var-decl name='' type-id='ac5ab65b' visibility='default' filepath='include/uapi/linux/videodev2.h' line='863' column='1'/>
         </data-member>
         <data-member access='public' layout-offset-in-bits='352'>
           <var-decl name='reserved' type-id='839e8989' visibility='default' filepath='include/uapi/linux/videodev2.h' line='868' column='1'/>
@@ -52187,7 +53452,92 @@
       </function-type>
       <pointer-type-def type-id='c2cd30e2' size-in-bits='64' id='7d55f1e4'/>
       <typedef-decl name='pci_channel_state_t' type-id='f0981eeb' filepath='include/linux/pci.h' line='181' column='1' id='7d5a17ad'/>
-      <class-decl name='phylink' is-struct='yes' visibility='default' is-declaration-only='yes' id='7d5dfb1c'/>
+      <class-decl name='phylink' size-in-bits='3520' is-struct='yes' visibility='default' filepath='drivers/net/phy/phylink.c' line='40' column='1' id='7d5dfb1c'>
+        <data-member access='public' layout-offset-in-bits='0'>
+          <var-decl name='netdev' type-id='68a2d05b' visibility='default' filepath='drivers/net/phy/phylink.c' line='42' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='64'>
+          <var-decl name='mac_ops' type-id='f6203fc2' visibility='default' filepath='drivers/net/phy/phylink.c' line='43' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='128'>
+          <var-decl name='pcs_ops' type-id='a6424831' visibility='default' filepath='drivers/net/phy/phylink.c' line='44' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='192'>
+          <var-decl name='config' type-id='0dc3586b' visibility='default' filepath='drivers/net/phy/phylink.c' line='45' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='256'>
+          <var-decl name='pcs' type-id='944c4ff9' visibility='default' filepath='drivers/net/phy/phylink.c' line='46' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='320'>
+          <var-decl name='dev' type-id='fa0b179b' visibility='default' filepath='drivers/net/phy/phylink.c' line='47' column='1'/>
+        </data-member>
+        <data-member access='public' layout-offset-in-bits='384'>
